{"scores":{"Fall '15":{"course_score":{"overall":"4.50","workload":"8.00","difficulty":null,"recommendation":"4.20","enrollment":"4","response rate":"100.00","QCourseOverall":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":"PSY 980f","course_id":"4237","cat_num":"89069","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"1","3s":"2","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.40","workload":"2.90","difficulty":null,"recommendation":"4.20","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":"PSY 980f","course_id":"4237","cat_num":"89069","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"1","3s":"2","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.50","workload":"1.80","difficulty":"2.00","recommendation":"4.80","enrollment":"4","response rate":"100.00","QCourseOverall":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":"PSY 980f","course_id":"4237","cat_num":"89069","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"1","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 980f","cat_num":"89069","course_id":"4237","year":"2013","term":"1","id":"60ff6714daedb602e4bbcf8dfcab2f6c","first":" Irene M.","last":"Pepperberg","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.30"}]},"Fall '12":{"course_score":{"overall":"4.17","workload":"2.17","difficulty":"3.00","recommendation":"4.17","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":"PSY 980f","course_id":"4237","cat_num":"89069","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"1","3s":"2","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.67","workload":"2.00","difficulty":"2.83","recommendation":"4.33","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":"PSY 980f","course_id":"4237","cat_num":"89069","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"1","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 980f","cat_num":"89069","course_id":"4237","year":"2011","term":"1","id":"60ff6714daedb602e4bbcf8dfcab2f6c","first":"Irene M.","last":"Pepperberg","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.33","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Fall '11":{"comments":["If you want to learn animal cognition directly from a leading expert in the field, then take this class!","So interesting, throughout the course!  The studies we went over turned out to be exactly the kind of work I'm interested in.  I had never really been excited to take a small seminar before; the small format was perfect.  Professor Pepperberg is full of experience and stories (and we read a number of her papers!), and she is great at facilitating discussion without being confrontational.  A couple of paper assignments count for a significant portion of your grade, however, and explicit preparation for these is minimal; beware!  Ask good questions to gain a clearer understanding of what's expected of you!","You will certainly learn a lot about animal cognition in general, but if you want to delve deep into the cognition of one species in particular, this may not be the class for you.","it is a very interesting class and professor pepperberg has a unique background and awesome research experience (ask to skype with her parrots!).  however, be warned that the class is very much focused on the articles we read and experimental design and not an overview of the cognitive abilities of animals.","You won't think of the natural world the same way after this course","You learn some really interesting things about animals in this class--birds, bees, dolphins, and primates are capable of very surprising things. I would've liked to focus on dogs more, and the midterm and final paper kind of snuck up on me, but otherwise the class is excellent. There's a fair bit of reading for every meeting, but if you're not presenting that week, there's less pressure to remember every little detail in the articles. Dr. Pepperberg is very knowledgeable--take this class if you're at all interested in animal intelligence, because she's an expert!"]},"Fall '12":{"comments":["pepperberg is friendly and knowledgable but she's not great at encouraging discussions, which is disastrous in a seminar format.","This was one of my favorite classes so far. The readings were extremely interesting and fun to read. The class discussions were thought-provoking and challenged me to think about Psychological mechanisms in new and intriguing ways. Plus, the class as a whole provided invaluable practice in critiquing and proposing experiments and left me with a firm grasp on what constitutes a sound experimental design.","If you want to critique papers with an expert in the field of animal cognition, this is the class for you.","Sometimes the meetings can seem a bit long.","This class presents the rare opportunity to learn from one of the trail-blazers in the field of animal cognition. Be prepared to read and critique numerous scientific experiments in animal cognition. Some experience in designing a study may be helpful."]},"Fall '13":{"comments":["What a wonderful opportunity to study with an animal cognition legend! I feel so lucky to have been able to learn from Dr. Pepperberg in such a small class (only 4 people this year). She is so knowledgeable about just about every study that has been done in the field of animal cognition. As she told us throughout the semester, her hope for the class was that we learn how to examine scientific papers critically, and we certainly got plenty of practice doing that. We took turns leading the discussion of a number of scientific papers each week, and Dr. Pepperberg taught us what to look for and be aware of as we went through them. The midterm (writing a critique of a paper) was actually a lot of fun, and the final (designing and writing up a new experiment with a species we had not read about in class) was a good challenge. \r\n\r\nEven though I so enjoyed having such a small class, I would enthusiastically encourage everyone to take this class. This is an opportunity that should not be missed! Dr. Pepperberg has so much knowledge, experience, and enthusiasm to share, and she is so down-to-earth and kind...it would be a shame if more people didn't take this course next time it is offered!"]},"Fall '14":{"comments":["This class is what you make of it and how much effort you are willing to put into the journal readings","It's a great time.  Time is used well and in a great way.","Take advantage of Irene's experience to ask questions only someone like her could answer.","Take it if you're unsure! Especially if you 1) need a class with manageable workload, not much time commitment, 2) are considering writing a psych thesis, since this will teach you a lot about how to design a good study, be really critical of all your methods, etc.","This was a great course! Dr. Pepperberg is outstanding in her field, and gives great insights into the field of animal cognition as a whole, but also what it's like to work with animals and in the scientific community as a whole. The way our class worked this semester was that two students would present the articles each week (which ended up being about two presentations per student). This way, we had to be pretty well versed those two weeks, but could get by with just skimming the articles the other weeks, so the course load was generally pretty low.","good and interesting course","This class was phenomenally interesting and did not require much work. Getting to interact with Professor Pepperberg was amazing. Take this course if you are at all interested in animals! So fantastic!","If you are looking for a pretty chill class where you meet once a week and sort of zone out while the student discussion leaders for that week summarize papers everyone supposedly \"read\" for 2 hours, then this is the class for you. I was personally hoping for more active discussion since this is a topic I really enjoy, but was pretty much subjected to hearing a 2-hour summary in painful detail (how else does one fill up that time?) of papers I had already read, as assigned.  This agenda in no way prepared us to write a serious critique of a scientific paper (which was the midterm) or write a project proposal (which was the final), but luckily I came in already having the skills to do so and I would recommend doing the same or else you might have some struggles.  Dr. Pepperberg was great and had some really interesting things to share with us, but to be honest I'm not really sure what I got out of this class."]},"Fall '15":{"comments":["Worth it for how closely you get to interact with Dr. Pepperberg.\r\nYou learn far more than the material listed on the syllabus","If you have the opportunity to take this class, do it. Irene is famous and for good reasons. She is a pioneer in animal cognition and has done, and continues to do, amazing work. More than that though, she is very knowledgeable about the field and knows all about the scientists who do research in animal cognition. Her life story and the challenges she has faced (and overcome) in her career are also very inspiring. You learn a lot in this class and in a pretty relaxed way. There is a lot of journal reading though, so you must be up for doing that. The two grades in class are the midterm and final papers. However, these are a lot more difficult to do than you're probably used to (even if you've taken a lot of advanced level psychology courses). 100% worth the effort."]}},"mostRecentQ":{"overall":"4.50","workload":"8.00","difficulty":null,"recommendation":"4.20","enrollment":"4","response rate":"100.00","QCourseOverall":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":"PSY 980f","course_id":"4237","cat_num":"89069","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980F","course_id":"4237","cat_num":"107432","1s":"0","2s":"1","3s":"2","4s":"0","5s":"0"}},"success":true}