{"scores":{"Fall '15":{"course_score":{"overall":"4.80","workload":"4.50","difficulty":null,"recommendation":"4.90","enrollment":"34","response rate":"94.12","QCourseOverall":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"0","2s":"0","3s":"1","4s":"3","5s":"28"},"QDifficulty":{"number":"GHHP 60","course_id":"2146","cat_num":"52527","1s":"1","2s":"9","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"1","2s":"28","3s":"0","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.60","workload":"5.00","difficulty":null,"recommendation":"4.60","enrollment":"32","response rate":"78.12","QCourseOverall":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"0","2s":"0","3s":"1","4s":"3","5s":"28"},"QDifficulty":{"number":"GHHP 60","course_id":"2146","cat_num":"52527","1s":"1","2s":"9","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"1","2s":"28","3s":"0","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.22","workload":"1.61","difficulty":"2.39","recommendation":"4.67","enrollment":"19","response rate":"100.00","QCourseOverall":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"0","2s":"0","3s":"1","4s":"3","5s":"28"},"QDifficulty":{"number":"GHHP 60","course_id":"2146","cat_num":"52527","1s":"1","2s":"9","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"1","2s":"28","3s":"0","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.40","workload":"1.65","difficulty":"2.50","recommendation":"4.52","enrollment":"49","response rate":"97.96","QCourseOverall":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"0","2s":"0","3s":"1","4s":"3","5s":"28"},"QDifficulty":{"number":"GHHP 60","course_id":"2146","cat_num":"52527","1s":"1","2s":"9","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"1","2s":"28","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '11":{"comments":["The class is very low stress and will not require much time or effort. The guest speakers make the class, and their talks will be some of the most memorable of your Harvard experience. The general concepts discussed by the course and really interesting and applicable. That being said, the course (at least in it's first year) lacked any sort of trajectory and became very redundant after a while. Hopefully they can make some organizational improvements.","This is an absolutely amazing course. One of my favorite courses by far. The concepts you learn in this class can reach all aspects of your life from home, friends, to jobs. It really takes fundamental problems of negotiations and shows what can be done to escape a doomed one.","So much fun. A 3-hour class has never gone by so quickly, and each class leaves you wanting more. Prof Shapiro is so dynamic and passionate about the subject. Workload isn't that high but you do learn a lot and the material you learn reframes the way you think about negotiations in your daily life. Class is extremely interactive and always fun. One thing is that the grading guidelines aren't that clear so it's hard to gauge how well you're doing- but it's pretty hard to do really poorly.","This course is a great exploration into negotiation and is highly applicable to everyday negotiations with roommates, parents, friends and significant others.  The course will make you evaluate those interactions through journals, a really interesting way of understanding concepts that apply to international negotiations as well.","It is your unconventional course with a small tight-knit group of students, many hours of exciting negotiations,and just phenomenal teaching staff and guest lecturers. Be ready for an adventure as each class is almost a performance in and out of itself.","It is an awesome class. Professor Shapiro is one of the best. You really learn how to sort the art of negotiation into understandable concepts, which is very helpful for conflict management skills. TAKE THIS COURSE!","This is by far the best course I have ever taken at Harvard. This is the kind of course that makes you think about the topic outside of class. This is the kind of course that makes you realize that tuition might just be worth the money. The professor is amazing as are the TFs. My life is complete because I took this course.","This course will change the way you think about yourself, about others, about leaders, about negotiation and about the world around you. It's just one of those classes that, honestly, makes you say, \"Only Harvard.\"","Professor Shapiro is a phenomenal lecturer, and the case studies and guest speakers we had were awesome. Assignments were relatively easy but feedback could have been better.","It is such an amazing course. You will learn so much and take so many concepts from the classroom and apply them in the real world. Professor Shapiro is excellent and always makes the class exciting. He is beyond knowledgable and impressive. There is a lot of interaction so it is impossible to be bored in class.","This class has probably been the most applicable to real life. However, I feel like after the first couple of lectures, it got very repetitive. Professor Shapiro is an amazing lecturer and I think once a couple kinks in terms of the lecture structure and assignments are worked out it will be a much more rewarding course than it has been for me.","This class is really hands-on, and the professor is engaging and tremendously energetic.  You learn a lot from the in-class exercises, which are always jam-packed and suspenseful!  You'll really grow as a person from this class. Grading\/rubrics were unclear and the assignment structure was less than ideal, but this could be worked out in future years.  I can't tell you if this class is hard or easy - it seemed to be a straightforward and really informative learning experience at the time, but we haven't gotten any letter grades to really show what the standards of excellence were.","Every Harvard student should take this course before graduating.  Seriously.","AMAZING CLASS! Best I've taken at Harvard.","If you are interested at all in negotiation\/conflict management especially in the context of ethnic\/religious\/inter-state conflicts, you MUST take this class. The skills you learn are invaluable and it is the only class I have taken where I am walking away with concrete skills. I have used the techniques and concepts discussed in class in my day-to-day conflicts that arise. Also, professor Shapiro is amazing-- he's such a great professor, really energetic, and very helpful.","It is amazing and it will change the way you approach problems and mean people in life!","Take this class. Shapiro is phenomenal. You'll thoroughly enjoy it.","Overall a great course; do seek Professor Shapiro - very enthusiastic to engage with students and knowledgeable; hopefully the course will be slightly reworked in terms of assignments and returning assignments (first year problems)","Take this class! Professor Shapiro is outstanding, and the class is a rare opportunity to step back, analyze yourself and your life, acknowledge your strengths and weaknesses, and to do all of this within the framework of a rigorous course that has applications to everything from arguing with your mom to post-war treaty negotiations.","LOVED THE CLASS.","This class is so much fun! I learned a lot and Prof. Shapiro is great. Take it pass fail and you will love it!","I'd recommend the course purely on the basis of the professor and the course staff. The concepts in the course also so useful in every day conflict management and negotiation!","Such an interesting class! Professor Shapiro is so enthusiastic about the material, and this course is really applicable to every aspect of relationships, careers, and interpersonal interactions. Definitely worthwhile to take this class at Harvard.","It was surprising, fun, and Professor Shapiro is AMAZING. He is one of the best professors I've had. However, I did not like assignments, and the course sometimes seemed disorganized. I think it will probably improve next year.","A very exciting class! Be prepared to be very involved during class. The 3 hours can be exhausting sometimes though.","Take this course! You won't regret it.","Best class: great professor and teaching staff, practical and fascinating topics\/skills, stimulating teaching method, and great assignments. But the grading sucks: hard to understand rubric, unfair\/biased grading, lack of transparency and clear structure.","This class was the best! The three hours flew by. Shapiro is a fascinating person and always brought in really cool speakers. The journals were a cathartic experience.","This class was one of my favorite classes of all time here. Professor Shapiro is awesome and dedicated, and the class consists of many engaging and interactive activities that are relevant and applicable to your personal life. The class is laid-back and fun ( it resembles a semester long leadership camp), and the concepts you will learn are some you will remember for your entire life. The one downside was the subjective grading. Oftentimes I felt like I was back in high school, where razzle-dazzle, superficial work was rewarded more often than actual content.","This was definitely one of my favorite classes at Harvard.  It is unique in that it is interactive and case-based, with many small group exercises to apply the concepts.  The professor is amazing, and the negotiation tactics and things you learn about conflict management will be applicable in your daily life and personal interactions, as well as in international relations.  You're missing out if you don't take this course!","Best class I've ever taken at Harvard. Shapiro is the most awesome person I've ever met, and what he teaches is vital and applicable to every area of life. Also, the lectures are so much fun.","It is the best course I have taken thus far at Harvard! Take this course.","This course is so much fun and so useful for anything you do in life. Being a good negotiator and being able to manage conflict in a good way is key for a successful career and a stable personal life. This class gives you a great introduction to the essential concepts and skills of both conflict resolution and negotiation.","This is an amazing course.  You will get a lot out of it in negotiating skills.  The professor is great and has quite a few surprises in store for the class during the semester.  Don't think twice about taking this course!","Here is what you will learn in this class: Show appreciation for other beliefs and ideas and try to build affiliation with other people; OMG, I bet you didn't know that! The same concepts are shamelessly recycled over and over again. I learned nothing and may not even get an A in this intellectually- patronizing  class. Shapiro is a really boring lecturer and repeats himself to the point of exhaustion.I also felt like I had to participate in class all the time, being forced to say the stupidest and most self-condescending things that have ever come out of my mouth. Stay away and if you are looking for an easy A, make sure that you choose a class that has at least SOME legitimacy and content.  Probably one of the worst classes ever taught in the history Harvard."]},"Fall '12":{"comments":["This is a unique course at Harvard in that the lessons and skills you learn are immediately applicable in daily life. If you invest yourself in this class, you have the potential to change your mind-set on conflict management. While the class does have a strong international focus, the interpersonal side is where the true strength lies. By learning about your negotiation style, you expand your autonomy and empower yourself to continue learning even after the course ends.\r\n\r\nPros:\r\n- Interactive activities\r\n- Food in class\r\n- Diverse student body that facilitates your learning\r\n- Practical advice\r\n\r\nCons:\r\n- Somewhat disorganized at times (if they do not tell you about the final project for a really long time, ask about it!)\r\n\r\nAdvice:\r\n- Go to office hours for your papers and general discussions. Both Shapiro and Sorapop have amazing lives and stories that will really impact you. \r\n\r\nOverall evaluation: If you are remotely interested in negotiation and\/or the psychology of interpersonal interactions, then this would be a great class to take. If you make it through the lottery, TAKE THE CLASS!","Great class!","This class changed the way I think about problem solving - applicable, methodical strategies.  Although some of the concepts were a little abstract, I thoroughly enjoyed coming to this class every week.  It felt like a workshop, and I felt like I learned so much with each session.  Such a supportive teaching staff, too!","It's an interesting, engaging class that will definitely be a welcome change of pace from your other classes. The pace can be a bit slow, but the workload is reasonable and it's a pretty enjoyable experience overall.","This is a great class that is low stress, but also lets you learn something concrete that changes how you view conflict from this point on. There are many takeaways from this course, and I always enjoyed the 3 hours I spent here every Monday!","This class was great in the beginning but got a little unorganized by the end.  It is a simple class and Professor Shapiro and Sorapop (the TF) are great! The assignments are very simple to do and this class does not require much work at all.  The things you learn from this class and take away with are helpful for everyday negotiations you have with family members and friends. And it's also pretty cool that you get to meet a few political leaders throughout the semester!","This is the most engaging course that I have taken during my time at Harvard. I had a ton of fun in the class participating in the different group activities. Moreover, and most importantly, I feel like I learned a great deal about myself as a negotiator that I can apply in my everyday life.","This class is fantastic.  It is definitely worth it, and I have recommended it to everyone that I have talked to.  Professor Shapiro is engaging, enthusiastic, and has incredible life-experience in negotiation. The core course concepts are simple, yet completely effective and has infiltrated my daily functioning and thinking.  The seminar style (3hrs a week, on one day) is effective and is a good balance for any schedule.   The work is manageable, with two large papers, and a great deal of class participation.  The papers are challenging, yet fun to write as they are completely relevant to life today!  This course was a fantastic highlight to my semester.  TAKE THIS CLASS! :D","Take this class! It will not only make you a more effective negotiator and communicator, but it will also teach you a lot about yourself. The teaching staff's dedication to the class and the students is second to none at Harvard. It's one of the classes you will remember 20 years from now, and one of the truly special opportunities only a Harvard education can offer.","A truly incredible course. The world class professor leads a highly interactive class that teaches you tangible skills that are immediately applicable to the real world. There is nothing else like it that I have been able to find in my 4 years at Harvard.","This class is engaging and interesting, and does teach you the valuable skill of negotiation. It is easy, and most of the work you do for this class will be during the three hour class time. Take it, and enjoy it, but don't have unreasonable expectations about how this class will change your life. Professor Shapiro is really fun and smart - definitely get to know him!","The concepts thought in this class will be useful in many aspects of your relationships with others.","I took away tangible skills that I use very frequently now! BEST COURSE I'VE TAKEN AT HARVARD."]},"Fall '14":{"comments":["Very involved and nice professor and teaching fellows. However, once you get about midway through the course, it feels like you're just practicing what you've already learned without learning new things.","a","This class is amazing because of the fantastic teaching team and the fascinating subject. I really believe that this is one of those college classes that completely changed the way I look at the world. The three hour class each Monday never seemed too long because we would have about one hour of lecture and then about another hour for simulations when we had to try to negotiate and try to apply the concepts we learned. This structure really brought to life the topics we covered in class. Professor Shapiro and the TF are also just wonderful. Shapiro is an amazing lecturer! All of them really foster a community inside of the classroom, enabling the students not only to negotiate and apply the concepts we learned, but also making space for friendships to foster. I learned so much about how to change my approach to relationships across any spectrum of my life while also making new friends and mentors.","Definitely a must-take class if you can get in. Obviously, like with any lotteried course, it is difficult to get in unless you know the instructor in some capacity or have contacted him previously (like hundreds of other people do). My suggestion is to play up the diverse perspective you will bring to the class as well as to show up early to the first class and participate, or at least search out Professor Shapiro separately before the semester you want to take this class in order to get on his radar. It is worth the effort invested to get into the class. The content is fairly straightforward but it is the out-of-class discussions with the highly invested teaching team that really allows this class to flourish.","It's fantastic!","This class is amazing. Although you will have days where you become disillusioned with the course, the teaching team is incredible and you will learn from them.","Best course I have taken at Harvard. Learnt a lot and put in very little work. Very applicable to real life. Shapiro is a real bro.","Highly recommend this class. You will learn a lot about negotiation, and have fun doing it.","This course was amazing!  Although it was not in any way related to global health (as it is listed), the skills learned over the course of the semester will be immensely helpful later in life.","TAKE THIS COURSE!","This is THE class to take. I don't think anyone should graduate from Harvard before taking this class. I can confidently say it is the best course available, and Professor Shapiro is both one of the best people and professors I have met. He cares for his students so much and makes so many initiatives to get to know every single one--one very rarely sees this characteristic in a professor, especially one with Prof Shapiro's prominence. The class will change your entire outlook on life!","Great course, very easy and you learn useful material for the real world. It is a gem!","This is a fantastic class! Prof. Shapiro is incredibly knowledgeable, engaging and passionate about the subject matter. Plus he and the teaching staff really care about the students. You'll learn a lot about the art of negotiation, and I was able to apply to many aspects of my personal and academic life, and see an immediate impact. The more you put into this class, the more you get out of it!","This is my favourite class from Harvard so far.","Fantastic class. The stuff this course teaches you will stay with you and help you in difficult situations (especially in business and politics) for the rest of your life. This is one of those few classes at Harvard that truly make the $68k sticker price of Harvard worth it. Prof. Shapiro is awesome and the classes are really fun. Workload isn't too bad either. TAKE IT!","AMAZING CLASS! Actually life changing.  Probably the best class at Harvard. Professor Shapiro is absolutely phenomenal and excited about everything - half the class is figuring out conflict resolution in your own life and the other half is about how to make the world a better place.  EVERYONE SHOULD TAKE THIS CLASS! TO LIVE IN THE REAL WORLD THIS CLASS IS IMPERATIVE!!!","The class is incredibly fun and the professor is engaging, but the material feels fabricated and not very realistic.","ATTENDANCE POLICY is extremely strict. Be very wary, especially if you have job or grad school interviews during the semester you're taking the class, because the course administrators, although they understand these things are important\/inflexible\/unavoidable\/must be prioritized, will not exempt you from the grade deductions. Aside from that, course teaches invaluable skills. I don't regret taking it, despite the hit my grade took from having to miss class twice. Course felt repetitive at some times, but I felt the repetition was useful for drilling in these ideas that seem obvious but that we NEVER really put into use in our daily lives.","The teaching staff of this course was absolutely incredible. They were so passionate and helpful, which made the course very well organized and more interesting. The general topic of the course is highly interesting, but there's a lot of repetition of very basic course concepts that I think took useful time away from talking about more international negotiations\/conflicts. However, I would definitely recommend this course for those interested in global health!","This class may possibly be my favorite at Harvard to date! The teaching team is amazing and the classes are so much fun. Three hours might seem long, but it flies by. This is also one of those classes in which you learn skills and lessons that are incredibly applicable to the real world, regardless of what career path you may choose to pursue. I would recommend this class as one that every student should try to take before they graduate - I loved it!","The professor and course simulations make the class. The tools help in everyday life more so than you would think, and being open to learning how you approach conflict situations is certainly helpful. The class is great for a fresh perspective!"]},"Fall '15":{"comments":["Such a fun and highly unique class at Harvard! Three hour seminars may seem long but they are very interactive and go by quickly! Professor Shapiro is very engaging and the material is interesting and practical to know for your everyday interactions. Journal assignments helped me reflect about my own interpersonal relationships. There are also a few guest appearances that will be jaw dropping. Overall, a fun class that you should take if you have the chance! Also get to know Shapiro, I wish I went to more of his office hours, but he' just such a cool dude!","Absolutely incredible class. Dr. Shapiro and the teaching staff are amazing and all of the things you learn about are so relevant to everyday life.","THIS CLASS WILL CHANGE YOUR LIFE. This was an absolutely beautiful class - it manages to present negotiation principles in easy-to-understand, easy-to-apply frameworks that will stick with you for a lifetime. This is going to sound incredibly strange, but sometimes I felt like class was therapy - there was something incredibly healing and hope-giving about the concepts learnt in class and the way Prof Shapiro (the real MVP) taught them. Often, this class would be the highlight of my day. The emphasis on introspection forces you to not just grapple with the dynamics at play within yourself, but also provides you with concrete solutions on how to objectively deal with them in a way that is entirely kind and loving to yourself. \r\n\r\nThis is what true leaning looks like, and I believe GHHP 60 should be made a required class for all undergraduates.","This class changed my lifeâ€”at least three different times. Within one week, I learned enough to justify taking the course. By the end of that first week, I was using course concepts in negotiations with my peers. By the end of the third week, I was using course concepts to strengthen my friendships and resolve interpersonal conflicts. By the end of the course, I felt I understood why inter-group conflicts are so hard to resolve, and I believed I had acquired a skill set that would make it possible for me to work toward resolving those conflicts.","The lectures are extremely fun and engaging and definitely draw you in. I would caution you that sometimes expectations are extremely unclear and grading is very slow so you will complete many assignments before you have any idea where you stand in terms of grading and feedback.","This is one of the rare magical classes at Harvard. Ignore the \"GHHP\" part of the title, this is a class on Negotiation that is applicable to any and every student. You will leave a more capable human being. You will have better relationships both personally and professionally because of the conflict resolution skills you learn in this class. Take it.","This is one of the best classes I've taken at Harvard. You learn a lot about negotiation and conflict management from personal to business to international contexts. The class environment is very open and energetic, you have the change to know your classmates and their beliefs more deeply, and the teaching staff is very supportive.","A relevant, engaging and exciting class. Take it!","Super fun class. Very engaging lectures, so many cool in-class activities","the teaching staff all really care about students and want you to learn. make good use of office hours and the eercises to maximize your learning!","This class is awesome! Prof. Shapiro and the teaching staff are great, and the material is very applicable to everyday life.","Take this class. It changes the way you think about the world and about yourself. Daniel Shapiro is one of the most inspiring professors I have met.","This was the best class I've ever taken. It is incredibly exciting, interesting, and informative. I feel like I can use what I learned in this course in anything I should choose to do in the future. It relates to any career or aspect of everyday life. Professor Shapiro is absolutely wonderful and enthusiastic and really cares about the course and his students. If you're going to take one elective at Harvard, it should be GHHP60.","You will a meet a president.","This is an amazing class with some of the most amazing professor you will meet! The material is engaging, the guests are truly inspirational, and the concepts make you think very hard about your own faulty understanding of negotiations and compromise.","This is a fantastic course and a rare opportunity at Harvard to have hands-on in-class exercises that will apply to your day to day life. Be prepared to be vulnerable, to share personal experiences, and to delve into your emotions during class and during written assignments. Professor Shapiro and the teaching team work hard to make the class content relevant to current event issues, and you'll hear from some fabulous guest speakers who are experts in the field.","This class is worth taking for anyone even if you don't think of yourself as a negotiator. The principles of this course can be applied to everyday life, and are useful. The course leaders are good, they care and are passionate about the class. The readings are often long and detailed and are never talked about in the class so they feel at times useless. The course work is returned very late so it is hard to learn from the feedback. similarly, the majority of the written assignments are due at the end of the class so there is no real opportunity to learn from comments on the final project or paper. In the end take this class, unless you think you will have to miss any of the classes. The absentee policy is the strictest i have seen. Even if you are absent for a religious reason you will be expected to write a 15 page paper to make up one missed class.","A must take. And try to take it as soon as you can in your Harvard career so you can take part in the other negotiation opportunities at Harvard!!! Do try to use the concepts in your own life and see the difference they make. And go to office hours, if you can!!!!","TAKE THE COURSE! BEST DECISION EVER!","This course is amazing and eye-opening in every possible way. I truly loved it and enjoyed it so much! Definitely one of the best classes I have taken at Harvard.","If you're looking at this guide, then stop and go and shop it. One of the best classes offered at Harvard. This class teaches real, tangible skills that I now use in my everyday life. The teaching staff are incredible, lectures aren't lectures, they're just interesting and a ton of fun, and all the assignments really challenged me to think in a good way. Beg, steal, borrow (or negotiate!) to get into this class. You will not regret it. If you're a freshman, start trying to take it.","This is the best class you can ever take at Harvard, and I would be surprised if anyone who took this class disagreed with me. Prof. Shapiro is passionate and inspiring and is at the forefront of some of the most important issues facing our world. The content is exceptionally interesting and relevant to both our individual lives and to the world. Class is so fun every week - you would not believe it possible that a 3 hour class could be fun, but each week it was my highlight. Exposed to some of the most important people in the various world conflicts, and some of the actions these people are taking to reach peace. Introduces a new way of thinking about dealing with people of other cultures and the possibility of a peaceful future.","This is the best, most useful class you will ever take at Harvard. The assignments are easy but worthwhile. Shapiro is the single-most engaging faculty member I have met during my time here. Everything (and I mean everything) you learn in this class is applicable in your daily life. Just take it."]}},"mostRecentQ":{"overall":"4.80","workload":"4.50","difficulty":null,"recommendation":"4.90","enrollment":"34","response rate":"94.12","QCourseOverall":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"0","2s":"0","3s":"1","4s":"3","5s":"28"},"QDifficulty":{"number":"GHHP 60","course_id":"2146","cat_num":"52527","1s":"1","2s":"9","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GHHP 60","course_id":"2146","cat_num":"107669","1s":"1","2s":"28","3s":"0","4s":"0","5s":"0"}},"success":true}