{"scores":{"Fall '12":{"course_score":{"overall":"3.57","workload":"2.00","difficulty":"3.57","recommendation":"3.71","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.146","course_id":"1690","cat_num":"62224","1s":"0","2s":"3","3s":"4","4s":"3","5s":"4"},"QDifficulty":{"number":"EXPOS 20.146","course_id":"1690","cat_num":"62224","1s":"0","2s":"1","3s":"6","4s":"5","5s":"2"},"QWorkload":{"number":"EXPOS 20.146","course_id":"1690","cat_num":"62224","1s":"4","2s":"7","3s":"2","4s":"1","5s":"0"}}},"Fall '11":{"course_score":{"overall":"3.50","workload":"2.14","difficulty":"3.57","recommendation":"3.21","enrollment":"14","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.146","course_id":"1690","cat_num":"62224","1s":"0","2s":"3","3s":"4","4s":"3","5s":"4"},"QDifficulty":{"number":"EXPOS 20.146","course_id":"1690","cat_num":"62224","1s":"0","2s":"1","3s":"6","4s":"5","5s":"2"},"QWorkload":{"number":"EXPOS 20.146","course_id":"1690","cat_num":"62224","1s":"4","2s":"7","3s":"2","4s":"1","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.146","cat_num":"62224","course_id":"1690","year":"2011","term":"1","id":"0524a50b5202218f335c65e02ae9ed13","first":"Eoin","last":"Ryan","InstructorOverall":"3.86","EffectiveLecturesorPresentations":"3.71","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.07","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.27","ReturnsAssignmentsinTimelyFashion":"2.91"}]}},"comments":{"Fall '11":{"comments":["First, let me say this course IS somewhat interesting, and will cover a few things which will probably make you think, and will be intriguing, but what you pay to think  about these thinks are not worth it. Just go read Descartes. There are so many issues I did not like about this course. First off, the papers were impossible to write. You were expected to write an essay which had a strong thesis and supporting evidence. This doesn't sound hard, but it was. Philosophy can be interpreted in so many ways that it is impossible to provide concrete evidence to support your point. Therefore, your my essays received pretty terrible grades. On top of that, you will never go over how to write a philosophy essay. And then if you eventually figure out how to write a philosophy essay, the format for it will mostly likely not apply to any other course you take in the future because philosophy papers are so different and confusing. Basically, I learned very minimal material in this course. It did not achieve the goal of the Expository Writing program to make me a better writer. I regret taking a new course that had no Q ratings and no upperclassmen to tell me about it. All in all, the course teaches neither how to write nor will you come out of it with much being learned. I was quite frankly very disappointed that my most anticipated course at the beginning of the semester turned out to be my most upsetting one. Bottom line, if you love philosophy, and you know it, then take the course, if you want to try something new, you might want to think about it twice.","Take this class if the issues of the mind and brain fascinate you, or if you enjoy philosophy and tend to think in a philosophical way (i.e., analyzing everything, taking nothing for granted). The material is always fascinating and gives a good introduction to various areas of philosophy, including mental philosophy, ethics, and identity. The preceptor is very knowledgeable (if a bit scattered at times), and will let you know exactly what he expects of you in papers.\r\nIf you are traditionally a hard-science person who is fascinated by the brain\/mind, give this class a shot too. \r\nIf you don't really like the mind\/brain\/philosophy, definitely don't take this class; it's not for you. Obviously.","It is a philosophy course, which of course takes a certain kind of student to enjoy.","The reason I would recommend the course at all is that I think there is tremendous potential for this course. If I knew that the students would be going into the same course that I took this year, I would be very unlikely to recommend it at all.","This class requires effort, but I guarantee that the effort will be worthwhile. Eoin is an amazing preceptor, and if you put the effort, you WILL improve your writing.","Be ready to write a lot and not really understand the preceptor's comments.","This course does not focus on the scientific problem of the mind, but philosophical problems of the mind...","Make sure you are very interested in philosophy before taking this course.","Very intriguing class that teaches one a lot about philosophy of mind in a manner that makes one a better writer.","It  is a great course for a general introduction to a facet of philosophy. However, it may be painful if you do not enjoy philosophy."]},"Fall '12":{"comments":["Amazing-his class is very thought provoking.  If you have ever wondered what the \"mind\" is, TAKE THIS CLASS.  Time for the hour-long lecture flew by, I really looked forward to each class because Eoin is so brilliant.  He makes philosophy fun and accessible.","Eoin is a great teacher, and provides great feedback on your essays. If you pay attention to his comments and truly try to apply them to your writing, you'll definitely become a better writer. However, the philosophy expos classes are probably harder than the science ones in general, so I wouldn't recommend this class unless unless you're really interested in philosophy. But from what I've heard, it's probably the best among the philosophy expos sections.","If you are interested in the philosophy of the mind take it if not there are probably better expos classes.","This class is very interesting and brings up many fascinating, profound questions. However, I would not recommend it for inexperienced writers because philosophical writing is difficult generally and foreign to most students who primarily wrote essays about literature in high school.","Be sure to pay attention in class and do the readings even though you are not forced to discuss in class. The material will be very important in your three essays so a good understanding is key. Also, Eoin gives some of the best feedback on essays I have ever seen; he doesn't just check page numbers like some bad middle school teacher. He actually reads every single line. However, just note that if you are not interested in philosophy, this class is not for you.","You learn a lot of cool philosophy in this class. It's great for getting into philosophy. The readings are pretty interesting but dense. Lectures are informative and help explain the readings. Eoin is a boss.","Future students will learn a lot of philosophy. This is a good course for someone who is interested in philosophy and is not concerned with not focusing on the writing elements as much as other courses do.","Extremely difficult, make sure you have a definite interest in the field","Focus on structure and clarity in your papers."]}},"mostRecentQ":{"overall":"3.57","workload":"2.00","difficulty":"3.57","recommendation":"3.71","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.146","course_id":"1690","cat_num":"62224","1s":"0","2s":"3","3s":"4","4s":"3","5s":"4"},"QDifficulty":{"number":"EXPOS 20.146","course_id":"1690","cat_num":"62224","1s":"0","2s":"1","3s":"6","4s":"5","5s":"2"},"QWorkload":{"number":"EXPOS 20.146","course_id":"1690","cat_num":"62224","1s":"4","2s":"7","3s":"2","4s":"1","5s":"0"}},"success":true}