{"scores":{"Fall '12":{"course_score":{"overall":"3.57","workload":"2.36","difficulty":"3.14","recommendation":"3.64","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.147","course_id":"1691","cat_num":"10702","1s":"1","2s":"2","3s":"4","4s":"2","5s":"5"},"QDifficulty":{"number":"EXPOS 20.147","course_id":"1691","cat_num":"10702","1s":"0","2s":"3","3s":"7","4s":"3","5s":"1"},"QWorkload":{"number":"EXPOS 20.147","course_id":"1691","cat_num":"10702","1s":"2","2s":"8","3s":"2","4s":"1","5s":"1"}}},"Fall '11":{"course_score":{"overall":"3.50","workload":"2.00","difficulty":"3.06","recommendation":"3.69","enrollment":"16","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.147","course_id":"1691","cat_num":"10702","1s":"1","2s":"2","3s":"4","4s":"2","5s":"5"},"QDifficulty":{"number":"EXPOS 20.147","course_id":"1691","cat_num":"10702","1s":"0","2s":"3","3s":"7","4s":"3","5s":"1"},"QWorkload":{"number":"EXPOS 20.147","course_id":"1691","cat_num":"10702","1s":"2","2s":"8","3s":"2","4s":"1","5s":"1"}},"instructor_scores":[{"number":"EXPOS 20.147","cat_num":"10702","course_id":"1691","year":"2011","term":"1","id":"0524a50b5202218f335c65e02ae9ed13","first":"Eoin","last":"Ryan","InstructorOverall":"3.75","EffectiveLecturesorPresentations":"3.56","AccessibleOutsideClass":"4.31","GeneratesEnthusiasm":"4.12","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"4.29","ReturnsAssignmentsinTimelyFashion":"2.93"}]}},"comments":{"Fall '11":{"comments":["Know that not all Expos classes are created equal. Please read these evaluations and select your preferences carefully. This class was rather light on reading; however, the concepts it addressed were often very abstract and difficult to discuss. Take this course if you are interested in philosophy and want to know more about the process of philosophical writing. It is very different from the writing a typical college freshman is used to. This class also helped introduce me to aspects of research at Harvard (basically, braving the stacks of Widener). For me, the professor made the course, but I am not sure about possible preceptors in the future. Overall I would rate this class quite highly, particularly for an Expos class.","If you are curious about philosophy, take this course with reservation. If you are not interested then DO NOT TAKE. Smart prof, great conferences, but hard readings that you gain little from (at least Descartes).","Unless you are planning to concentrate in philosophy, I would not take this class.","It is a fantastic class if you are interested in philosophy. I however was not so had a hard time finding interest in the topics. However, Eoin is a great teacher.","This course is a really interesting approach to philosophy of mind. I thoroughly enjoyed the class discussions that we had. Eoin is (as far as I know) unmatched in his dedication to his students. There are many times where I'd write him a one- or two-line email and he'd respond with one or two pages of extensions to my ideas. If you want to learn, and I mean really learn, about philosophy of mind, this is the class for you. Just be prepared to be graded somewhat harsher than your peers in other expos classes.","If you're looking for an easy grade in expos, do not take this course.","The readings were fairly dense, especially if you weren't that interested in philosophy.  Synthesizing the information into an argument was difficult at times, but rewarding in the end.","This as about as good as it gets for Expos 20.  Eoin makes reading and writing about philosophy as enjoyable as one possibly can.","Eoin is a very funny, likable guy. but sometimes classes get boring when he gives powerpoints","If you have any interest in philosophy, this course would be excellent for you. There isn't too much workload involved, and the course material is fascinating. Make sure you keep up with the readings, though.","It was an interesting course, but it was graded very harshly.","If you're interested at all in learning philosophy, take this course! The material is difficult, but doable, and Eoin is awesome. He's a harsh grader, but Expos classes are traditionally harsh. And this is one of the best.","It is a good class to take, the instructor is helpful and your writing will improve by taking it."]},"Fall '12":{"comments":["I've heard a lot of people complain about how they hate their expos. It's almost guaranteed that you will not hate this course.\r\nIf you're considering philosophy as something you'd like to study more later in college, you'll know by the end of this course if that's really what you want.","You will learn what is a mind, do other people have minds... do you really know what the world is like from our perception? What is the future of minds and what do they have to say about ethics bioethics like Terri Schiavo case?","You better really enjoy philosophy","The material is very difficult to understand and the instruction is not particularly helpful.","Eoin is awesome awesome awesome. (Why are his scores so low?) But I do think that philosophy attracts certain people. Don't take this unless you know you like philosophy for sure.","This class is not a lot of work besides reading each week. The topics covered can be challenging to those that don't have serious interest in philosophy.","If you are the analytic type, this is definitely the class for you.","A great class; you will learn a lot about philosophy and the latest developments in cognitive science. However, be prepared to do some technical reading. An interest in the problems of philosophy is necessary.","Eoin is great. However, expos is generally an unpleasant experience, so only take this class if you're legitimately interested in the topic. I thought the topic was interesting and enjoyed most of the readings but kinda still disliked the course overall. Also, this seems to have a pretty light workload compared to other expos classes."]}},"mostRecentQ":{"overall":"3.57","workload":"2.36","difficulty":"3.14","recommendation":"3.64","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.147","course_id":"1691","cat_num":"10702","1s":"1","2s":"2","3s":"4","4s":"2","5s":"5"},"QDifficulty":{"number":"EXPOS 20.147","course_id":"1691","cat_num":"10702","1s":"0","2s":"3","3s":"7","4s":"3","5s":"1"},"QWorkload":{"number":"EXPOS 20.147","course_id":"1691","cat_num":"10702","1s":"2","2s":"8","3s":"2","4s":"1","5s":"1"}},"success":true}