{"scores":{"Spring '17":{"course_score":{"overall":"4.00","workload":"5.00","difficulty":null,"recommendation":"4.70","enrollment":"6","response rate":"50.00","QCourseOverall":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"0","2s":"2","3s":"3","4s":"2","5s":"1"},"QDifficulty":{"number":"CHEM 255","course_id":"512","cat_num":"79245","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"1","2s":"5","3s":"1","4s":"0","5s":"1"}}},"Spring '16":{"course_score":{"overall":"3.20","workload":"6.50","difficulty":null,"recommendation":"3.40","enrollment":"11","response rate":"72.73","QCourseOverall":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"0","2s":"2","3s":"3","4s":"2","5s":"1"},"QDifficulty":{"number":"CHEM 255","course_id":"512","cat_num":"79245","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"1","2s":"5","3s":"1","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHEM 255","cat_num":"107709","course_id":"512","year":"2015","term":"2","id":"0de7aea9d4a6eb214e2ba9b2e0b0136c","first":" Shao-Liang","last":"Zheng","InstructorOverall":"3.10","EffectiveLecturesorPresentations":"2.60","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"2.70","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '15":{"course_score":{"overall":"2.80","workload":"3.80","difficulty":null,"recommendation":"2.80","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"0","2s":"2","3s":"3","4s":"2","5s":"1"},"QDifficulty":{"number":"CHEM 255","course_id":"512","cat_num":"79245","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"1","2s":"5","3s":"1","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHEM 255","cat_num":"107709","course_id":"512","year":"2014","term":"2","id":"0de7aea9d4a6eb214e2ba9b2e0b0136c","first":" Shao-Liang","last":"Zheng","InstructorOverall":"3.00","EffectiveLecturesorPresentations":"2.40","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.20","ReturnsAssignmentsinTimelyFashion":"3.20"}]},"Spring '14":{"course_score":{"overall":"3.50","workload":"2.00","difficulty":"2.80","recommendation":"4.00","enrollment":"5","response rate":"80.00","QCourseOverall":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"0","2s":"2","3s":"3","4s":"2","5s":"1"},"QDifficulty":{"number":"CHEM 255","course_id":"512","cat_num":"79245","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"1","2s":"5","3s":"1","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHEM 255","cat_num":"79245","course_id":"512","year":"2013","term":"2","id":"0de7aea9d4a6eb214e2ba9b2e0b0136c","first":" Shao-Liang","last":"Zheng","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.30"}]},"Spring '13":{"course_score":{"overall":"4.30","workload":"1.60","difficulty":"2.60","recommendation":"4.60","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"0","2s":"2","3s":"3","4s":"2","5s":"1"},"QDifficulty":{"number":"CHEM 255","course_id":"512","cat_num":"79245","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"1","2s":"5","3s":"1","4s":"0","5s":"1"}}},"Spring '12":{"course_score":{"overall":"3.60","workload":"1.80","difficulty":"2.80","recommendation":"4.20","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"0","2s":"2","3s":"3","4s":"2","5s":"1"},"QDifficulty":{"number":"CHEM 255","course_id":"512","cat_num":"79245","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"1","2s":"5","3s":"1","4s":"0","5s":"1"}}}},"comments":{"Spring '12":{"comments":["The lab portion is very helpful.  However, if you plan to learn the background and why things are so in crystallography, you'll have to work on it and look for a lot of the sources yourself.","Great lecturer and TF. I learned a great deal","Chemistry 255 is an extremely useful class for those looking to use crystallography in their research, take it if you want to be able to collect data and resolve crystal structures on your own.  Because this is a practically-focused class, there is less emphasis on the theory of crystallography itself.","This course is really good for anyone thinking about running crystals during their stay in graduate school.  The first lectures are pretty confusing and you may feel lost constantly, but once you begin going through the practical applications and learn WHY you are learning the material, you realize how helpful the class really is.  Both Shao and Tamara are really great, caring teachers and I highly recommend this course."]},"Spring '13":{"comments":["This course is very easy, but successfully teaches practical crystallography.  While it can be boring and repetitive, the course is thorough in its practicality.","it is a very interesting coursed, with a significant emphasis on the practical aspects of crystallography","The course will help you understand the strengths and weaknesses of crystallography. Afterwards, you will have a much better judgment on the quality of structures in the academic literatures. It is very practical and the labs are fun!!","Only take this class if you actually have an interest in crystallography and you know why you want to learn to do it. If you are just taking the class because you think it might be easy, you will be bored out of your mind. If you are interested in learning to do crystallography, the class can be quite enjoyable.","Shao is a wonderful person to get to know in the Chem department. His class is really useful if you want to learn about what crystallographers do and why it's awesome. Also, you get to go on a field trip to the Advanced Photon Source in Chicago to see how synchrotrons (circular particle accelerators) are used to really take crystallography to the next level, and to better know Shao and your classmates. Office hours are easy: Shao's nearly always in his office in the basement of Bauer where the diffractometers are kept, and he's super friendly so feel free to ask him anything!","Definitely consider taking this class if you plan to use the X-ray diffraction lab. Shao knows so much about crystallography and does a good job at introducing and reviewing the relevant topics. Mike was also very helpful in the course. They both care a lot about helping you learn and are accessible outside of class in case you need clairification on anything. There is a reasonable workload. The guest lecturers were also really neat! Shao invites many specialists in the field to disucss their research and its a great way to see the utility of crystallograhy.","This course was overall a very positive experience. The workload was very manageable and the material was interesting and practical for any chemist interested in grad school (or already in grad school). Especially noteworthy was this class's trip to Chicago to visit the APS lab - that was an unparalleled experience and one which should definitely be taken advantage of."]},"Spring '14":{"comments":["If you plan on using small molecule crystallography, you should take this course. In particular, the lab section prepares you well for structure refinement.","Take this if you want to learn about x-ray crystallography of small molecules. It's a good class."]},"Spring '15":{"comments":["You can learn practical skills for crystallography, and the there is not much load for this course.","It is a helpful course and while it may not seem it at times, it really is helpful for your research and your knowledge of chemistry.  The assignments are not difficult and the second half of the course is better once you switch to more case studies and class presentations (which aren't graded) because it gets you more involved and thinking about the material.","You'll learn to refine crystal structures well. If that's your goal, take the course. If it's not, don't. Shao clearly cares about his students a lot."]},"Spring '16":{"comments":["The course is slightly painful\/annoying at times, but if you want to use crystallography, Chem 255 will teach you basically everything you need to know.","A must-take if interested in crystallography at all from any perspective","The concepts introduced in this class are very interesting, and it is very powerful to be able to unequivocally determine the structure of compounds. However, there are a lot of material that you need to cover on your own.","Immerse yourself into the blog posts and take the trip to APS- it was a blast!","Lab is extremely useful, but lectures are frequently indecipherable","I did ultimately learn a lot in this course and now feel much more comfortable with running and solving crystals, which was my ultimate goal by taking it. There are a multitude of different types of assignments that, in combination, do lead to better understanding of the material. However, it can be a bit challenging to follow everything during lecture time, so outside reading and thought is required. The lab component and other opportunities for hands on work were very helpful as well as filling in the gaps of my understanding."]},"Spring '17":{"comments":["It's a class that does exactly what it advertises, which is to give students practical knowledge for crystallography. Also, the field trip was very fun!","If you need to learn how to apply crystallography to your current or future research, this class is for you! You learn how to use the crystallography machines in order to obtain a structure of the molecule that makes up the crystal. Class is taught through real life examples and through hands-on learning, which worked really well for this type of class!","Take if and only if crystallography is relevant in your research program."]}},"mostRecentQ":{"overall":"4.00","workload":"5.00","difficulty":null,"recommendation":"4.70","enrollment":"6","response rate":"50.00","QCourseOverall":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"0","2s":"2","3s":"3","4s":"2","5s":"1"},"QDifficulty":{"number":"CHEM 255","course_id":"512","cat_num":"79245","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"CHEM 255","course_id":"512","cat_num":"107709","1s":"1","2s":"5","3s":"1","4s":"0","5s":"1"}},"success":true}