{"scores":{"Spring '15":{"course_score":{"overall":"4.90","workload":"3.00","difficulty":null,"recommendation":"4.90","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"8","3s":"0","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.50","workload":"3.80","difficulty":null,"recommendation":"4.50","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"8","3s":"0","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.20","workload":"2.00","difficulty":"3.30","recommendation":"4.20","enrollment":"9","response rate":"66.67","QCourseOverall":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"8","3s":"0","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"3.80","workload":"1.80","difficulty":"3.10","recommendation":"3.80","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"8","3s":"0","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"3.83","workload":"1.33","difficulty":"2.83","recommendation":"4.33","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"8","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '12":{"comments":["Seeing Time is a great way to explore your personal interests in perceptual neurobiology. The class allows (in terms of discussions and presentations) for some independence while addressing a really interesting topic. Patrick is really enthusiastic about the subject and clearly cares about his students' interests and questions. This is a nice, small setting to talk about very current methodologies and topics in systems neurobiology.","You end up reading a lot of interesting papers while taking this class that really make you think about how you perceive time in every day life. This is a fairly nascent field so there are still a lot of questions, but that's what makes it interesting! Patrick is a very chill guy, often brings snacks to class, and this is an excellent tutorial.","The tutorial is a really good chance to get some exposure to a really specific area of research; Patrick is really chill and the class is small which is great.","If the topic sounds interesting, take it! Patrick Mayo is great to learn from. He stresses critical thinking and creates an environment that encourages it."]},"Fall '13":{"comments":["material is somewhat interesting, problem sets are graded rigorously.  It is more time consuming than you may initially think.","Very in-depth look at how we perceive time in the brain. Tutorials in general are great for the smaller classroom setting which more readily facilitates discussion, but Patrick also makes the class interesting and slightly more irreverent than expected.","i love this class! patrick is so good at creating a very fun learning environment. i'm not really one to participate very often in other sections, but it comes naturally to me in this class. love the subject material too!","The course is fun, interesting, and laid back for the most part - however, that doesn't mean it's an easy A. Since the grading is pretty harsh, be sure to be diligent about homework, and not just rush through it in an hour or so."]},"Spring '14":{"comments":["Be prepared for discussions; although class is somewhat laid back, Patrick  expects a lot of you. Otherwise, have a good time and enjoy Patrick's jokes","It was a challenging course but Patrick is funny and class times are fun. Patrick is very accessible and replies to emails extremely quickly. Homework assignments make you think hard but Patrick is willing to help you as long as you put in the effort and critical thinking required. This class was a valuable experience for me that helped me think critically like a scientist.","Assigned papers and homework were often challenging, but overall a great experience!","Great TF, but assignments tend to be graded a bit strictly.  Be sure to participate in class!","Seriously the best class I have ever taken at Harvard! Made me totally 100% content with my decision to concentrate in Neurobiology which is something I was pretty wary about beforehand. I love the discussions every week and this is coming from someone who is generally pretty shy in small section-based classes. Patrick is one of the funniest and most interesting teachers I've had so far and he is REALLY good at creating an awesome and fairly laid-back learning environment.","Patrick is a great TF who genuinely cares about the class and is always willing to answer questions or  help you when you need it. As long as you put in the effort, you can learn a lot and do well in the class."]},"Fall '14":{"comments":["Its a good class that has  a minimal workload and laid back atmosphere. Just make sure you read and participate in discussions every week.","If you want to take an interesting neuroscience course, or need to take a neuroscience tutorial, think strongly about taking this course!! P. Mayo is very dedicated to the course, and the material is very interesting -- how does the brain encode time?","A really interesting and unique topic in neuroscience. Really makes me think about how I think about time in general and how it is encoded in my brain, as well as how much more there is to be discovered about time in the brain.","Highly engaging class, personal attention, enjoyable class discussions","I could not recommend this class more strongly! Patrick is awesome and the material is really interesting.","This tutorial demands a little more time and effort than other neuro tutorials (weekly questions aren't easy), and the grading is certainly tougher. However, the subject matter is interesting and Patrick is great guy. This has been my favorite class and I'd highly recommend it."]},"Spring '15":{"comments":["This class is a low workload, low stress class. One article to read and 4 questions on it per week.","its dope","One of the best classes I've taken at Harvard! This is everything a seminar should be. The discussions are very laid back so if you want more organization this might not be the best choice for you. Patrick is awesome and really funny.","This class is unique in that it pushes you to learn and think about the papers while not being overwhelming. Discussions are great and facilitate a deeper understanding of the paper.","I would take this course if you are interested in the topic of how the brain encodes for time. This course will probably end up having very high q scores. People should probably know that this course was amazing in large part because of the teacher. The topic is an interesting one, but so are many topics in neuroscience. I hope whoever teaches this in the future can put as much thought and time into it as P. Mayo.","This class is challenging conceptually yet very enjoyable. Patrick's teaching is phenomenal."]}},"mostRecentQ":{"overall":"4.90","workload":"3.00","difficulty":null,"recommendation":"4.90","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hff","course_id":"3917","cat_num":"72995","1s":"0","2s":"8","3s":"0","4s":"0","5s":"0"}},"success":true}