{"scores":{"Spring '13":{"course_score":{"overall":"4.23","workload":"2.08","difficulty":"2.77","recommendation":"4.38","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"HIST 79j","course_id":"2348","cat_num":"98463","1s":"0","2s":"0","3s":"2","4s":"6","5s":"5"},"QDifficulty":{"number":"HIST 79j","course_id":"2348","cat_num":"98463","1s":"0","2s":"4","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 79j","course_id":"2348","cat_num":"98463","1s":"2","2s":"9","3s":"1","4s":"1","5s":"0"}}}},"comments":{"Spring '13":{"comments":["Really great course - a decent chunk of reading, but it's all really interesting stuff!","This class was AWESOME! You hear about prostitution for your whole life, and you hear so many opinions about it. This class lets you examine sex work from a different point of view, and helps you understand all the different opinions that surround the subject. Philippa is also the best!","Solid class with interesting topic","Philippa is an outstanding educator and I would take any course that she taught. In addition to her, the course material was extremely interesting and very relevant to everyday life.","If you have an interest in the history of prostitution, take this class!!  The readings are very interesting and the assignments aren't too difficult.  There is a lot to read and absorb each week, but you'll want to do the work.","Great course with an amazing instructor","Solid course to fulfill your history reading seminar requirement. Not a tremendous amount of reading each week, assignments are manageable and the actual class has a pretty relaxed, open atmosphere. To really get the most out of this class though, I'd recommend actually being interested in the subject matter otherwise it's more of a drag to get through.","Decent seminar, very dependent on who else is in it for the quality of discussion, but it will complicate your view of the topic in a productive way.","There will be weeks that are more interesting than others, but overall a manageable and intriguing reading seminar."]}},"mostRecentQ":{"overall":"4.23","workload":"2.08","difficulty":"2.77","recommendation":"4.38","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"HIST 79j","course_id":"2348","cat_num":"98463","1s":"0","2s":"0","3s":"2","4s":"6","5s":"5"},"QDifficulty":{"number":"HIST 79j","course_id":"2348","cat_num":"98463","1s":"0","2s":"4","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 79j","course_id":"2348","cat_num":"98463","1s":"2","2s":"9","3s":"1","4s":"1","5s":"0"}},"success":true}