{"scores":{"Fall '12":{"course_score":{"overall":"4.46","workload":"2.77","difficulty":"2.92","recommendation":"4.23","enrollment":"18","response rate":"77.78","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Fall '12":{"comments":["This is a complicated class and will probably be taught very differently if it's offered again, so it's hard to offer advice. Be prepared to stretch artistically and personally (you might not be expecting the latter). Try to find out from day 1 what the semester will look like and what's required of you, so you can decide if this is really the class for you (it might not be, even if you adore hip hop and\/or spoken word.) (The content on the syllabus is not particularly accurate, but the assignments are - pay close attention to final assignments esp. putting on a play if that's still required, rehearsal time outside of class, etc.) Say yes a lot, because the more often you say yes in this class, the more you'll get out of it. But sometimes you won't want to say yes, you'll want to say NO very definitively, and that's okay too. Even if someone tries to make you think it's not. Expand your limits but know your boundaries.","It's exciting. I don't think there is a class like it at Harvard. Be prepared for a crazy time.","Read the syllabus carefully, there is quite a time committment- BUT could be really fun if you know ahead of time and plan accordingly.","This is a wonderful way of entering into the spoken word community at Harvard, and learning about the foundations of hip-hop (a lesson that I had always wanted to learn but had no access to!) Also a beautiful team building exercise!","The class changed me as a person, please take this class and dive into it completely, the more you put in the more you will learn not only as a student, but as a human being.","it's an amazing class. if you have the chance to explore different classes at harvard, add this to the list.","Yes! I can finally say it: This was the best course I have ever taken at Harvard. This class was unbelievable. I learned so much and had the incredible opportunity to become friends with my 20 other talented and diverse classmates. We thought deeply about issues of injustice in our country, and engaged creatively with some of the most empowering, moving artistic movements of our nation. This was an amazingly beautiful, uniting experience that has given me so much knowledge and love.","If this class is ever offered again at Harvard, just know that it is truly what you make it. It has a lot of text to offer that will deeply engage you, not only in history, but in yourself. However, if he chooses to do the play again, be ready to sacrifice A LOT of time.","I think with some changes this course could have been even better. There were a lot of ups and downs with the class regarding the long term final project, but I think once that is sorted out, the class would be even better."]}},"mostRecentQ":{"overall":"4.46","workload":"2.77","difficulty":"2.92","recommendation":"4.23","enrollment":"18","response rate":"77.78","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}