{"scores":{"Fall '12":{"course_score":{"overall":"4.33","workload":"2.50","difficulty":"3.17","recommendation":"4.33","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"HIST 78e","course_id":"2344","cat_num":"70163","1s":"0","2s":"0","3s":"1","4s":"2","5s":"3"},"QDifficulty":{"number":"HIST 78e","course_id":"2344","cat_num":"70163","1s":"0","2s":"1","3s":"3","4s":"2","5s":"0"},"QWorkload":{"number":"HIST 78e","course_id":"2344","cat_num":"70163","1s":"0","2s":"3","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Fall '12":{"comments":["If you are an Undergrad interested in the Middle-East and in an unusual approach to interesting material - this course is excellent, and Arbella is a talented teacher. The use of maps and multimedia - especially in the context of contemporary issues (and the Arab Spring) - makes this really fun, dynamic, and relevant.","This course was honestly one of the best that I have ever taken at Harvard, no exaggeration. This course does the two things that every course should do: teach students substantive knowledge about a subject and teach students to think in a more analytical way. This course successfully does both, and it is because the course content is so well-designed and Arbella is simply an amazing instructor. The course provides a very comprehensive overview of the histories and issues surrounding many cities in the Middle East, and the thematic component of the course ties the material together in a very intellectually cohesive manner. The specific histories we discussed were always relevant, and the thematic frameworks of this class provided fascinating context that really enriched the material. Arbella is what every professor should be. The comments she provides on assignments are very thoughtful and really challenge one to think more critically about the material. The valuable feedback that she provides really forces you to not be complacent and instead to always strive for new ways to improve one's historiographical and analytical skills. I could see a noticeable improvement in my thinking as the semester developed as a result of the constructive feedback that Arbella provided on every assignment. Each class discussion was enjoyable and intellectually stimulating. Arbella does a fantastic job of asking questions, explaining content, and tying the discussion together in a thematically unified manner. I always left the classroom with new knowledge and new perspectives that I did not have coming in, which is the hallmark of any great class. My intellectual horizons were really broadened as a result of this class, as I have gained new knowledge about a field of history that is fascinating and I have begun to think about history in a more critical and analytical way. History seminars are awesome in the first place, and this one is really the cream of the crop."]}},"mostRecentQ":{"overall":"4.33","workload":"2.50","difficulty":"3.17","recommendation":"4.33","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"HIST 78e","course_id":"2344","cat_num":"70163","1s":"0","2s":"0","3s":"1","4s":"2","5s":"3"},"QDifficulty":{"number":"HIST 78e","course_id":"2344","cat_num":"70163","1s":"0","2s":"1","3s":"3","4s":"2","5s":"0"},"QWorkload":{"number":"HIST 78e","course_id":"2344","cat_num":"70163","1s":"0","2s":"3","3s":"3","4s":"0","5s":"0"}},"success":true}