{"scores":{"Fall '12":{"course_score":{"overall":"3.64","workload":"1.94","difficulty":"2.78","recommendation":"3.72","enrollment":"62","response rate":"90.32","QCourseOverall":{"number":"SOCIOL 142","course_id":"4658","cat_num":"89889","1s":"0","2s":"9","3s":"11","4s":"26","5s":"9"},"QDifficulty":{"number":"SOCIOL 142","course_id":"4658","cat_num":"89889","1s":"1","2s":"14","3s":"35","4s":"4","5s":"0"},"QWorkload":{"number":"SOCIOL 142","course_id":"4658","cat_num":"89889","1s":"12","2s":"33","3s":"9","4s":"0","5s":"0"}}}},"comments":{"Fall '12":{"comments":["This is a great course to take to learn about how cities operate, what policy prescriptions are available to solve problems cities face, and how to think about various stakeholders in cities. If you're interested in urban issues, local or national politics, and decreasing structural inequalities around the country, this class is for you. Just be prepared for a significant amount of work throughout the class if you hope to get as much as possible from the class.","Its a tough course, be ready.","fascinating topic, and while the course was a little disorganized this year will most likely get a lot better in coming years since this was the first time it was offered.","Take this course if you are interested in urban studies. For the sake of the rest of the class please, pelase carefully read the articles\/case studies.","This class is great for a heavy workload.  You learn a lot of practical information that you can talk about outside of class without much stress.  Lectures are discussion-based which is nice because Luberoff is a great discussion facilitator.  I took this class after taking Luberoff's Reinventing Boston class and loved both classes.","do the readings","Definitely have a strong interest in the class because otherwise it is difficult to participate if you know very little about urban problems or local government","This was my favorite class this semester - Luberoff is a brilliant discussion leader, and he's passionate about these issues. He really makes you believe over the course of the semester in the ability for individuals to influence and address urban problems. You engage with topics ranging from intercity poverty, public housing, urban planning, education, public transportation, and city parks, and you finish the semester doing a research project about an urban problem that you're passionate about. I feel like the class was an extremely comprehensive overview of urban politics, The discussion-based format of the class attempted but sometimes failed to be inclusive. I think the workload for this class is extremely managable, but very rewarding. It's very easy to skip out on the readings, but don't - honestly, some of the most insightful things I've ever read were assignments in this class. It's nice that you can skip readings when you're overwhelmed with other work, but you're really just selling yourself short if you never do the readings.","Luberoff is a good professor (approachable and knowledgeable) and the topics of this class are relatively interesting. \r\n\r\nHowever, understand that the class is NOT well-organized and is largely based on urban planning theory. The assignments and expectations are rather ambiguous at times. Furthermore, the \"lectures\" are largely discussion based which makes them hard to follow at times if you do not have a developed knowledge or opinion of the topic. I would recommend this course with reservations if you are interested in Sociology or urban issues.","The topic matter for this course is interesting. Urban planning and local governance are interesting. However, the structure of the class is not great and rather frustrating at time. Lecture is a discussion with 60 people -- it is opinion based instead of focused on the readings. Section is a repeat of lecture with less guidance. Some of the readings are amazing and some are really boring. Weekly discussion questions and newspaper submissions are a pain, but the final paper and midterm essay are really fair and pull everything together for you -- so that's fun. Basically the class is full of highs and lows.","Overall, the course was just uninspiring and a disappointment. Don't waste an elective on it, really, you will be massively disappointed. Yes, it is not too demanding (the work-load is reasonable and the assignments are fair) but this really shouldn't be the basis for taking a course at Harvard. If you're really interested in urban planning and know you are (or really know that you would be) then this is a good choice. Prof Luberoff is very approachable as are the TFs - it is a supportive course too. But if you want something to inspire, I don't think this is for you at all.","Not a bad class, not the greatest thing you'll take. The readings are good though--the theory's a bit dull, but a good primer for other classes and research.","Readings are interesting, lecture is superficial, section is good, Luberoff is very intelligent on the subject but leaves too much to poorly informed and opinionated students.","You will learn so much from this course. It is so eye-opening and really engages you in relevant and current urban issues. The things we were learning in lecture were playing out in newspapers each week. One of my favorite classes. Take it if you are at all interested in Urban politics, you will learn soooo much!","I would not take this class again","This course provides a really interesting introduction to a lot of the issues facing cities around the country, and the reading list is really thought-provoking!","The topics in the class are all very interesting and relevant to the real world. However, this class is so poorly structured. My guess is they will figure out the kinks in the next year or two and once they do it will be much more popular. In the mean time, be cautious.","Take this class if you are already really interested in urban issues and have a base of knowledge and topics that you are passionate about. While the class does cover a wide range of urban problems, it is difficult to enjoy the course if you aren't already opinionated about some issues and willing to share those with the class. While class discussion was nice in principle, it often just devolved into people sharing their opinions or personal experiences without much grounding in the course material. The lectures also were not very helpful in elaborating upon the readings (so if you didn't do the readings beforehand lectures were pretty useless). Also be willing to accept a high degree of uncertainty with regards to assignments and grades - the memo format is unconventional in college settings (which is fine, though more guidance on memo writing would have been helpful), and there aren't many specific guidelines for the final project.","This is a good course that's just getting started. There are elements that will be improved so it can only get better. It's a good course to take if you are interested in a discussion-based course rather than lectures. Students who come in expecting very organized lectures may be frustrated because that is not the style that the professor wishes to pursue. Rather, expect discussions. At times the discussions can get abstract or go in circles, but this is the norm in many courses at Harvard","It is very interesting","Fascinating class! If you are at al interested in any urban issues (power politics, education, housing, the list goes on and on), take it. Great professor, great TFs, mostly very interesting readings (several fascinating cases from HBS and HKS), and unbelievable level of class discussion (both in lectures and sections). Which means if you don't want to do any work, you probably won't like it, because the standard of participation and engagement is not low. But if you are actually interested in this subject matter, you'll love it. Seriously, all around it is an amazing class!","\"Urban Problems and Politics\" is a fantastic course that will shape how you think about cities, American politics, and methods\/reasons to intervene against problems like concentrated poverty. The class is HEAVILY discussion-based, so be sure to do the readings each week and submit questions! But in those readings and discussions, one definitely learns a lot about other perspectives, particularly if the class is as diverse as ours was.","This course provides lots of information about urban policy. If you take initiative, I think it would be wonderful. If this ends up being a class you coast in because other courses are more pressing, then you miss a lot of what this class has to offer. What you get out of the course is directly proportional to the amount you are invested in it because it is so participation intensive.","Make sure to read everything-- that's how you can get everything out of the class.","Great class to see how city planning has played an influential role in America and the issues that arise in cities accordingly","Great lecturer and really important subjects, especially if you ever want to live in a city. Be prepared to do a fair amount of reading though.","BE sure you know what you're getting into. I thought this class was something different and realized that it wasn't way too late in the semester, making some of the lectures\/assignments painful.","this class will encourage you to ask questions while you read, and you should do so. You will submit discussion questions each week and may be called upon. THis is great, but gets a bit repetitive as time goes on. You will have a final project where you explore an urban topic of your choice. Come in with an idea and have the TFs help you from the beginning. Learn how to write policy memos off the bat. The sociology department and kennedy school has links to such. This class won't give you hands on instruction for such. However, you will be called to write 2 policy memos. Be prepared.","If you are willing to do the readings and be one of the people leading the discussion in class, it can be a rewarding experience. However, if you are unlikely to play an active role in class discussions and would rather learn from the teacher lecturing, this may not be the best class for you.","I took this class because the lecture on the first day was really interesting. Luberoff has a lot of practical experience with these issues, and I was interested in learning from him. However, he quickly stopped lecturing a few weeks into the class, and the lectures were just pointless discussions.","it was fun! the topics, readings, and discussions were interesting. Luberoff is great; he's not as academic as other professors I've had, which made it seem a little more \"real-world\". someone with a lot of prior experience studying urban issues might find it redundant, but I liked it a lot.","It's time Harvard offered an urban sociology class! The class's popularity showed that it's a really significant area in which students want to know more, and I really hope the class continues to develop and thrive and that the sociology department further develops urban sociology as a key area. Prof. Luberoff is SO incredibly knowledgeable - he easily makes connections among urban problems and cities to make information understandable and relevant and is so helpful to speak with about municipal issues. The class is new so I hope it continues to try new methods\/components because I loved the different issues we considered, but there's definitely room to expand. If you are a sociology concentrator interested in learning urban theories and\/or considering a career related to local issues and\/or political governance, you should definitely consider this class because you'll really benefit and consider relevant issues you probably hadn't considered before, and the sociological theories are relevant but not overwhelming.","If interested in cities take it","This is the most relevant course I've taken at Harvard. I loved it! Luberoff is great, and the discussions are fantastic. This course makes me want to switch to sociology!"]}},"mostRecentQ":{"overall":"3.64","workload":"1.94","difficulty":"2.78","recommendation":"3.72","enrollment":"62","response rate":"90.32","QCourseOverall":{"number":"SOCIOL 142","course_id":"4658","cat_num":"89889","1s":"0","2s":"9","3s":"11","4s":"26","5s":"9"},"QDifficulty":{"number":"SOCIOL 142","course_id":"4658","cat_num":"89889","1s":"1","2s":"14","3s":"35","4s":"4","5s":"0"},"QWorkload":{"number":"SOCIOL 142","course_id":"4658","cat_num":"89889","1s":"12","2s":"33","3s":"9","4s":"0","5s":"0"}},"success":true}