{"scores":{"Spring '15":{"course_score":{"overall":"3.10","workload":"3.70","difficulty":null,"recommendation":"3.00","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"3","2s":"4","3s":"6","4s":"9","5s":"4"},"QDifficulty":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"1","2s":"2","3s":"18","4s":"3","5s":"2"},"QWorkload":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"3","2s":"14","3s":"7","4s":"2","5s":"0"}}},"Spring '14":{"course_score":{"overall":"3.30","workload":"2.30","difficulty":"3.10","recommendation":"3.40","enrollment":"37","response rate":"70.27","QCourseOverall":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"3","2s":"4","3s":"6","4s":"9","5s":"4"},"QDifficulty":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"1","2s":"2","3s":"18","4s":"3","5s":"2"},"QWorkload":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"3","2s":"14","3s":"7","4s":"2","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.42","workload":"1.92","difficulty":"2.75","recommendation":"4.67","enrollment":"24","response rate":"100.00","QCourseOverall":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"3","2s":"4","3s":"6","4s":"9","5s":"4"},"QDifficulty":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"1","2s":"2","3s":"18","4s":"3","5s":"2"},"QWorkload":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"3","2s":"14","3s":"7","4s":"2","5s":"0"}}}},"comments":{"Spring '14":{"comments":["Beware of grading in this class. Our year the course staff was not very transparent at all about how grading was done\/how assignments were judged and it resulted in a lot of confusion and distress. This was especially true because the professors had a very unconventional way of grading. For example, on many assignments the mean grade was a 75% and many people got 50%s while others got 100%s.  I also still have no idea if I will earn a B or an A in this class because the meaning of these grades was never discussed and we were just told \"not to worry about it.\" Unfortunately, I'm not sure the professors understand that we are students first and philanthropists second so our grades ARE important to us and related concerns should not just be dismissed. The professors seem to think we are just complaining about getting poor grades, but what they don't understand is that we're really complaining about the arbitrariness. I really just wish they would use a rubric or discuss this more. That being said, this can be a very valuable real world experience if you anticipate not caring as much about your grades.","This class is extremely vague and unhelpful. While the first class was interesting because it was a case study, do not be deceived--the rest of the class, we spent talking about feelings and things like \"what made a good philanthropist.' A: kind and generous. We had no idea on what criteria we were being graded and were not told until the very end of the semester that we were being graded against each other. This was a horribly structured class and class discussions were extremely unhelpful. pass on this class.","The class is interesting and can get some cool speakers. Discussions end up being the same couple people who have thought a lot about philanthropy and have \"experience\" in the field talking the whole time. Assignments were confusing, especially grading. But it was a cool way to investigate a problem area in Boston, a community we live in, and hear about the ways that people are trying to resolve them. It was a great senior spring class because it was very little work and finished early.","Do not take this class. It is poorly organized, the professors have no idea what they're actually teaching, it does not teach you anything about non-profits, the team component is NOT a draw, it is extremely difficult to work with a team the class does not guide you in any way.","While there were certain logistical components of this course that I didn't really like (the grading of papers, the way the participation grade is calculated), the overall concept for the course is really amazing.  Being able to research non-profits in Boston in a really in-depth way and then actually have several thousand dollars to donate was a really cool and rewarding experience, and is something you literally won't find in any other class at Harvard.  If you have any interest in philanthropy or non-profits, or if you enjoy classes with opportunities for real-world impact and applications, I would highly recommend this course.","Very time consuming but very worth while.","The best part about this class is that they give you money to donate to a worthy cause (and yes, you know it's a worthy cause because you've researched and analyzed it for several weeks). The classes themselves are dry. People weren't paying attention and only a select few were answering questions. There was never any heated debate, even though the class should really be all about that. It was just people who liked to hear the sound of their own voices.","WOW. If you're thinking about  getting involved in philanthropy in terms of giving or career, you should take this class. There is rigorous , thoughtful and thorough exposure to the nonprofit sector. The experience of giving a grant is unparalleled. The professors are very knowledgeable and invested in the course. What a privilege. I'm so glad I found this gem before I graduated.","This class sounds interesting in theory, but did not live up to my expectations. Although I enjoyed working in groups and becoming familiar with the non-profit landscape, the class was a lot more work than I expected it to be. The best part of the class is talking to potential non-profit grantees and learning about the work they do. Lecture itself is not super engaging, although there are guest speakers from the non-profit sector from time to time who are interesting.","Be prepared to put in a lot of out of class time to visiting sites, speaking to nonprofits, and experts.","If you have come to the point in your college career where you don't want to just talk about issues, you want to actively do something about them, then this is the course for you! You will get the chance to visit many non-profits in Boston, see what is being done and how, get a deep sense of some of the underlying issues in our community that are not being resolved by the public\/private sector, and ultimately get to choose where to donate a small amount of money to actually help make a difference! In addition, readings\/lectures will give you a good framework for thinking about the non-profit world, something that is really valuable if you plan on entering it one day! That being said, if you are someone who is averse to teamwork and needs a lot of structure and guidance on assignments and coursework then this probably won't be the best experience for you.","Great way to learn about how philanthropy works -- but only if you're ok with the fact that sometimes you have little guidance. You'll find that philanthropy is messy work, but you'll also learn a ton about philanthropy.","This class could be awesome with some serious improvements. Unclear expectations, sometimes arbitrary grading. Your experience really depends on your group, which can be good or bad.","Needs more structure but it's very practical and eye opening particularly if you have an interest in the sector.","This is a very unique, practical class, and the opportunity to actually make a donation of several thousand dollars to a worthwhile NGO is really exciting. Working in a group was very challenging, but again, probably a skill set that is useful as a life skill. And in general, I thought it was interesting to learn about Boston and the Non-profit sector in an academic setting! \r\n\r\nAs someone writing a thesis, it was hard to remain up to date on readings and discussions for the first half of class, because the big class size and the fact that the same people tend to speak up first made it harder than usual to jump in and add to the conversation."]},"Spring '15":{"comments":["This is a great class for people who are interested in careers in nonprofits. Otherwise, it's a lot of work (but a great learning experience) for a topic you might not be passionate about.","great class to learn more about philanthropy, but definitely frustrating if you care about your grades, because assignments were sometimes graded somewhat arbitrarily"]}},"mostRecentQ":{"overall":"3.10","workload":"3.70","difficulty":null,"recommendation":"3.00","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"3","2s":"4","3s":"6","4s":"9","5s":"4"},"QDifficulty":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"1","2s":"2","3s":"18","4s":"3","5s":"2"},"QWorkload":{"number":"SOCIOL 152","course_id":"4665","cat_num":"96881","1s":"3","2s":"14","3s":"7","4s":"2","5s":"0"}},"success":true}