{"scores":{"Fall '12":{"course_score":{"overall":"4.38","workload":"1.92","difficulty":"2.85","recommendation":"4.23","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"HIST 1888","course_id":"2453","cat_num":"18641","1s":"0","2s":"0","3s":"1","4s":"6","5s":"6"},"QDifficulty":{"number":"HIST 1888","course_id":"2453","cat_num":"18641","1s":"0","2s":"2","3s":"11","4s":"0","5s":"0"},"QWorkload":{"number":"HIST 1888","course_id":"2453","cat_num":"18641","1s":"2","2s":"10","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Fall '12":{"comments":["I would recommend this course more highly if it was offered as an upper division elective rather than an intro class to Middle Eastern history.","You can learn A LOT in this course. You can also feel really lost. If you're looking to be able to point out right from wrong in the news or know more than the \"experts\" on CNN, this is for you. If you're looking for and perfect understanding of every lecture, maybe not so much.","Spectacular. Very enjoyable. Take the class.","If you have any interest in the area, this is a great class.","If you're interested in the subject matter, this is a great course.","A solid introduction to the modern Persian Gulf from an energetic and knowledgeable teaching staff.","I did not know much about the Persian Gulf and really enjoyed learning about the region. Arbella and Elise are very knowledgeable and approachable.","Take this course if you are at all interested in better understanding the recent history of, including current events in, the Middle East, and especially the Gulf region. Arbella is an incredible lecturer, extremely organized, and really innovative in her use of materials for the course.","I had never taken a comprehensive course on the Persian Gulf. This class was great!","It's a good into to the history of the persian gulf (iran, iraq, kuwait, oman, uae, bahrain, qatar) and politics of the middle east. Lectures and section were a little boring, but overall if you are interested in the history of oil and the way the West (read US) has interacted with the Persian Gulf, this class is interesting. Not very fun, but at least it's not hard.","This is a solid introduction to the Persian Gulf, and it's useful if you're not familiar with the regional politics. The readings are usually interesting and of a reasonable amount, although I never found myself all that excited about doing them. The teaching staff is inexperienced but both dedicated and able, and there's a good chance this course will only get better with time."]}},"mostRecentQ":{"overall":"4.38","workload":"1.92","difficulty":"2.85","recommendation":"4.23","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"HIST 1888","course_id":"2453","cat_num":"18641","1s":"0","2s":"0","3s":"1","4s":"6","5s":"6"},"QDifficulty":{"number":"HIST 1888","course_id":"2453","cat_num":"18641","1s":"0","2s":"2","3s":"11","4s":"0","5s":"0"},"QWorkload":{"number":"HIST 1888","course_id":"2453","cat_num":"18641","1s":"2","2s":"10","3s":"1","4s":"0","5s":"0"}},"success":true}