{"scores":{"Fall '12":{"course_score":{"overall":"3.20","workload":"2.60","difficulty":"2.80","recommendation":"2.80","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"APCOMP 263","course_id":"1107","cat_num":"83688","1s":"0","2s":"1","3s":"2","4s":"2","5s":"0"},"QDifficulty":{"number":"APCOMP 263","course_id":"1107","cat_num":"83688","1s":"1","2s":"0","3s":"3","4s":"1","5s":"0"},"QWorkload":{"number":"APCOMP 263","course_id":"1107","cat_num":"83688","1s":"1","2s":"1","3s":"2","4s":"1","5s":"0"}}}},"comments":{"Fall '12":{"comments":["This course was pretty disorganized. The assignments were often interesting, and I left with tangible skills\/\"facts\" that I learned in the course. Feedback was sporadic and often very late, so I had no idea where I stood throughout the semester. Deadlines were often missed\/pushed back, so the course schedule was not very reliable, and assignments would be added or removed right before their due dates.","If you're interested in learning about networking, data, and computing, definitely at least shop to see what this is all about. Encourage other people to take this course with you! The course will be better with more people, and you can work on the final project with friends.","I had really high hopes for this class, but I was sadly disappointed. Looking at the syllabus during shopping week, it looked like we'd cover some really cool and applicable topics. However, very little material actually ended up being covered (i.e., half of the original schedule), which was pretty disappointing. Way too much time was spend on material that should have been assumed for a graduate-level computing course. The assignments for this course were also subpar. All were extremely underspecified, and it was never clear exactly how much work we were expected to put in on a weekly basis (and sometimes, even what we were supposed to do). Feedback on these assignments was virtually non-existent, and what feedback was given came weeks (or months) after the original due date, which made it impossible to actually apply comments to future work. I understand that with a brand new course comes a few bumps in the road, but this class was a disappointment in too many areas.","It provides a lot of hands on time coding and building a system that can handle big data. The instructor is one of the best I've had at Harvard, he gets invested in your project and helps you succeed.","The course isn't in-depth enough to justify spending the time on all the papers just to get to do the few programming assignments although I have no doubt it will be much better next year since this was the first time it was offerred"]}},"mostRecentQ":{"overall":"3.20","workload":"2.60","difficulty":"2.80","recommendation":"2.80","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"APCOMP 263","course_id":"1107","cat_num":"83688","1s":"0","2s":"1","3s":"2","4s":"2","5s":"0"},"QDifficulty":{"number":"APCOMP 263","course_id":"1107","cat_num":"83688","1s":"1","2s":"0","3s":"3","4s":"1","5s":"0"},"QWorkload":{"number":"APCOMP 263","course_id":"1107","cat_num":"83688","1s":"1","2s":"1","3s":"2","4s":"1","5s":"0"}},"success":true}