{"scores":{"Fall '13":{"course_score":{"overall":"4.40","workload":"2.20","difficulty":"3.50","recommendation":"4.30","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.186","course_id":"1718","cat_num":"15057","1s":"0","2s":"0","3s":"2","4s":"5","5s":"8"},"QDifficulty":{"number":"EXPOS 20.186","course_id":"1718","cat_num":"15057","1s":"0","2s":"1","3s":"6","4s":"7","5s":"1"},"QWorkload":{"number":"EXPOS 20.186","course_id":"1718","cat_num":"15057","1s":"3","2s":"7","3s":"4","4s":"1","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.08","workload":"2.00","difficulty":"3.54","recommendation":"3.77","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.186","course_id":"1718","cat_num":"15057","1s":"0","2s":"0","3s":"2","4s":"5","5s":"8"},"QDifficulty":{"number":"EXPOS 20.186","course_id":"1718","cat_num":"15057","1s":"0","2s":"1","3s":"6","4s":"7","5s":"1"},"QWorkload":{"number":"EXPOS 20.186","course_id":"1718","cat_num":"15057","1s":"3","2s":"7","3s":"4","4s":"1","5s":"0"}}}},"comments":{"Fall '12":{"comments":["The material is tough to understand at times, so you must stay on top the readings.  If you do this, the course runs more smoothly.","Pay close attention to all the rules of writing and do not forget to incorporate them when you are writing your own paper, especially if you are not used to incorporating them already.","The subject material is very interesting and engaging, but also difficult to comprehend at times. Thus, unsurprisingly, writing a coherent argument about these ideas can also be difficult.","Michael Allen is a great preceptor who is really enthusiastic about the material. If you have an interest in Indian religions or philosophy, this class can be really interesting.","Professor Allen is nice and very helpful. If you find yourself struggling with a paper, a reading, or even are just getting bored with the subject, talk to him, it will help a lot. Overall this expos class is pretty interesting and not that hard.","If you are interested in Indian philosophy including Hinduism and Buddhism this is a good choice.  Most freshmen complain all day about their expos but this was an interesting course.  Michael is a great teacher and works with you individually to improve your writing.","That while the course was interesting, it was not easy, it requires a lot of effort and daily work. Also, you must be at least slightly interested in Buddhism\/Hinduism or you will be bored.","Buddhism and Hinduism are tricky subjects that contain concepts extremely outside of the sphere of conventional Western thought. Come in with an open mind and prepare to see the world in different ways.","Take this expos class!","Michael makes himself very available to you, take him up on that. The topics are difficult and if you have no familiarity with the religions it is difficult to write a successful paper. He wants to help so ask lots of questions."]},"Fall '13":{"comments":["the content was good and I improved the structure of my essays.","I would tell them that this class is very interesting. Nonetheless, writing about philosophy and religion can be very difficult. If you are interested in that field of study, this class can be extremely rewarding.","This is a fun and interesting class that will make you think not just about how to write an essay, but about what it means to be a person.","Make sure that you are interested in the topic before taking this course, otherwise it can become a bit draining to do all the readings. All in all though, Dr. Allen is a great preceptor and you will learn a great deal from him.","I think that this is definitely one of the more difficult expos classes because the course material is very abstract. However, the teacher is very qualified, and I think that the process of taking the class was very rewarding.","You have to take Expos, so take this section! Indian philosophy seems random, but the course pushes you intellectually, asking questions about what constitutes a self and if a self exists.","Dr. Allen is an incredible preceptor with an admirable passion and understanding of the subject matter. The class is thoroughly taught with great attention to detail, but Dr. Allen remains understanding in regards to course load and other commitments. Dr. Allen is consistently available for help and approachable.","Know what you're getting yourself into! This is Expos, so there will be a good deal of writing and thinking \"academically\" and critically. Just be aware that this is a religious philosophy course; the writing and readings can seem dry at times.","If you're interested in Indian philosophy (Hinduism, Buddhism), questions about the \"self\" and the nature of reality, this course is definitely worth your while.  The readings are usually pretty thick (in both quality and quantity) so as long as it interests you it's not a big deal. I'm generally not that enthusiastic about writing but this course was my favorite this semester. Take it.","This was a phenomenal class in terms of how interesting the subject material was, how much I feel I grew as a writer, and Dr. Allen's abilities as a preceptor. I have grown enormously not only in my academic writing ability, but in my understanding of myself on a philosophical level. A word of caution, however - this class is not an \"easy\" Expos. The readings and discussions take place on a very abstract level, and as a result, most of the papers you will be writing will be very theoretical. However, I would argue it is worth the extra effort to trudge through somewhat esoteric religious writings, because you will not only become much better at formulating scholarly arguments, but you will also probably also alter your worldview a bit in the process. There are very few Expos classes that can offer that.","This was ranked at the bottom of my list for Expos choices, but looking back, I don't know why it wasn't at the top. Many people think that Expos is a chore, but this was actually my favorite class of the semester. The readings were all interesting and after every in-class discussion, we'd walk out the door still talking about the topic. Even if you don't have any background in philosophy (I'm a prospective CS major), all you need is an open mind. Prepare for every assumption you have about your own existence to be turned upside down.","Thanks to Dr. Allen, this course's sections and readings are wonderful. Start your essays in advance to prevent the need to cram, and this course will be a painless way, if not a fantastic way, to fulfill your Expos requirement."]}},"mostRecentQ":{"overall":"4.40","workload":"2.20","difficulty":"3.50","recommendation":"4.30","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.186","course_id":"1718","cat_num":"15057","1s":"0","2s":"0","3s":"2","4s":"5","5s":"8"},"QDifficulty":{"number":"EXPOS 20.186","course_id":"1718","cat_num":"15057","1s":"0","2s":"1","3s":"6","4s":"7","5s":"1"},"QWorkload":{"number":"EXPOS 20.186","course_id":"1718","cat_num":"15057","1s":"3","2s":"7","3s":"4","4s":"1","5s":"0"}},"success":true}