{"scores":{"Spring '13":{"course_score":{"overall":"4.82","workload":"2.09","difficulty":"3.30","recommendation":"4.82","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"GOV 94ss","course_id":"2189","cat_num":"88693","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":"GOV 94ss","course_id":"2189","cat_num":"88693","1s":"0","2s":"1","3s":"5","4s":"4","5s":"0"},"QWorkload":{"number":"GOV 94ss","course_id":"2189","cat_num":"88693","1s":"1","2s":"8","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Spring '13":{"comments":["BEST.GOV.CLASS.EVER. I learned so much about gov in general and specifically women in politics. TAKE IT.","Hands down, this is the best class I've taken at Harvard. It MUST be taught every year, and the seminar made it truly unforgettable. Shauna challenges you because she knows what you can do. I improved my writing, my thinking - even my style of participating in class. This class makes you think. It inspires you. Every Government student (really, every student) has to take a class like this. I am so thankful that I got to take this while it was a seminar because the discussions were a lot of the reason why it was so incredible. The reading brings everything together beautifully (I've never really appreciated a syllabus before - and we actually discuss the reading!) and the assignments are challenging and mind-opening. The first assignment was one of the hardest and best I was ever given. And Shauna TEACHES you.","This class was my favorite class I've taken at Harvard so far! Shauna was an amazing teacher, cared about us as students and engaged us in thoughtful discussion every week. The reading was dense in the beginning of the semester but evened out as Shauna realized how much we could cover each week and was very manageable. The assignment portion of the class was great to gain hand on practice doing original research, and final paper was a thesis proposal!","This class is a gem-it will introduce you to an incredibly important subject matter largely ignored in the rest of the government curriculum and at the same time teach you about a diversity of research methods and how to go about each. Shauna is unbelievably personable and knowledgeable and she cares so much about what her students take away form this course. Workload is very fair.","Shauna is one of the best instructors I've had in my whole Harvard career, and she put together an excellent syllabus. Everyone who took this class put everything they had into it, and it was an extremely rewarding class to take. Shauna combined theory and practice so well, and really showed us all just how cool government research can be. You are really missing out if you don't take this class.","The course began with a thoughtful deconstruction of the \"group called women,\" instead of diving into women's present situation in contemporary politics. The syllabus had excellent selections from the women and politics literature, and the instructor seamlessly connected the subject matter from each week. Course discussions were thoughtful and informed by the readings. I was consistently impressed with the amount of detailed feedback on course assignments--the professor took an inordinate amount of time to provide constructive comments on reflection papers, group projects, and assignments. For students pursuing a thesis or research project, this course could not prepare them better. Students operationalize variables, work with some statistics programs, and most importantly, learn to develop clear questions for research. Students learned about IRB and surveys. Appropriately, the course was motivated by a call to action to join the movement to promote diversity of experience in political power.","Shauna Shames has a reputation for being a tough grader, but in fact she's just en extremely honest, dedicated teacher who knows how to push people to be fully engaged and to find their passion. Best course I have taken at Harvard.","Take this class. Just do it. The coursework is, admittedly, not that light, but it's far from heavy - especially because the syllabus is composed of pieces that are actually interesting and enjoyable to read. This class truly makes you think - the first paper we wrote asked whether there was a group called women that should be represented in politics, and each person in the class had to hash out what they thought and really come up with ideas. Shauna is a brilliant, warm, caring, and receptive teacher who fosters a great environment within the class, and my classmates were some of the most interesting and engaged people I've met so far at Harvard. If you've ever thought about women in the political sphere - or wondered why you haven't thought about women in the political sphere - this class is for you."]}},"mostRecentQ":{"overall":"4.82","workload":"2.09","difficulty":"3.30","recommendation":"4.82","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"GOV 94ss","course_id":"2189","cat_num":"88693","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":"GOV 94ss","course_id":"2189","cat_num":"88693","1s":"0","2s":"1","3s":"5","4s":"4","5s":"0"},"QWorkload":{"number":"GOV 94ss","course_id":"2189","cat_num":"88693","1s":"1","2s":"8","3s":"2","4s":"0","5s":"0"}},"success":true}