{"scores":{"Fall '13":{"course_score":{"overall":"4.50","workload":"2.60","difficulty":"3.80","recommendation":"4.70","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"EXPOS 20.187","course_id":"1719","cat_num":"94674","1s":"0","2s":"0","3s":"0","4s":"6","5s":"6"},"QDifficulty":{"number":"EXPOS 20.187","course_id":"1719","cat_num":"94674","1s":"0","2s":"0","3s":"5","4s":"5","5s":"2"},"QWorkload":{"number":"EXPOS 20.187","course_id":"1719","cat_num":"94674","1s":"0","2s":"6","3s":"5","4s":"1","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.33","workload":"2.20","difficulty":"3.40","recommendation":"4.20","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.187","course_id":"1719","cat_num":"94674","1s":"0","2s":"0","3s":"0","4s":"6","5s":"6"},"QDifficulty":{"number":"EXPOS 20.187","course_id":"1719","cat_num":"94674","1s":"0","2s":"0","3s":"5","4s":"5","5s":"2"},"QWorkload":{"number":"EXPOS 20.187","course_id":"1719","cat_num":"94674","1s":"0","2s":"6","3s":"5","4s":"1","5s":"0"}}}},"comments":{"Fall '12":{"comments":["This class is a great way to learn about Eastern religions without the pressure of an academic course. The topics are a little bit obscure, but if you keep an open mind they are interesting.","I didn't think I would ever take a philosophy or religion class in college (mainly because I never had taken any class of the sort, so I just never considered it). When I was put into Indian Philosophy Expos, I didn't know what to expect. Yet as the course went on, I found that it was fascinating to learn about the roots of Buddhism and Hinduism and I ended up loving this class. But I would just caution students, it won't be interesting to you if you really are not interested in philosophy or old religious texts.  If you do like religious philosophy or don't know if you do, then definitely consider it!","This has to be the best Expos class available. Everyone loved it. The subject is exciting and provocative, the readings are a pleasure and the papers practically write themselves as a result.","Lots of thinking but very rewarding\r\nVERY interesting course material - definitely something not always thought about\r\nonce in a lifetime opportunity to explore the philosophical arguments of the East","Take this class. The subject matter is interesting even if you don't know anything about Indian philosophy. The readings don't take long and Michael is so engaging and accessible and helpful outside of class.","You will have better classes in your semester, but it's not as bad as people make it sound like.","Take this course if you like to write papers on philosophy. Nevertheless, I didn't have much experience with writing philosophy papers but the texts were interesting and influential on how I think now. Also, you learn a lot from being very critical of philosophy texts and you learn how to think from all sides of the argument. You reading and writing skills will sharpen.","Boasting an amazing preceptor and uncommon but tremendously thought-provoking material, this is an unusual Expos class that rewards as often as it challenges. Definitely recommend it!","I am not a philosophy person by any means (this was ranked my 7th expos choice), but I'm genuinely interested in Buddhism and Hinduism, and as it turned out, I really loved this class. Professor Allen is an excellent preceptor - he has a background in editing so he's a tough grader, but I feel like my writing improved because of it. He also is so knowledgable about the stuff we're reading, so he adds in tidbits of information during the class that are often funny and always entertaining. I also found that he really struck a perfect balance between talking about Indian philosophy and talking about writing - and when discussing either, he is incredibly clear and articulate, and really made me feel as though I was more equip to consistently write and revise my own papers. When I was writing my papers, I could here Professor Allen's voice in my head, and the things he was teaching in class were presented in such a way that they really stuck with me. Whether that's a strength of this particular class or Expos in general, the three papers progress really logically in difficulty and scope, in order to introduce you to different kinds of academic writing. It was useful, at the very least, in putting the College's expectations out there about the level at which they want you to write. This class, I think, achieves that objective well - it's not a painless class, but looking back, I'm glad I took it.","This course is excellent. While many students complain about their expository writing class, I really enjoyed this course. It raises deep philosophical questions and introduces you to eastern religions. The workload is very manageable, and the preceptor effectively guides you during the writing process.","The readings are very interesting, making for interesting papers. I highly recommend this class for anyone who wants to learn a different outlook on life.","The topic (Hinduism and Buddhism, and their beliefs concerning the existence and purpose of the self) is incredibly interesting and Michael Allen is a great teacher. He's very relatable and funny, he leads great discussions, he chooses good readings, and he gives very good feedback on essays.","This class is too philosophy based to be a helpful expos course -- no matter how clearly you write, it will still be hard to explain. On the other side of that, you are forced to be extra clear in your writing.","For anyone interested in Philosophy in any capacity, I highly recommend this class. Not only do you learn all the essentials of college essay writing, but the material that you're reading and discussing is extremely interesting. The first day of class, Michael (yeah, we're on a first-name basis) immediately made an impression on me in his knowledge of the topic and his excitement at being able to teach it. Take this class, not only will you leave it with ill essay-writing skills, but you'll also have a better understanding of Hindu and Buddhist Philosophy."]},"Fall '13":{"comments":["Extremely interesting and fun.  Definitely worth a try, regardless of your concentration!","The course really is excellent if you like philosophy, want to explore different religions, cultures, and schools of philosophical thought, or just want to explore a new topic. Dr. Allen does a tremendous job of forcing you to evaluate and reevaluate your thought process; he was able to get me to focus not on making sure that what I wrote on the page was right, but rather on being right. Difficult to get an A, you have to really be precise in your papers and able to think critically about philosophy.","This class is tough, but Dr. Allen is phenomenal and your writing will get better. More than your writing, however, your way of thinking when planning papers will change. There are a lot of bad expos classes out there, but this one is a gem. Take it!!","Dr. Allen's teaching and knowledge on this subject makes this course a really interesting course even if you may have no experience with philosophy! Definitely opens your eyes to a lot of new topics and it also helps you learn a great deal about yourself and how you think!","Great class; extremely qualified and nice preceptor - be willing to put in the work to keep up with the readings!","This is a very enjoyable expos class that you will be sad to have ending.","Try to set aside as much time for the readings as possible because even though you can get by by skimming some of them, they are super interesting and it's helpful to have a mastery over them.","The preceptor is great and is very knowledgeable regarding the subject matter"]}},"mostRecentQ":{"overall":"4.50","workload":"2.60","difficulty":"3.80","recommendation":"4.70","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"EXPOS 20.187","course_id":"1719","cat_num":"94674","1s":"0","2s":"0","3s":"0","4s":"6","5s":"6"},"QDifficulty":{"number":"EXPOS 20.187","course_id":"1719","cat_num":"94674","1s":"0","2s":"0","3s":"5","4s":"5","5s":"2"},"QWorkload":{"number":"EXPOS 20.187","course_id":"1719","cat_num":"94674","1s":"0","2s":"6","3s":"5","4s":"1","5s":"0"}},"success":true}