{"scores":{"Fall '13":{"course_score":{"overall":"4.80","workload":"2.30","difficulty":"2.80","recommendation":"4.90","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"GOV 94ch","course_id":"2161","cat_num":"81876","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"GOV 94ch","course_id":"2161","cat_num":"81876","1s":"0","2s":"2","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 94ch","course_id":"2161","cat_num":"81876","1s":"1","2s":"5","3s":"2","4s":"1","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.67","workload":"2.25","difficulty":"3.00","recommendation":"4.50","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"GOV 94ch","course_id":"2161","cat_num":"81876","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"GOV 94ch","course_id":"2161","cat_num":"81876","1s":"0","2s":"2","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 94ch","course_id":"2161","cat_num":"81876","1s":"1","2s":"5","3s":"2","4s":"1","5s":"0"}}}},"comments":{"Spring '13":{"comments":["This is a great overview of some complex topics in ethics. This is where political theory becomes extremely applicable to the real world","My best advice: for each week, figure out what the authors were responding to and why they were writing. It saves a lot of guessing later on.","This is a very interesting subject, and Josh is a great teacher.","great seminar about ethics and civil disobedience; Josh is a very engaged and attentive TF, this is a great class for exposing yourself to the literature on freedom of conscience, conscientious objection, non violence, political ethics, utilitarianism vs deontology etc","You get out of it as much as you put in. Aka --- do the readings well, they are great!","The material is really interesting! The in class discussions are driven by the students interests--which is great if people are engaged\/interested in that weeks readings. Josh is really relaxed and does not make the course stressful! N.B. this class is not a case study class but deals with theories and broader ideas of ethics\/politics","This is a great class if you're interested in politics, ethics, and the \"problem of dirty hands\". Readings are substantial but overall doable, varied ,and very interesting.","Great class with incredibly interesting subject matter. The class gets at moral\/ethical\/political themes through case studies that are historically relevant, accessible, and interesting. The writing assignment at the end of the class might feel a little overwhelming at first, but if you start preparing early, the flexibility that you have on the topic makes it so that it's not a huge pain to complete."]},"Fall '13":{"comments":["This course is highly recommended for anyone with even a minor interest in the topic; in my own personal experience, it is one of the most interesting and best taught government courses at Harvard.","I really enjoyed the smaller discussion groups and how in depth we discussed each reading. It definitely requires that you stay on top of the readings, but they were all pretty interesting and not too lengthy or overly demanding. Josh is a great TA and was always very helpful and available to answer any questions or talk about any concerns.","Really fantastic class.  Josh is great, material is fascinating.  Was easily the highlight of my week, and I will think about the class for a long time to come.","Definitely one of the best Government 94's to take. Joshua is a great teacher, and very, very helpful. You will learn a lot about different thinkers who discuss ethics and government, which is probably something every Government concentrator should take a class in."]}},"mostRecentQ":{"overall":"4.80","workload":"2.30","difficulty":"2.80","recommendation":"4.90","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"GOV 94ch","course_id":"2161","cat_num":"81876","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"GOV 94ch","course_id":"2161","cat_num":"81876","1s":"0","2s":"2","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 94ch","course_id":"2161","cat_num":"81876","1s":"1","2s":"5","3s":"2","4s":"1","5s":"0"}},"success":true}