{"scores":{"Fall '12":{"course_score":{"overall":"3.20","workload":"2.07","difficulty":"2.86","recommendation":"3.00","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.212","course_id":"1744","cat_num":"48029","1s":"0","2s":"0","3s":"12","4s":"3","5s":"0"},"QDifficulty":{"number":"EXPOS 20.212","course_id":"1744","cat_num":"48029","1s":"0","2s":"4","3s":"8","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.212","course_id":"1744","cat_num":"48029","1s":"3","2s":"8","3s":"4","4s":"0","5s":"0"}}}},"comments":{"Fall '12":{"comments":["While it is not always fun or exciting, it can certainly make you a better writer.","I was skeptical about the topic, but the second and third units were moderately interesting.","It's not as interesting as it seems.  It has the potential to be a great course, but class discussions sort of fell flat of my expectations.","I think this is definitely an above average expos class. You have to get through all the standard, annoying expos stuff - vague statements about how to write well, assignments telling you to use some particular argumentative device - but beside that it's a good class. Many of the readings I found extremely interesting and Dr. Syba is friendly, engaging and smart, so if you like the topic it's a good choice for your expos requirement.","Do not be afraid. The rumors surrounding Expos 20 calling it wicked is a misconception. Make sure to give yourself enough time to pre plan your thoughts and write your essay for each assignment.","Not that interesting for people who do not come from a Christian background. Sometimes harder for non Christians.","You have to take it, and learning about new religions is pretty interesting.","Not a very good class.  Very difficult way to take expos.","Some of the reading is dense but is usually interesting.","You have to be pretty interested in obscure components of Christianity to really get a lot out of this course.  Its fairly easy, and Professor Syba does a good job in teaching general concepts of writing and guiding the course-work toward interesting areas, but again, your interest will depend almost entirely on a linear sliding scale with your interest in the material.","My Expos experience was positive.  If you put time into the readings and work on the essays, your writing will improve.  But it does take work.  It is easy to have a bad time in this class if you procrastinate on the assignments and don't know what you are talking about on the essays.  If you find an interesting topic, you are more likely to engage in the course.","For an Expos class, it's not too bad.","Most of the readings were very dry and boring and too complex to gain an understanding of.  Also there were some very long reading assignments."]}},"mostRecentQ":{"overall":"3.20","workload":"2.07","difficulty":"2.86","recommendation":"3.00","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.212","course_id":"1744","cat_num":"48029","1s":"0","2s":"0","3s":"12","4s":"3","5s":"0"},"QDifficulty":{"number":"EXPOS 20.212","course_id":"1744","cat_num":"48029","1s":"0","2s":"4","3s":"8","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.212","course_id":"1744","cat_num":"48029","1s":"3","2s":"8","3s":"4","4s":"0","5s":"0"}},"success":true}