{"scores":{"Spring '15":{"course_score":{"overall":"4.60","workload":"15.30","difficulty":null,"recommendation":"4.80","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"0","4s":"4","5s":"5"},"QDifficulty":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QWorkload":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"1","2s":"2","3s":"4","4s":"0","5s":"1"}}},"Fall '14":{"course_score":{"overall":"4.60","workload":"8.10","difficulty":null,"recommendation":"4.40","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"0","4s":"4","5s":"5"},"QDifficulty":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QWorkload":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"1","2s":"2","3s":"4","4s":"0","5s":"1"}}},"Spring '14":{"course_score":{"overall":"3.80","workload":"4.50","difficulty":"4.00","recommendation":"3.80","enrollment":"9","response rate":"66.67","QCourseOverall":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"0","4s":"4","5s":"5"},"QDifficulty":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QWorkload":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"1","2s":"2","3s":"4","4s":"0","5s":"1"}}},"Fall '13":{"course_score":{"overall":"3.00","workload":"3.10","difficulty":"3.80","recommendation":"3.40","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"0","4s":"4","5s":"5"},"QDifficulty":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QWorkload":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"1","2s":"2","3s":"4","4s":"0","5s":"1"}}},"Spring '13":{"course_score":{"overall":"3.50","workload":"3.70","difficulty":"3.90","recommendation":"3.40","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"0","4s":"4","5s":"5"},"QDifficulty":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QWorkload":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"1","2s":"2","3s":"4","4s":"0","5s":"1"}},"instructor_scores":[{"number":"ECON 985m","cat_num":"23048","course_id":"948","year":"2012","term":"2","id":"807212da7d87a599335786ed90be70d5","first":" Jeffrey","last":"Miron","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"2.50","AccessibleOutsideClass":"2.50","GeneratesEnthusiasm":"2.50","FacilitatesDiscussionEncouragesParticipation":"2.50","GivesUsefulFeedback":"2.50","ReturnsAssignmentsinTimelyFashion":"2.50"}]},"Fall '12":{"course_score":{"overall":"4.10","workload":"3.00","difficulty":"3.60","recommendation":"4.00","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"0","4s":"4","5s":"5"},"QDifficulty":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QWorkload":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"1","2s":"2","3s":"4","4s":"0","5s":"1"}},"instructor_scores":[{"number":"ECON 985m","cat_num":"23048","course_id":"948","year":"2012","term":"1","id":"807212da7d87a599335786ed90be70d5","first":"Jeffrey","last":"Miron","InstructorOverall":"3.83","EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Fall '12":{"comments":["It is important to be on top of things and deadlines. \r\nAlso, having data first is crucial. It is very difficult to proceed if you think of a question first and then try to find data to fit it.","Rezwan is awesome!! Extremely, extremely helpful.","Not sure why we are evaluating the first half of a thesis tutorial, but I'd recommend writing a thesis to most economics majors.","Keeps you working on your thesis, everything takes longer than expected, useful to know you're not alone"]},"Spring '13":{"comments":["Go in with at least a basic idea of what you would like to write about, and be prepared to do a lot of revisions and switch to alternative thesis topics. Start by looking for data, don't underestimate how long it will take to find it, and don't leave things until the end!","I loved my thesis experience. if you have a topic you are passionate about, I strongly recommend it.","Sections are limited in their usefulness to give you concrete and helpful feedback. Course is useful in helping you know where other students are and a forum for commiseration about data collection, paper writing, and some of the more mundane thesis-related tasks."]},"Fall '13":{"comments":["Your TF matters greatly.","The deadlines\/tone of class distract from the real work of writing a thesis. The first few weeks were spent on making presentations or doing stata psets instead of doing what was needed for my thesis. A way more efficient way to have run the class would've been to focus on getting the data, then running the regressions as soon as possible. Only the literature review was helpful in the beginning. Also, the process seemed at times out of my own control and was more aimed at getting something done rather than working towards a thesis that was of interest to me. Towards the end, I was just doing things to make the tutorial deadlines and felt discouraged by the process.","The earlier you get started on your thesis, the more you will enjoy the process. I recommend talking with professors early about potential ideas and trying to see if they can steer you in a certain direction because they know much better what has and what has not been done (and what's feasible). It's definitely important to try to build relationships with econ professors from previous classes and stay in touch with them. It could also help just reaching out to other professors whose work you might be interested in and talk to them in their office hours. \r\n\r\nA thesis is a great experience and for those who don't go on to a PhD or Master in econ, it is probably the only opportunity to do primary research and contribute to the literature. It's definitely worthwhile.","Shop TFs for thesis sections.","I would hesitate to recommend writing an economics thesis, especially if you're not doing it specifically for honors. It has been quite a frustrating and confusing process, and I doubt my thesis (if I am fortunate enough to complete it) will resemble my initial desired topic.","One-on-One meetings and deliverables each week are really helpful for keeping you on track. Sometimes, feedback can make you feel like you are way behind everyone else but it is truly helpful when revising your thesis.","Really, really make sure that you have an adviser that is personally invested in you and your topic as well as good data before you start a thesis. Having an adviser that can't help you will hurt you in the long run and before you start looking for economic questions, start by looking at the data and then pose your questions because otherwise, you'll run into many data problems. Also, if you are thinking about writing a thesis, start by reading 5 - 6 magna\/summa theses junior spring so you can get a sense of the empirical analysis that goes into these theses. This will help you greatly in understanding what goes into an economic thesis.","Thesis is great if you know what you're doing!","This class is obviously a requirement if you are intending to write a thesis. With that in mind, there are numerous sections of Economics 985 and not all sections are created equal; make sure to do some research beforehand on a given seminar leader and read reviews of them on the Q guide. It will be immensely helpful if you have a seminar leader who is more hands-off and flexible. Most of the seminar leaders are this way, but a few are not and it truly detracts from your thesis writing process."]},"Spring '14":{"comments":["Writing a thesis is one of the most valuable things you can do at Harvard - do it!","Econ theses can be frustrating because of the many topic changes that will naturally come about, but if you have a general topic that interests you, stick with it.","Writing a thesis is a very rewarding experience. The thesis seminars are helpful because you receive feedback from Anne and your peers and learn how to present and defend your argument."]},"Fall '14":{"comments":["Anne was very helpful and it was great having someone else to bounce ideas off of.  Additionally, having deadlines was helpful to keep you on track. However, the psets and deadlines often seemed like a waste of time as they weren't tailored to where you currently were in you thesis.","Anne is a fantastic seminar leader! She is very hands-on and accessible and puts a lot of thought into improving the quality of your work.","The senior thesis seminar provides a nice opportunity to present your thesis as it evolves throughout the semester, and receive feedback from classmates and an adviser. There are regular assignments throughout the semester such as a justification, data paper, and literature review. The semester concludes with a 25-page draft of your thesis-in-progress. Classes meet about half of the weeks throughout the semester, and individual meetings with the adviser take place on the other weeks. It's not too stressful in and of itself, though the thesis can be stressful, of course. Anne Le Brun is a fantastic teacher\/adviser. I'd highly recommend her if you have the opportunity.","Thesis writing is hard but rewarding!","This class, like your thesis, is what you make of it. It is possible to really engage with your classmates' presentations and take advantage of Anne's assistance and expertise, and you should! I learned a lot from this first semester.","Anne is a great seminar leader and really does try her best to help you with your thesis topic! She's always willing to sit down and chat about your topic and provides very personalized feedback where you in the writing process. It's also nice to get feedback from other students in a group setting as they can also have useful input about your project. Highly recommend preferencing Anne if you're thinking about taking the seminar.","Don't be a poltroon. Write a thesis."]},"Spring '15":{"comments":["If you take academics seriously enough to go to Harvard, you should take it seriously enough to write a thesis.","Anne is the best! She's so helpful with brainstorming \/ guiding and supporting you as you start on the thesis process from beginning to end. She's so accessible outside of regular section times and office hours are so valuable. Definitely an extremely rewarding experience and I highly recommend choosing Anne as your seminar leader!","Same as the first semester  but the only assignments are related to the thesis.","If you really want to feel like an economics concentrator, write a thesis. My experience within the concentration improved dramatically because I wrote a thesis. People in the department actually get to know you.","If you want a seminar leader who will be hands on and constantly offering valuable feedback, take the seminar with Anne! She will read up on articles you send her, forward you articles that are of interest to you that she stumbles upon, and really push you to stay on top of deadlines and turn in quality work. Working with her was a great experience.","Write a thesis! Incredibly rewarding, draining, and cool.","Writing a thesis is a difficult process, but it is also very rewarding particularly if you are interested in the subject matter.","Writing a thesis was the single greatest academic endeavor of my college years. It is certainly difficult, and is a substantial commitment, but the sense of pride and accomplishment you'll feel once finished is tremendous. If you're considering grad school, you should write a thesis. If you want a sense of what research is like, and the chance to offer an original contribution to the economics literature, you should write a thesis. (Don't write a thesis solely for honors; many who do this end up unhappy and drop the thesis midway through.) The thesis seminar provides the chance for feedback from both your TF and your classmates, which is incredibly helpful. The deadlines will keep you moving along, and you'll form a close relationship with your section leader. I highly recommend writing a thesis (and thus, taking this course)."]}},"mostRecentQ":{"overall":"4.60","workload":"15.30","difficulty":null,"recommendation":"4.80","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"0","4s":"4","5s":"5"},"QDifficulty":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QWorkload":{"number":"ECON 985m","course_id":"948","cat_num":"23048","1s":"1","2s":"2","3s":"4","4s":"0","5s":"1"}},"success":true}