{"scores":{"Spring '15":{"course_score":{"overall":"4.40","workload":"6.40","difficulty":null,"recommendation":"4.20","enrollment":"21","response rate":"66.67","QCourseOverall":{"number":"ECON 1620","course_id":"5281","cat_num":"90055","1s":"0","2s":"0","3s":"0","4s":"9","5s":"7"},"QDifficulty":{"number":"ECON 1620","course_id":"5281","cat_num":"90055","1s":"0","2s":"2","3s":"12","4s":"1","5s":"1"},"QWorkload":{"number":"ECON 1620","course_id":"5281","cat_num":"90055","1s":"3","2s":"12","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1620","cat_num":"109289","course_id":"5281","year":"2014","term":"2","id":"c7cc75689519e6aab2a34e9e46c444d7","first":" F. M.","last":"Scherer","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '13":{"course_score":{"overall":"4.44","workload":"1.88","difficulty":"3.06","recommendation":"4.50","enrollment":"18","response rate":"88.89","QCourseOverall":{"number":"ECON 1620","course_id":"5281","cat_num":"90055","1s":"0","2s":"0","3s":"0","4s":"9","5s":"7"},"QDifficulty":{"number":"ECON 1620","course_id":"5281","cat_num":"90055","1s":"0","2s":"2","3s":"12","4s":"1","5s":"1"},"QWorkload":{"number":"ECON 1620","course_id":"5281","cat_num":"90055","1s":"3","2s":"12","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '13":{"comments":["A really good economics class that is paper oriented but if you are to be a consultant is a very important thing to learn.","Great course but too bad it won't be offered anymore","Fascinating material, but difficult and sometimes unclear assignments. Also easy to fall off-track with readings","Professor Scherer is awesome and really knows his stuff. If you're interested in learning about major important industries in the world today, definitely take this class. Even if you think you might be interested, take it! Lectures were very interesting and Professor Scherer is super enthusiastic and approachable. The course requirements are also very reasonable.","I'm not sure if the class will be taught again, but if it is, take it! It's a fairly painless way to learn a great deal about a number of different industries. Professor Scherer is the man and and makes class enjoyable. He injects a bit of humor and his own personal opinion into the course material, and he seemingly is an expert on everything. The readings were great - there was a good mix of more academic data intensive readings along with more 'popular' readings, like the kind found in the Economist or Forbes. The combination helps place the data in context and gets the point across. Two papers during the semester of about 5 pages each, with a final exam or a final paper. The topics were interesting and relevant to issues policy makers face today, and you can pick your topic for the final paper if you choose to write it. I don't know if there is a professor on campus who reads our assignments with as much care as Scherer does. He even scrutinizes your references page!"]},"Spring '15":{"comments":["Fun class, learned a lot!","Professor Scherer is an incredible instructor. He knows everything about the industries that he teaches. His recollection of historical facts was more than impressive. He kept his lectures very entertaining with his voice modulation and hand movements, and his volume allowed him to speak in front of a large class without a microphone. It is so sad to see such a great talent leave Harvard. I learned so much in his class about industry structures and policies and feel very lucky to have had him as my professor.","This is the best class I have taken at Harvard. Read and pay attention! Professor Scherer is so super knowledgable. Definitely pay attention.","It is a shame that Prof. Scherer does not intend to teach this class again. I greatly enjoyed the lectures and learned a lot from writing the papers. One of my favorite classes at Harvard."]}},"mostRecentQ":{"overall":"4.40","workload":"6.40","difficulty":null,"recommendation":"4.20","enrollment":"21","response rate":"66.67","QCourseOverall":{"number":"ECON 1620","course_id":"5281","cat_num":"90055","1s":"0","2s":"0","3s":"0","4s":"9","5s":"7"},"QDifficulty":{"number":"ECON 1620","course_id":"5281","cat_num":"90055","1s":"0","2s":"2","3s":"12","4s":"1","5s":"1"},"QWorkload":{"number":"ECON 1620","course_id":"5281","cat_num":"90055","1s":"3","2s":"12","3s":"1","4s":"0","5s":"0"}},"success":true}