{"scores":{"Spring '15":{"course_score":{"overall":"4.70","workload":"5.60","difficulty":null,"recommendation":"4.50","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"1","4s":"0","5s":"1"},"QDifficulty":{"number":"NEUROBIO 101hfj","course_id":"11070","cat_num":"94358","1s":"1","2s":"0","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"0","4s":"2","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.50","workload":"4.90","difficulty":null,"recommendation":"4.50","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"1","4s":"0","5s":"1"},"QDifficulty":{"number":"NEUROBIO 101hfj","course_id":"11070","cat_num":"94358","1s":"1","2s":"0","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"0","4s":"2","5s":"0"}}},"Spring '14":{"course_score":{"overall":"5.00","workload":"2.00","difficulty":"2.60","recommendation":"5.00","enrollment":"8","response rate":"62.50","QCourseOverall":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"1","4s":"0","5s":"1"},"QDifficulty":{"number":"NEUROBIO 101hfj","course_id":"11070","cat_num":"94358","1s":"1","2s":"0","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"0","4s":"2","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.90","workload":"2.00","difficulty":"2.80","recommendation":"4.80","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"1","4s":"0","5s":"1"},"QDifficulty":{"number":"NEUROBIO 101hfj","course_id":"11070","cat_num":"94358","1s":"1","2s":"0","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"0","4s":"2","5s":"0"}}}},"comments":{"Fall '13":{"comments":["This class is an excellent introduction to brain rhythms, and Omar is a really cool guy who is clearly excited about the material because it is his life's passion.","Highly recommended for students who are very advanced in neurobiology. We learn to read highly advanced papers and methods that are the newest in the field. The work is extremely relevant and the papers are often times recent publications. Omar is the man!","(half way point) Omar is awesome, which made me take the class in the first class, though it is at night. One caveat would be sometimes it seems a bit repetitive as we talk about gamma a lot, though at times it served as good reinforcement. If we don't have as many 'bad' papers to read, which were really frustrating as you have to read through sloppy experimental design\/methods\/conclusions, it would be nice. But it is the first time this is offered and Omar seems to be very open to suggestions so the class should be even better the next time it is offered","Omar is an excellent teacher! His enthusiasm for the material is contagious. By meticulously going through the readings, you learn a lot about how to read and critically examine scientific papers.","Definitely take this course! Omar is a great teacher who is at the forefront of his field! You get to learn how to make sense of the inner brain oscillations of the brain, and you truly feel like you are the very forefront of the unknown of neurobiology."]},"Spring '14":{"comments":["A great course led by a great instructor! Omar is super nice, approachable, and knowledgeable, which made learning about brain rhythms very interesting. You may find that the ideas of brain rhythms and what they mean from when you first came into the class change drastically as you go through the course, and it is an interesting experience to learn more about this field. \r\n\r\ntldr; The course has a very low workload, Omar is super chill, and you encounter papers for a field that most other neurobiology courses at Harvard either only touch or don't cover at all, making this a great class to learn about brain rhythms","Omar is a fantastic lecturer who truly makes it easy to understand the difficult concept of brain rhythms. It's a truly fun and engaging class and I would wholeheartedly recommend everyone to take it.","Fantastic Neurobio tutorial!!! The topic is new and exciting, the readings and assignments are all really interesting, and Omar is a very passionate, patient, and knowledgeable instructor. On a more practical level, taking a tutorial helps students learn to more easily and critically read and evaluate scientific papers.","I would highly recommend this class to anyone who wants to engage with neurobiology on a deeper, research-focused level. You learn awesome MATLAB tools that you will most likely use in your future careers. Omar is a legend. He has vast, vast knowledge of the material and literally adds to the scientific community on a regular basis. I was so glad to have taken this course. I would say the papers can be long (2 a week) but it's usually all right if you read them over the weekend.","This course is excellent and Omar is a fantastic, laid-back instructor. With the exception of the three papers, it is not too much work week to week, and even during the papers Omar gives lots of help and support."]},"Fall '14":{"comments":["really great teaching, contagious enthusiasm","Great class! Professor is excellent and gives helpful feedback. Make sure to actually read papers if you want to understand what's going on.","Omar is great.  I found the first half of the course very challenging conceptually but fair grade wise.  Make sure you understand what's going on early on.  Participation is worth a lot so make sure you speak every class.","Amazing class. Feel like I've gotten a lot more comfortable reading scientific papers and I definitely know a lot more about the field of Neurobio as a whole!!","Omar is an incredible teacher. He is humble and leads by pushing students modestly. The topics are fascinating and you learn a lot in little time.","Omar is brilliant, and has so, so much to teach everyone in the class! Papers are interesting and definitely relevant to the future of the field. Awesome class!","Figures are important!  It's difficult to get into the groove, but you really do learn a lot at the end of it.  The time is well worth being spent."]},"Spring '15":{"comments":["fantastic class!!! you learn so so much!!! ups your level of knowledge on various brain circuits, neurons implicated in pathologies like epilepsy and schizophrenia, etc.","This was a difficult course for sure and Omar is brilliant.  I wasn't always able to keep up and felt bad about that but overall the class was great and I learned a lot.  It is a lot more work than Dopamine or most other tutorials.","Omar is one of the best professors I've had at Harvard. He is incredibly sharp, supportive, and leads the class through modesty and very high respect for his students. The class material itself is very stimulating as brain rhythms are endlessly intricate and complex, and they give you a framework for understanding many diseases and behaviors. Cannot recommend this tutorial highly enough.","It's a lot of work, and you really have to understand and think about the papers that you're reading, but at the end of the year it's really rewarding.","WOW. What a class. The assigned material stretches your understanding of the field of neuroscience to depths that you won't find in other classes. The material is tough, but then again so is neuro. If you truly want to feel like you're engaging with material at the forefront of the field, this class will get you there. On top of that all, Omar is inspirational, kind, brilliant, and truly makes you want to perform at your very best. The grading is very reasonable, which makes engaging with difficult material enjoyable as opposed to stressful. Only great things to say about my experience in this course!","This is a fantastic course. Omar is an excellent teacher, the material is quite interesting, and the course is structured very well.","Great course-- I learned a ton. Be prepared to work hard, but you will definitely finish feeling much more qualified as a Neurobiology concentrator."]}},"mostRecentQ":{"overall":"4.70","workload":"5.60","difficulty":null,"recommendation":"4.50","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"1","4s":"0","5s":"1"},"QDifficulty":{"number":"NEUROBIO 101hfj","course_id":"11070","cat_num":"94358","1s":"1","2s":"0","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101HFJ","course_id":"11070","cat_num":"109593","1s":"0","2s":"0","3s":"0","4s":"2","5s":"0"}},"success":true}