{"scores":{"Fall '15":{"course_score":{"overall":"5.00","workload":"4.00","difficulty":null,"recommendation":"4.70","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"0","3s":"0","4s":"0","5s":"7"},"QDifficulty":{"number":"NEUROBIO 101hfi","course_id":"11069","cat_num":"57397","1s":"0","2s":"1","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"7","3s":"0","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.60","workload":"2.80","difficulty":null,"recommendation":"4.60","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"0","3s":"0","4s":"0","5s":"7"},"QDifficulty":{"number":"NEUROBIO 101hfi","course_id":"11069","cat_num":"57397","1s":"0","2s":"1","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"7","3s":"0","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.20","workload":"2.10","difficulty":"3.10","recommendation":"4.20","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"0","3s":"0","4s":"0","5s":"7"},"QDifficulty":{"number":"NEUROBIO 101hfi","course_id":"11069","cat_num":"57397","1s":"0","2s":"1","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"7","3s":"0","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.40","workload":"2.10","difficulty":"3.10","recommendation":"4.60","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"0","3s":"0","4s":"0","5s":"7"},"QDifficulty":{"number":"NEUROBIO 101hfi","course_id":"11069","cat_num":"57397","1s":"0","2s":"1","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"7","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '13":{"comments":["absolutely amazing class, the material is fascinating, I mean who doesn't want to learn about how drugs affect your brain? The weekly assignments, presentation, and final paper were very challenging but in a good way. I 100 percent recommend this class to all neurobio concentrators.","Very interesting material! Johanna is very warm, knowledgable and engaging! She's great!","I feel that the class is missing the essential background information that is required to take the class, but perhaps this will change in the future. The readings are fantastic and Johanna is great, as are the presentations that we prepare. I would recommend taking the class, but I would say that you need background information to truly understand everything.","The subject matter is incredibly interesting, and Prof. Gutlerner is great!","This class is great. It is a very interesting look into drug addiction focused mainly on readings. The assignments prior to class make this more of a pain than other tutorials and even some other classes, but you get a lot out of it with little stress over your grade. Just do the work ahead of time and you'll find yourself really enjoying classes.","Be sure you understand concepts from MCB 80 very well! The workload is manageable but the learning curve is very steep."]},"Spring '14":{"comments":["If  you are interested  in learning  about the neurobiological basis of drug addiction and learning mor about how drugs effect behavior take this class. It may be more work than some neuron tutorials but Johanna is a great professor and you will learn so much about drug addiction and reading scientific literature.","This class is an excellent tutorial but definitely sufficiently challenging. I learned a lot about how to properly write and read neurobiology papers but be ready to work. Definitely one of the more challenging Neuro tutorials but Johanna is absolutely brilliant so it is worth it to learn from her.","This course allowed me to grow as a scientist. I was able to learn so much about the field of neurobiology throughout this year, and I felt like I really improved. I am comfortable reading papers, discussing them in a journal-club setting, giving in-depth presentations, and writing grant proposals - this class has it all! I recommend this class with enormous enthusiasm - although it may be moderately challenging, it is incredibly interesting and rewarding.","This course provided an in-depth study of addiction that was comprehensive.  The primary literature was well selected and highly informative.  The year-long duration and seminar class size were conducive to learning.","This is an amazing course, and if Johanna decides to teach it again take it! It may require a little more work than other neuro seminars, but you'll learn a lot more from it. Johanna helps you along the way, and at least this year's class provide a stimulating and accepting environment as well!","I would really not recommend this class it sounds really cool and fun and you will learn much about neurobiology\/drug addiction but at the expense of ruining your junior year. Johanna is an impossible grader with unbelievably high expectations for her students. You will write on average four pages and read 20 pages of dense scientific literature for every class, be forced to make a 45 min presentation, and do a grant symposium at the end of the year where you are forced to verbally grade your peers in front of the entire class. Easily the most stressful class I've taken at Harvard which makes no sense because its a year-long tutorial that should be easier than regular classes..."]},"Fall '14":{"comments":["Its interesting and Johanna is great at teaching! If you're passionate about research and drugs, its definitely for you. I'm not that passionate about research, so sometimes reading the scientific papers is annoying. Writing a grant proposal definitely is a challenge, especially for me because I'm not research oriented. With that said, its a good class and I'm happy I'm in it.","This is a great class.  Johanna is fantastic.  One of those classes you enjoy going to and thinking about.","Johanna is just wonderful. She really knows the material, is supportive and helpful and kind, eager to connect and engage with the class. The papers are all interesting. Expectations are always laid out and are absolutely reasonable.  I recommend with enthusiasm!","Great class! Johanna is awesome, the material is really interesting, and you learn a lot without ever begin stressed by the amount of material."]},"Fall '15":{"comments":["The material is incredibly interesting and Johanna is a fantastic instructor. Not a ton of work, but you get a lot out of it. The course is also set up to make the term paper really manageable and a good paper, modeling it in the way a thesis would be written (making it really good preparation for that!).","Johanna is a great professor -- she is engaging and very enthusiastic about the material, and she gives great feedback on your work. It is generally a low workload on a weekly basis, with one presentation and the paper adding some additional work. Great class if you're interested in the topic!","This is an interesting course, the class dynamic is great - but only take this if you are interested in addiction and have some basis in neurobiology","This a great class to learn about the basics of drug addiction and the neurological circuits underlying it. Also a good class to expose you to scientific literature. It is a reasonable amount work, and the grading is generally very fair. Class discussions are great, and as long as you do the readings and come to class willing to engage and participate, you'll be totally fine. Johanna is a fantastic instructor who is really invested and willing to help!","This is perhaps the best course I have taken at Harvard. The material is absolutely fascinating, and Johanna is amazing. She makes sure we are all on top of the material and is always available if we need help or want to discuss the topics we cover. I look forward to this class every week. I highly recommend that anyone with the slightest interest in drug addiction take this class."]}},"mostRecentQ":{"overall":"5.00","workload":"4.00","difficulty":null,"recommendation":"4.70","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"0","3s":"0","4s":"0","5s":"7"},"QDifficulty":{"number":"NEUROBIO 101hfi","course_id":"11069","cat_num":"57397","1s":"0","2s":"1","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"NEUROBIO 104A","course_id":"11069","cat_num":"109592","1s":"0","2s":"7","3s":"0","4s":"0","5s":"0"}},"success":true}