{"scores":{"Fall '13":{"course_score":{"overall":"4.70","workload":"2.50","difficulty":"3.40","recommendation":"4.70","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"HIST 60d","course_id":"10909","cat_num":"36413","1s":"0","2s":"0","3s":"0","4s":"3","5s":"7"},"QDifficulty":{"number":"HIST 60d","course_id":"10909","cat_num":"36413","1s":"0","2s":"0","3s":"6","4s":"4","5s":"0"},"QWorkload":{"number":"HIST 60d","course_id":"10909","cat_num":"36413","1s":"0","2s":"6","3s":"3","4s":"1","5s":"0"}}}},"comments":{"Fall '13":{"comments":["If this course is taught by Rowan, I would recommend it to anyone even if the material isn't necessarily the most interesting at first. The diversity of the syllabus allows it to appeal to anyone really and the option to do the final research paper on any topic is an exciting chance to take on something you've always wanted to study.","Our teacher Rowan was a complete gem, and made class a constant source of energy and focus.","Rowan is amazing!  You should take advantage of his office hours and multiple offers to read through drafts, especially if you need the help and would like to do well in the history department.  My only reservation would be that if you aren't super interested in medieval exile, maybe you should take another class.  On the bright side, you'll learn about things you never expected to, like Icelandic outlaws, lepers, French exiles to islands in the South Pacific, etc.","This course is taught extremely well, and the process for the final paper is very useful especially for those considering writing theses. Still, if you have absolutely no interest in the subject matter, I would carefully consider whether this is a good choice. There's lots of reading and you'll be expected to be an active participant in the discussion, so being invested in the material is key.","This was an amazing class taught by an even more amazing teacher in Rowan.","A fair amount of weekly readings, but to be expected from a research seminar. The readings are fantastic, Rowan is superb, and you can't do better for a history seminar. You learn first-hand about the coolest stuff imaginable.","When I first got my draft paper back, I was devastated. Rowan asked me to completely re-write it - all 20 pages. But I am so glad he did. I learned so much about how to write a paper and about how to research one. This class is worth every minute of it. Plus the topic is so fun and Rowan is a great teacher, both in discussion and most certainly in the paper. Definitely take it; it will teach you how to write a real proper research paper."]}},"mostRecentQ":{"overall":"4.70","workload":"2.50","difficulty":"3.40","recommendation":"4.70","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"HIST 60d","course_id":"10909","cat_num":"36413","1s":"0","2s":"0","3s":"0","4s":"3","5s":"7"},"QDifficulty":{"number":"HIST 60d","course_id":"10909","cat_num":"36413","1s":"0","2s":"0","3s":"6","4s":"4","5s":"0"},"QWorkload":{"number":"HIST 60d","course_id":"10909","cat_num":"36413","1s":"0","2s":"6","3s":"3","4s":"1","5s":"0"}},"success":true}