{"scores":{"Spring '14":{"course_score":{"overall":"4.60","workload":"2.20","difficulty":"2.70","recommendation":"4.60","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"HIST 60f","course_id":"10911","cat_num":"84912","1s":"0","2s":"0","3s":"0","4s":"4","5s":"6"},"QDifficulty":{"number":"HIST 60f","course_id":"10911","cat_num":"84912","1s":"0","2s":"3","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"HIST 60f","course_id":"10911","cat_num":"84912","1s":"1","2s":"6","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Spring '14":{"comments":["This was a wonderful history class that incorporated as much literature as it did history. Wonderful reading material that will expose you to books and stories you would not otherwise have discovered. Good class discussions as well.","The reading list is fantastic and thought provoking.","If you love to read novels and are interested in exploring the human side of modern Middle Eastern history, this class is for you! If you are looking for a more traditional survey course approach to the subject however, look elsewhere.","Sreemati and Jeff are amazing. Sreemati is good at facilitating discussions and asking questions that no one knows the answer to. In particular, the works we've read were fantastic and really encourage further reading. This class opened up a new realm of questions for me and, I suspect, will heavily influence my course of study.","I really enjoyed the readings for this class, though it did feel much more like a Hist and Lit class, or even simply a literature class, than a history class. I came to the class with no knowledge of Middle Eastern history, and thought I would leave with much more than I did. The discussions were still very interesting, but were much more based in the readings and novels themselves than the history. In terms of assignments, I very much enjoyed writing the final paper. The first assignments, however, were pretty unclear in terms of what they were asking for. Also, beware of this class if you are pro-Israel, as I felt that class discussion was very anti-Israel.","Great course with amazing reading materials!","This course is very focused in discussing the reading material rather than describing the history."]}},"mostRecentQ":{"overall":"4.60","workload":"2.20","difficulty":"2.70","recommendation":"4.60","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"HIST 60f","course_id":"10911","cat_num":"84912","1s":"0","2s":"0","3s":"0","4s":"4","5s":"6"},"QDifficulty":{"number":"HIST 60f","course_id":"10911","cat_num":"84912","1s":"0","2s":"3","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"HIST 60f","course_id":"10911","cat_num":"84912","1s":"1","2s":"6","3s":"3","4s":"0","5s":"0"}},"success":true}