{"scores":{"Fall '13":{"course_score":{"overall":"3.60","workload":"2.30","difficulty":"3.20","recommendation":"4.00","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"HIST 60b","course_id":"10907","cat_num":"50637","1s":"0","2s":"1","3s":"3","4s":"4","5s":"1"},"QDifficulty":{"number":"HIST 60b","course_id":"10907","cat_num":"50637","1s":"0","2s":"0","3s":"7","4s":"2","5s":"0"},"QWorkload":{"number":"HIST 60b","course_id":"10907","cat_num":"50637","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Fall '13":{"comments":["This class is a great introduction to the Pacific, and I'm so happy to finally see a Pacific history course at Harvard.  Take it if you're interested in learning more about the Pacific Islands (especially Polynesian countries), and gaining a better understanding of the past (and present) of the 1\/3 of the world that isn't usually studied except in the context of major \"Pacific Rim\" countries (China, U.S.).  The workload is reasonable for a history seminar, the readings and discussion topics are generally quite interesting and varied, and the assignments allow you to explore individual countries or regions of interest in greater detail than a broad course such as this otherwise allows.","This is a good class to give you a introduction to a lot of different themes of the Pacific, including its history and the current issues facing the Pacific. The readings were sometimes hard to get through, but overall, the class was worth while. This was the first year they had the class, so it can only get better from here!","As President Obama and former Secretary of State Clinton have stated: this is a Pacific century. America's focus is shifting toward the Pacific, therefore, it is critical that our attention turn in that direction as well. This is one of the only courses offered at Harvard about the Pacific, and provides a solid foundation for future study of the region.","Some really cool readings and discussion about a really underrepresented part of the world"]}},"mostRecentQ":{"overall":"3.60","workload":"2.30","difficulty":"3.20","recommendation":"4.00","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"HIST 60b","course_id":"10907","cat_num":"50637","1s":"0","2s":"1","3s":"3","4s":"4","5s":"1"},"QDifficulty":{"number":"HIST 60b","course_id":"10907","cat_num":"50637","1s":"0","2s":"0","3s":"7","4s":"2","5s":"0"},"QWorkload":{"number":"HIST 60b","course_id":"10907","cat_num":"50637","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"}},"success":true}