{"scores":{"Fall '13":{"course_score":{"overall":"4.10","workload":"2.00","difficulty":"2.60","recommendation":"4.10","enrollment":"83","response rate":"92.77","QCourseOverall":{"number":"HIST 1860","course_id":"10934","cat_num":"96997","1s":"1","2s":"3","3s":"17","4s":"24","5s":"32"},"QDifficulty":{"number":"HIST 1860","course_id":"10934","cat_num":"96997","1s":"7","2s":"17","3s":"50","4s":"2","5s":"0"},"QWorkload":{"number":"HIST 1860","course_id":"10934","cat_num":"96997","1s":"18","2s":"42","3s":"15","4s":"2","5s":"0"}}}},"comments":{"Fall '13":{"comments":["This class is a good way to gain a foundational understanding of the Middle East.  However, it was mostly self-taught due to the repetitiveness of the lectures.  I do feel that I learned a lot though, and I am glad that I took the class.","This is a rather easy and interesting introduction to a fascinating area of the globe. While not the most intellectually stimulating class ever, if you're coming from almost no background knowledge about the region and want to know the back-story to all of the chaos currently engulfing the Middle East, this is a good survey course to start with.","Dr. Mitter is an incredible teacher. She knows a lot, is charismatic and funny, and runs an organized, if sometimes hectic class. Her assignments are clear and not too difficult, and help you organize material. I highly recommend her as a teacher.","As a science concentrator with no background in Middle Eastern studies, let alone history, I loved this class. Professor Mitter gave incredible lectures that were constantly compelling and memorable.","This course has a wonderful teaching staff, engaging lectures, and covers extremely interesting and pertinent topics that shed a new light onto what is happening in the Middle East today.","cool class, pretty easy","This is an interesting class about the middle-east that lacks structure and thus is more difficult than it should have been.","Make sure to take this course before graduation. Professor Mitter is excellent. The course is very interesting and not challenging. It is one of the highlights of Harvard's curriculum.","This is an incredible course. It not only teaches you the history of the Middle East, it changes your perception of the world and how to think about the past in general. Additionally, the course allows you to understand how the problems in the Middle East are rooted in history and what this means going forward. Professor Mitter is so enthusiastic about this topic. You always feel energized in lecture and section. Great experience.","This is an excellent class to understand the modern Middle East. It is well-taught, fast-paced, exciting, and informative. At the end, you will not remember the name of every ruler that was mentioned in passing. This class isn't about that. You will remember important movements, trends, and themes that help you understand the Middle East today.","This course is as hard as you make it. It's fascinating to delve into a foreign time and place that is largely overlooked in American and European history. The class is engaging without being demanding, which is wonderful.","Great class. Sreemati is a great lecturer. You only have to do 6 out of the 10 response papers so you get flexibility with those, which is nice. The take home midterm takes some time because it is long but it is not hard. The final paper is fun and you get to choose any topic so there is no cumulative final which is real nice.","Great overview of the history of the Middle East for those with no background in the area. Obviously given the time constraints it was very difficult to cover everything and the professor had to skip some major events, but overall she presented a very good high level overview of the major events. Professor Mitter is also very engaging and her lectures are never boring. She ties everything together very well and you're able to see how events in one part of the Middle East affect events in other parts of the Middle East.","If you know nothing about the Middle East, this is a good course to start with. It is relative painless and you learn quite a bit.","If you want to learn about the modern Middle East and you don't know where to start, or if you don't want to delve in the specificities but rather gloss over the general themes, this is def a great start!","This course was very interesting, and the lectures were overall quite excellent. However, it was sometimes disorganized, which made planning time to prepare in advance for the lectures\/sections difficult.","This is a great course to learn about Middle Eastern history.  Dr. Mitter does a great job, and she generates so much enthusiasm about the material.  It was the most engaged I have been in lectures.","Sreemati is an incredible lecturer. Do the readings before class, I didn't and probably didn't get as much out of the class as I could have but I still really enjoyed listening to lectures. Sreemati is a fantastic professor who really cares about getting to know her students, I've loved this course.","You will get out of this course what you put in. Go to lectures, pay attention, do the readings, and participate in section. The professor is ready and willing to help you in any way possible. Take advantage of that.","It was a class for all-comers to understand the middle east with freedom to explore. You get out of it what you put in. The professor is super engaging in lecture.","An engaging introduction to modern Middle Eastern history for concentrators and non-concentrators alike.  Everyone should know the material covered in this course.","Sreemati is so passionate about the subject that you cannot help but feel the same way. She is also just a great person and someone who roots for her students to succeed. The class, given its title, is very ambitious and tries to cover a lot of stuff. I think that for an in-depth look at Middle Eastern history this is NOT the right class. If you are looking for an introduction to the subject and a general survey then this certainly IS the class to take.","Sreemati + Jeff = Victory","Dr. Mitter is a very nice person and a charismatic speaker, but would be far better suited to a seminar style class. Her lectures tended towards the repetitive and basic, and she would often repeat the same material for several classes in a row. The reading was interesting and section delved into some interesting issues, but I was hoping for more than I got with this class. That said, I did learn some Middle Eastern history and didn't have to do much work to get there.","Sreemati is an incredibly engaging and passionate professor.  She wants you to learn and care about the material--so she definitely challenges you--but she is also incredibly welcoming and understanding.  I learned a lot about the complexity of the history of the Middle East, and I now see current events in a different light.  I'm not a history concentrator, but this was a great elective and I definitely recommend it!","The material for this class is interesting but there are sometimes too many readings and lectures can be a bit scattered and disorganized.","It requires work but it's definitely worth it. It was one of my favorite classes at Harvard.","Prof. Mitter was a great lecturer and provided a comprehensive overview of the Middle East from 1798 to the present","This class is awesome! Take it! The staff is fantastic, the materials are fascinating and easy to read, the workload is generally fair and helpful, and the information you learn is incredibly relevant.","This is an absolutely amazing class. Must-take for anyone that's interested in modern-day government or politics and trying to figure out the root causes of everything that is going on in the Middle East right now. It's a very manageable amount of work and the readings are all really engaging and great.","The class is relatively straightforward in its approach to Middle Eastern history. It considers primarily the role and lasting impacts of colonial powers in the Middle East, but it often fails to account for nuance or provides alternate interpretations. The lectures are engaging and enjoyable, but they rely heavily on review of previously covered materials, which is disappointing. However, the staff seem knowledgable and do genuinely care about the students. I do think they could attempt to push more material and information on us, though, to see what sticks.","There is a significant amount of reading. The readings are assigned twice a week. However, much of it is not necessary for section and lecture. You can get by with reading only a small portion of the assignments a week.","You will learn so much about this important region. Mitter is very passionate about the material and knows so much. Work on your response papers and be sure to cite the readings. Know that the take home midterm will take MUCH LONGER than 3 hours. More like 10 hours. But if you focus, you will be able to do well.","Take it if you are at all interested in understanding today's Middle East- not only to learn about the problems, but also to see hope for its future.","Probably too ambitious in terms of scope, but I learned a lot.","Excellent lecturer.","Take this course. The entire teaching staff was great and a knowledge of Middle Eastern history as covered by this course is very beneficial to understand current and future events.","This was an absolutely fantastic class! I loved every minute! I am not a history concentrator nor do I have any background on the Middle East but this was eye opening.  Dr. Mitter is great- she put so much effort into the class and is so enthusiastic!  If you have any interest in somewhat understanding what is happening in the Middle East today, this class gives you a wonderful grounding in the history of the region.","Don't take this class if Professor Mitter is still teaching it. My TF was fantastic, but the lectures were ABSOLUTELY POINTLESS and I learned more from reading the textbooks each week than from going to class. Truly. Also trying to learn about the Middle East from 1798 to the present is just an idiotic idea. We literally spent 1 day on the Iran-Iraq war and less on more important issues. Didn't touch Afghanistan or Pakistan, which I believe were somewhat arbitrarily cut out of the course on the pretext of not being \"Middle Eastern\" (true, they're South Asian, but have a LOT of bearing on the course of current Middle Eastern affairs). Also: the past 10 years weren't touched. Don't take the class.","Great class to take if you want to gain a broad understanding of Middle East. Instructor puts in a lot of effort and tries to make lectures as interactive as possible. Overall very insightful course.","Take it! Great survey of middle eastern history- learned a TON without the pressure of being responsible for specific facts or dates. Could write about whatever I wanted week to week.","This class provides a great overview of Middle East history. Sreemati is an engaging lecturer, and section isn't just a repetitive review - it provides a space to look at primary source documents and delve deeper into one particular topic.","Do the Gelvin reading because that is the course","Prof Sreemati is great","Engaging class about a fascinating subject. Well taught so that lectures were entertaining and engaging. Readings and assignments were interesting. Course was interesting without being too difficult either. A gem if you're interested in the Middle East at all.","This class is great for those who would like to gain a better understanding of how the Modern Middle East came to be what it is today. The workload is very fair, and Sreemati exudes passion for the subject.","This course is a relatively easy way to get a very good overview of the modern Middle East. You'll come away with a solid understanding of both broad themes and specific events. Sreemati and the TFs are always eager to help and talk to you about anything.","Honestly the best class I have ever taken at Harvard. Sreemati's enthusiasm for the material is CONTAGIOUS, and the way she lectures makes the most complicated concepts clear and easy to understand. All the assignments really help one tie themes and concepts together, and were hardly a chore. If you've ever had any interest in the Middle East, I urge you to take this class. It's the best introduction I have ever come across.","Take a different class about the middle east","Great course that will provide you with essential background on the history of the greater middle east.","Mitter is a great lecturer, not too demanding of a class, definitely get a lot out of it","The period in question is far too long to cover in any real depth, check every fact Mitter refers to.","Gives you a comprehensive knowledge of the history of an increasingly important part of the world.","It is not a super hard history course, think of it as an easy survey course on the region. You can do all the readings and learn a lot or get by doing practically nothing"]}},"mostRecentQ":{"overall":"4.10","workload":"2.00","difficulty":"2.60","recommendation":"4.10","enrollment":"83","response rate":"92.77","QCourseOverall":{"number":"HIST 1860","course_id":"10934","cat_num":"96997","1s":"1","2s":"3","3s":"17","4s":"24","5s":"32"},"QDifficulty":{"number":"HIST 1860","course_id":"10934","cat_num":"96997","1s":"7","2s":"17","3s":"50","4s":"2","5s":"0"},"QWorkload":{"number":"HIST 1860","course_id":"10934","cat_num":"96997","1s":"18","2s":"42","3s":"15","4s":"2","5s":"0"}},"success":true}