{"scores":{"Spring '14":{"course_score":{"overall":"4.70","workload":"2.70","difficulty":"3.10","recommendation":"4.90","enrollment":"17","response rate":"82.35","QCourseOverall":{"number":"HIST 60g","course_id":"10912","cat_num":"46931","1s":"0","2s":"0","3s":"0","4s":"4","5s":"10"},"QDifficulty":{"number":"HIST 60g","course_id":"10912","cat_num":"46931","1s":"0","2s":"2","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"HIST 60g","course_id":"10912","cat_num":"46931","1s":"1","2s":"5","3s":"6","4s":"1","5s":"1"}}}},"comments":{"Spring '14":{"comments":["If you are interested in the modern Middle East and want to really understand the last 100 years of history that shaped the Middle East into what it is today, this is the perfect class for you. The class gives an incredible amount of information on the Middle East, and it encourages students to further their understanding the region throughout. The teaching staff, readings, the other selected students, and assignments are all great. However, be warned that the class is a lot of work, especially if you are a freshman and\/or haven't taken many reading classes. Still, the workload is worth it thanks to the amazingly informative readings and incredible, involved teachers and students.","Sreemati is an amazing seminar leader. The seminar is highly interactive and manages to highlight the complexity of the many discussion topics while successfully navigating the potential pitfalls of the controversies. I definitely recommend this class to anyone who is interested in history and the Middle East!","You will get a lot out of this course if you participate enthusiastically in class and do all of the readings.","This was perhaps my favorite class that I've taken in three years here. Both Professor Sreemati and Elise were tremendously helpful with allowing us to understand the vital questions facing the Middle East today and how they are so intrinsically connected to historical factors. It was truly a joy to attend this seminar each week, and I would highly encourage it for future students!","Sadly it likely won't be offered again since Sreemati is leaving. But if you want a fun, small class with engaging readings and not too much work, this is it!","You will get as much out of this class as you put into it. If you do all the readings and work really hard on your papers then you will find this class really rewarding. If not, you will finish the semester and wonder what the point of the class was. Sreemati makes it so that the class is not necessarily difficult, but only as hard as you want to make it.","Discussion was great and readings were really interesting, covers a lot of interesting topics that you can't study anywhere else in depth in the history department. The flexibility on the final paper was really great too.","This was a great class overall. There is a substantial amount of reading, but the assignments were not too strenuous and were helpful in gaining a greater grasp of course readings and themes. Sreemati is a great discussion leader, though sometimes discussions were a little disorganized.","This class was quite frankly one of the best I've taken while at Harvard. Sreemati and Elise are excellent in generating enthusiasm around the subject matter, and the way in which each of our sessions was structured was perfect. Definitely take this course even if you have the slightest interest in Middle Eastern affairs.","great class! absolutely should take, no background necessary, very enjoyable and learned just so much - a very fun experience!","This course is a great one to take if you really want to get to know and understand the important events that have shaped the modern Middle East."]}},"mostRecentQ":{"overall":"4.70","workload":"2.70","difficulty":"3.10","recommendation":"4.90","enrollment":"17","response rate":"82.35","QCourseOverall":{"number":"HIST 60g","course_id":"10912","cat_num":"46931","1s":"0","2s":"0","3s":"0","4s":"4","5s":"10"},"QDifficulty":{"number":"HIST 60g","course_id":"10912","cat_num":"46931","1s":"0","2s":"2","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"HIST 60g","course_id":"10912","cat_num":"46931","1s":"1","2s":"5","3s":"6","4s":"1","5s":"1"}},"success":true}