{"scores":{"Fall '13":{"course_score":{"overall":"4.80","workload":"1.70","difficulty":"2.20","recommendation":"4.90","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"FRSEMR 39z","course_id":"10835","cat_num":"72955","1s":"0","2s":"0","3s":"0","4s":"2","5s":"8"},"QDifficulty":{"number":"FRSEMR 39z","course_id":"10835","cat_num":"72955","1s":"1","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 39z","course_id":"10835","cat_num":"72955","1s":"4","2s":"5","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Fall '13":{"comments":["While the required workload isn't very much, you'll want more to work on! I read these books over and over. Great.","A highlight of my freshman fall. Great people and great conversations about great literature.","A willingness to read and a knowledge if at least some heroes in either literature or pop culture","A VERY interesting class, and although I know there are a lot of interesting seminars out there, if this one is at all related to the field you want to study, go for it.","This course was, in most ways, too much fun to be true. An excellent way to start freshman year. Not too demanding in terms of workload, especially if you are already familiar with a number of the books. This is not a deeply rigorous class, but it is an interesting and entertaining one if you are willing to participate fully in the experience. Luke is great--enthusiastic, knowledgeable, and open to feedback from students. I would recommend taking this class only if you love the course topic (heroes, epics, the evolution of the heroic journey, fantasy literature)--if you don't,  you will be bored, but then, why would you apply for it anyway if you don't? If you do, I recommend it wholeheartedly! It will be a shining beacon of happy class discussion and wonderful novels in the midst of an occasionally overwhelming first semester.","This is a great course complete with a great professor, book list, and not too much work.","Luke Taylor is brilliant not only in his understanding of material, but also in the way in which he teaches the class. He is encouraging and including of everyone in the class, but adds his own insight when appropriate, adding a lot to the course.","It's awesome. If you're interested in the development of literature regarding the hero or literally just like reading it's an incredible course."]}},"mostRecentQ":{"overall":"4.80","workload":"1.70","difficulty":"2.20","recommendation":"4.90","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"FRSEMR 39z","course_id":"10835","cat_num":"72955","1s":"0","2s":"0","3s":"0","4s":"2","5s":"8"},"QDifficulty":{"number":"FRSEMR 39z","course_id":"10835","cat_num":"72955","1s":"1","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 39z","course_id":"10835","cat_num":"72955","1s":"4","2s":"5","3s":"1","4s":"0","5s":"0"}},"success":true}