{"scores":{"Fall '15":{"course_score":{"overall":"4.50","workload":"4.10","difficulty":null,"recommendation":"4.50","enrollment":"16","response rate":"100.00","QCourseOverall":{"number":"PSY 980P","course_id":"11327","cat_num":"110110","1s":"0","2s":"0","3s":"3","4s":"2","5s":"11"},"QDifficulty":{"number":"PSY 980p","course_id":"11327","cat_num":"16581","1s":"2","2s":"6","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980P","course_id":"11327","cat_num":"110110","1s":"3","2s":"11","3s":"1","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.70","workload":"1.50","difficulty":"2.40","recommendation":"4.70","enrollment":"18","response rate":"94.44","QCourseOverall":{"number":"PSY 980P","course_id":"11327","cat_num":"110110","1s":"0","2s":"0","3s":"3","4s":"2","5s":"11"},"QDifficulty":{"number":"PSY 980p","course_id":"11327","cat_num":"16581","1s":"2","2s":"6","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980P","course_id":"11327","cat_num":"110110","1s":"3","2s":"11","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Fall '13":{"comments":["I loved this class. Sarah Hope is charming and warm. I learned so much about social issues in mental health. The class is graded on weekly response papers and a final paper so low stress!","Professor Lincoln knows clinical\/abnormal literature well, is great at moderating class discussions, and knows how to connect the literature to the real world and individuals.  Highly recommended for those with an interest in the subject area!","This class was amazing!! Professor Hope is the best. She is so nice and considerate and is great at facilitating discussion. The breakdown of the final paper makes it really easy to get feedback and keeps you on top of things. The class discussions were really good. Could not recommend this class more highly.","This is one of the best psychology seminars I have taken. The subject matter is fascinating and focused on a specific aspect of psychopathology. Sarah Hope is very knowledgable and shares that knowledge very effectively. If you're interested in social psychology, psychopathology or both, then take this class!","I loved this class!","The discussions are very interesting and class is exciting to attend. The class gives you a lot of insight into thinking critically about psychology research but it can get frustrating sometimes to realize how difficult it is to get conclusive findings from studies."]},"Fall '15":{"comments":["very interesting course. The professor is great","Great class. Response Papers every week can be a little much. But class only once a week even though its at night.","Make sure to ask a lot of questions. Sarah Hope is great in the classroom, and she'll give back a lot if you put a good amount of effort into the course. Otherwise, the class is very easy.","Great course, Sarah creates a perfect atmosphere and you learn a lot.","One of those gem courses that doesn't require too much work, yet you get SO MUCH out of it. Wonderful professor and incredibly interesting subject material (and sadly, highly relevant, given the presence of shootings and overall mental illness experienced all around us). That being said, sometimes it can take a while to get assignments back, but that is truly my only complaint about this course!","Sarah Hope is absolutely wonderful and super approachable. You can talk to her about anything (she encourages it!). Subject matter is also interesting if you're curious about developmental psychopathology! Only thing is don't be too worried if you're not getting all assignments back - sometimes not returned at all.  Overall, take this for Sarah Hope because she's awesome! Also, only 2 hrs a week is nice.","This class is fantastic! Sarah Hope is amazing. The readings and assignments are very manageable and incredibly interesting!","This course is a very good choice if you like lively discussions in a small group. You learn a lot about different abnormalities and get to know a lot of research on this topic.","Sarah Hope is the most wonderful instructor, and teaches a sometimes delicate subject with tremendous passion and tact. It was a pleasure being in this class! The readings were always fascinating and the work load was completely fair and manageable.","Very interesting material, taught by a very kind and knowledgeable professor. The work is very reasonable and even enjoyable. There are really no downsides to speak of as far as this class goes. You learn a lot and it's not a struggle to do so."]}},"mostRecentQ":{"overall":"4.50","workload":"4.10","difficulty":null,"recommendation":"4.50","enrollment":"16","response rate":"100.00","QCourseOverall":{"number":"PSY 980P","course_id":"11327","cat_num":"110110","1s":"0","2s":"0","3s":"3","4s":"2","5s":"11"},"QDifficulty":{"number":"PSY 980p","course_id":"11327","cat_num":"16581","1s":"2","2s":"6","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980P","course_id":"11327","cat_num":"110110","1s":"3","2s":"11","3s":"1","4s":"0","5s":"0"}},"success":true}