{"scores":{"Spring '15":{"course_score":{"overall":"4.10","workload":"4.50","difficulty":null,"recommendation":"4.10","enrollment":"16","response rate":"93.75","QCourseOverall":{"number":"EXPOS 20.246","course_id":"11481","cat_num":"92306","1s":"0","2s":"0","3s":"5","4s":"6","5s":"3"},"QDifficulty":{"number":"EXPOS 20.246","course_id":"11481","cat_num":"92306","1s":"0","2s":"2","3s":"6","4s":"5","5s":"0"},"QWorkload":{"number":"EXPOS 20.246","course_id":"11481","cat_num":"92306","1s":"2","2s":"8","3s":"2","4s":"1","5s":"0"}}},"Spring '14":{"course_score":{"overall":"3.90","workload":"2.20","difficulty":"3.20","recommendation":"3.80","enrollment":"14","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.246","course_id":"11481","cat_num":"92306","1s":"0","2s":"0","3s":"5","4s":"6","5s":"3"},"QDifficulty":{"number":"EXPOS 20.246","course_id":"11481","cat_num":"92306","1s":"0","2s":"2","3s":"6","4s":"5","5s":"0"},"QWorkload":{"number":"EXPOS 20.246","course_id":"11481","cat_num":"92306","1s":"2","2s":"8","3s":"2","4s":"1","5s":"0"}}}},"comments":{"Spring '14":{"comments":["I think students must have a pretty strong interest in this type of material or obviously will not come out with the best experience. The readings are often times pretty lengthy so you must like this topic.","Students who take this class generally have a very strong interest in the political sciences field. They are interested in actively finding ways to improve democracy as it is used today. This class requires a lot of outside reading and a commitment to applying both outside reading and class discussion to its essays.","Skim the readings, but focus on the style rather than the content. It is easy to get absorbed into the interesting government aspects though you will be graded on your ability to reproduce a form of composition as opposed to your understanding of the theories.","This class is a great combination of improving your writing and still learning a lot of content about a specific topic. I would highly recommend it. Yascha provides very detailed and thorough feedback on  essays and the readings he chose are the types of readings that I can see myself coming back to in the future. They weren't very long readings and I really enjoyed them. Most people say that they dislike expos, but it was actually my favorite class this semester. Class discussions were engaging and Yascha was a good moderator to guide the thoughts of the class when they became disorganized. If you're interested in politics or technology, this expos is for you","Some of the readings are difficult to get through; however, the class is run in a relaxed manner and the preceptor actually focuses on the content of your essay rather than nitpicking details\/complex grammar\/formatting.","This class touches on some very interesting ideas regarding technology and democracy. The concepts are important, but the focus is definitely on writing convincing arguments.","The course is very interesting. Class discussion is a little formal, but you will get to discuss relevant and provoking issues concerning social media and politics.","This Expos course was very interesting, I learned a lot through the readings and discussions. However, while my writing improved over the semester, I feel that I could have used some more guidance during section. Additionally, there is not much feedback on response papers.","This class is a great choice for expos. Yascha is an awesome preceptor who will really help you improve as a writer. Both the readings and the assignments are all very interesting and intellectually stimulating. The grading is fair and the feedback on your writing is comprehensive. TAKE IT","Yascha is a good preceptor and knows a lot about his subject and how to write well. Just know that he has a very specific view of what constitutes good writing and getting good grades often means fitting that view as opposed to necessarily writing better. The class discussions and readings are well thought out and interesting."]},"Spring '15":{"comments":["Stay ahead on all papers!","TAKE THIS EXPOS CLASS!! Yascha is an incredible preceptor. He does pretty much everything that an expos preceptor should do. He gives you detailed and direct feedback on your drafts. He's also very fair. He rewards you for working on what he wants you to work on. I have heard many stories about awful or unfair preceptors, and Yascha does not fit into any of those characterizations. If you're at all interested in government or technology's impact on government, I highly recommend this course. The only caveat is that foreign students unfamiliar with the American system of government may find themselves at a bit of a disadvantage. It's not an unreasonable amount of work, although some of the readings get slightly long.\r\n\r\nAll in all, this course made me a better writer. I now know how to structure academic arguments and attack a paper. What more could I ask for in an expos course?","This is a really good option for expos if you are interested in technology and government. Yascha is the best. His comments are really helpful. The subject is really relevant to what our government is experiencing today and what we are seeing in other countries, so it is interesting. Take it!","it is boring but you learn things","This course is for you if you are interested in the way technology can shape democracy in the future and are interested in US government in particular. The course explores different theories of how technology can lead to better decisions and how people can be more involved using technology which is super interesting when considering the implications this has on democracy.","If you are interested in both politics and technology, this is the perfect class for you.  It is rather easy to understand, and the readings are pretty engaging.  Yascha is a great TF who really does his best to help out each and every one of his students.","It provides a unique look at how technology can shape democracy. The readings are short(ish) and necessary to read. But there isn't a really substantial time commitment until you actually write an essay. The response papers are extremely helpful when it comes to writing your drafts. It's very logically structured to define democracy, examine the role of technology in protests, and then how technology can be incorporated into the government to make it function more efficiently. Yascha is also just a really great, inviting individual.","Yascha's awesome. You need a lot of interest in the topic though as the material can be dense and uninteresting if you're not into politics and\/or technology.","For non-government concentrators the material can be complex, the writing portion is similar to a entry level government class","This is a great expos class! Professor Mounk is incredibly helpful in his feedback, and the subject matter provides you with a lot of insight regarding national and global issues and the role the internet plays within them.","The course material is great, the course work is manageable, there's no busy, and you become a stronger writer. Yascha makes you excellent at communicating an effective argument, but if you want to try creative writing styles, that won't be too encouraged in this class.","Will greatly improve writing, subject itself wasn't too thrilling."]}},"mostRecentQ":{"overall":"4.10","workload":"4.50","difficulty":null,"recommendation":"4.10","enrollment":"16","response rate":"93.75","QCourseOverall":{"number":"EXPOS 20.246","course_id":"11481","cat_num":"92306","1s":"0","2s":"0","3s":"5","4s":"6","5s":"3"},"QDifficulty":{"number":"EXPOS 20.246","course_id":"11481","cat_num":"92306","1s":"0","2s":"2","3s":"6","4s":"5","5s":"0"},"QWorkload":{"number":"EXPOS 20.246","course_id":"11481","cat_num":"92306","1s":"2","2s":"8","3s":"2","4s":"1","5s":"0"}},"success":true}