{"scores":{"Spring '17":{"course_score":{"overall":"4.50","workload":"4.50","difficulty":null,"recommendation":"4.50","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.70","workload":"5.90","difficulty":null,"recommendation":"4.80","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '15":{"course_score":{"overall":"4.20","workload":"3.00","difficulty":null,"recommendation":"4.30","enrollment":"26","response rate":"88.46","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.70","workload":"2.20","difficulty":"3.00","recommendation":"4.60","enrollment":"33","response rate":"66.67","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.59","workload":"1.65","difficulty":"2.09","recommendation":"4.79","enrollment":"43","response rate":"79.07","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"4.71","workload":"1.59","difficulty":"1.90","recommendation":"4.73","enrollment":"42","response rate":"97.62","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"4.51","workload":"1.86","difficulty":"2.24","recommendation":"4.62","enrollment":"52","response rate":"80.77","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '10":{"course_score":{"overall":"4.55","workload":"1.76","difficulty":"2.18","recommendation":"4.79","enrollment":"38","response rate":"76.32","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '09":{"course_score":{"overall":"4.90","workload":"2.13","difficulty":"2.17","recommendation":"4.90","enrollment":"31","response rate":"96.77","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '08":{"course_score":{"overall":"4.40","workload":"1.80","difficulty":"2.15","recommendation":"4.85","enrollment":"34","response rate":"61.76","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}},"Spring '07":{"course_score":{"overall":"4.54","workload":"1.50","difficulty":"2.15","recommendation":"4.77","enrollment":"47","response rate":"57.45","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}}}},"comments":{"Spring '08":{"comments":["That it has a great professor who is very understanding and approachable and cares about each individual student. He always is interested in what you have to say and is enthusiastic about sharing knowledge of Brazilian culture with his students.","Portuguese Ad is a fun, easy way to dramatically improve your Portuguese while samba-ing right through the semester!","Portuguese Ac and Ad are probably the easiest courses taught at Harvard. That said, the course covers a lot of information, including all the grammar patterns you'd need to express yourself fluently in a Portuguese-speaking country, and all of the TAs are absolutely wonderful and willing to help with anything.","If you've already studied Spanish you should go ahead and acquire Portuguese!","It's very easy, and a nice senior year elective. It was also a good feeling to add an extra language into my repertoire so easily, and the teaching staff does a good job of teaching Spanish speakers how to speak Portuguese.","It's a good course that does a great job teaching Portuguese grammar and pronunciation.  I just wish my instructor had allowed us to speak more in class.","A fun and informative, although non-intensive, introduction to Portuguese.","This course gives you a great introduction to a beautiful language and the culture of Brazil--you get a really solid basis for further studies in the language.","It is a very enjoyable and manageable class. They make it as painless as possible."]},"Spring '09":{"comments":["Portuguese is a hidden gem in the Romance Languages Department. Take it, and you will not be disappointed.","If you want to learn Portuguese, take this class.","Excellent follow-up to Beginning Portuguese for Spanish speakers. The course is an ideal space to develop speaking, listening, reading and writing abilities.","Portuguese is so beautiful and so much fun to learn!  All of the people working in this department are amazing so don't be afraid to reach out to any of them.","GREAT GREAT CLASS! Super fun and you learn SO fast.","Take this class.","provides strong foundations for portuguese language ability","The Portuguese Department is one of the most accessible ones in the university.  They are not only friendly and easy going, but also helpful and knowledgeable.","Doing the practice questions on the website really helps prepare  you for the exams!","truly excellent in every respect","This is an excellent class to take if you have a background in Romance Languages. The learning curve for Portuguese is not horrible if you already know another Romance Language. It's a great way to pick up a 3rd language!","excellent class; great, fun way to learn a language","You will learn Portuguese, and you will enjoy it.","everyone must take it","Great course where one really learns and manages to converse, write and read Portuguese within the year.  Excellent skill building class.","Work hard and have a good time. You will learn a lot.","One of the most fun classes at Harvard, and you learn an incredible amount.  Highly recommended.","This is an enjoyable, painless course and can even easily be taken as a fifth class.","Portuguese for Spanish Speakers is a wonderful class, representative of Harvard's incredibly strong language program. As someone who had only a little bit of exposure to the language previous to my two semesters in the program, I would now say that I would be comfortable interacting with native speakers in and outside of Brazil. I particularly enjoyed our oral presentation assignment this semester where we summarized and discussed articles pertaining to issues occurring in the Portuguese-speaking world. The level of discussion that emerged from this assignment were the best that I have had in any class this semester. A final note: the assignments are interesting and no strain."]},"Spring '10":{"comments":["Like Portuguese Ad, this course is an easy and fun way to learn some Portuguese. And as with the first semester course, the opportunity to learn a lot is there if you take it. The opportunity to learn close to nothing is also there, though, and it can be tough to stay motivated. Definitely take advantage of the language resource center for speaking practice and general help.","This is a great class! Everyone in the Portguese department is warm and welcoming and generate such enthusiam for the language!","Great and easy way of becoming fluent in a language.","Amazing class!! Please do not miss out on this gem.","POrtuguese is seriously the funnest class I have taken here. ALthough you're learning a language, the atmosphere of the class just makes it seem so much more relaxed by coupling learning material with material from Brazilian popular culture, from news articles, etc. I would definitely recommend this course.","You should enjoy learning languages.","This class is a great way learn Portuguese for those who are interested in traveling to Brazil, or who just want to learn a new language.  Make sure to get a section with Chris is you can-- he made the class completely painless and very fun.  I looked forward to going to class and can't wait to continue Portuguese.","Make sure you are willing to practice your Portuguese all the time if you want to do well!","This is one of the best courses I have taken at Harvard and if you want to learn a useful language while still having fun, Portuguese is for you."]},"Spring '11":{"comments":["This class is excellent. If you want to learn Portuguese fast and well this class is perfect. The section are small and the class is not very difficult. As long as you keep up with the workbook problems the quizzes and tests will be a piece of cake. Please please take it!","excellent course","One of the best courses around. A lot is learned, and you have a bunch of fun while you're at it. What more can you ask for?","If you want to have fun learning a language, and learn a new language relatively quickly, this is a great way to do it. If you're interested, chances are you will love this class!","This class is amazing! You will learn so much, and you'll have fun while doing it. The workbook exercises do take time, but doing them will help you to feel much more confident about your abilities with regards to Portuguese.","It is as advertised, but not stressful","This class is absolutely wonderful. It's such a refreshing breather from other classes, especially if you are premed. You learn so much in this course. By the end of the semester, you will be able to carry a full conversation with a native speaker. The instructors for this course and the Portuguese department as a whole are incredible. They are very conscientious and truly care for the welfare and learning of their students. This has been my favorite class at Harvard by far. Have the audacity to do something a little different but rewarding. Take this class!","This class is AWESOME! Who wouldn't want to learn another language. Especially the language spoken in Brazil!! Especially since the World Cup AND the olympics will be there in the next few years. Cmon!","Portuguese is a wonderful language and this course will definitely help you learn the language and learn about Portuguese-speaking countries.","This class is amazing and so much fun. It is definitely worth the effort.","It's a great way to learn a new language.","The faculty is amazing.","Take it.","This class is very easy and allows you to learn a significant amount of portuguese. i really suggest taking it although the workbook can get extremely tedious at times and can take up a lot of time if you save it until the last minute (which you probably will do)","This is definitely an awesome course. It is not that difficult and I am so","Amazing class take it!","It's great, not stressful at all, and lots of fun.","One of the best language classes at Harvard. I highly recommend this class to anyone who is interested in the language or may travel to Brazil or Portugal.","If you put in the work, and do the workbook exercises conscientiously and attentively, you will be very well versed with regards to portuguese speaking and reading.","Very fun course. Learn a lot and the work load is VERY manageable. Portuguese department is great.","This is a great course and an excellent way to continue to learn grammar and vocabulary.","It's a great opportunity to learn a really interesting language and also to learn a little about Brazilian culture.","I would recommend this course to anyone who wants to quickly begin learning a new language now that you have mastered Spanish. I loved my experience! This is especially true since a lot of Ac people went through to Ad-- great vibe and interesting language.","I would recommend it without any reservations! It has been one of the best courses of my Harvard career and completely helpful for my career development!","It is best if you are already able to communcate basic ideas in the language. Else, it could be frustrating as there is little speaking practice and all of a sudden you have to try and get a point across.","This course is very laid-back, but you will learn a substantial amount of Portuguese if you keep up!  Its also a great opportunity to meet other students. Conceicao is an excellent TF and made an effort to get to know us outside of class!","This class is a very fun experience. I have a lot of friends in other language courses who make it sound like learning a new language is painful. I was able to learn a new language and have fun along the way without stressing out about a grade.","This class is the exact same as Beginning Portuguese so you should really only take it if you're interested in learning the language or just taking an easy course.  The name of the course--Portuguese for Spanish Speakers--means nothing.  If you know Spanish, you will probably be able to learn the material more quickly because the languages are so similar, but don't let the title of the course fool you into thinking that the course material and the way in which it is taught will be catered to you."]},"Spring '12":{"comments":["It's quite easy and fine.","Portuguese is great. It's a small class and most of the teachers in the department are really chill and fun.","I learned a great deal throughout the semester. If you want to learn Portuguese, take it!","TAKE IT!! Brazil is the next big thing, and with the World Cup and the Olympics coming up, Portuguese will be very useful if you want to go. It's also super easy to learn, and really just a beautiful language.","It is a great class. Not stressful at all, and you do learn a lot not only about portuguese but also about portuguese-speaking countries.","I highly recommend this course-- one of the best decisions I've made at Harvard. Easy to learn, fun atmosphere, and not too much work beyond the workbook.","If you speak spanish and took the first semester portuguese for spanish speakers, this course is too slow and repetitive","This is an amazing class. The TFs are extremely helpful and accesible, generating enthusiasm for the subject.","It's a fun class that is going to be very useful in the future!","If you know Spanish, you might as well learn Portuguese. If you already took Ac, then Ad isn't that much different, except you learn more tenses and conjugations, so you really can get to have a conversation with native speakers. You can easily understand Portuguese fluently","Take this class. Portuguese is incredibly simple to learn if you already know Spanish, but distinct and cool in its own way. Don't be complacent with only knowing one foreign language.","youll love it.","Painless way to learn a new language","Great course!","Portuguese is the best language at Harvard. So useful and so beautiful.","This class was VERY enjoyable, and it was relatively low-stress while still providing me with a GREAT background of the Portuguese language and culture. Overall it was by far one of my favorite language courses offered at Harvard.","I loved this class! It's so much fun and you're learning, too. Hard combination to find.","Great class! Very fun, you learn a lot of Portuguese in a short amount of time, low workload, and quite easy. I would definitely recommend it!","This is such a great course!! TAKE IT!! You find that by the end of the year, you have pretty effortlessly learned an immense amount of Portuguese, and that you're applying it to various scenarios in your life. I took it as a fifth class, and it's definitely manageable, not to mention incredibly fun. So glad I took it!","This class is a fun way for Spanish speakers to learn Portuguese. The workload isn't that much and you walk away with a lot by the end of the second semester.","This class is great for Spanish speakers that want to quickly learn a new language.","This class is a great way to learn a new, increasingly influential language, in a productive and fun environment.","It is great to see your fluency skills continuously improve as you transition from grammar exercises and vocabulary studies to discussions, debates, and cultural studies.","The emphasis is on conversation, communication, and fluency.","Take this class. You could easily take it as a fifth course if you want to. Heloisa is absolutely wonderful and makes class a pleasure. Go for smaller sections if you can. You speak a lot more and generally have a better experience if you develop a good class dynamic."]},"Spring '13":{"comments":["Portuguese Ad is an amazing class! You really learn a lot, and get to be a lot more comfortable speaking in Portuguese (which is honestly one of the hardest things for me). The teachers really care, and even though it's a basic class, you feel like you've learned a lot more!","This is a great class where we learn a lot of Portuguese. However, it should meet more often.","The section leader makes or breaks how enthusiastic you will be about the course.  But the course work itself is very good at helping you learn the language.  You just have to be willing to engage in class to get the most out of it.","Great course! Really helped further my understanding and knowledge of the language and culture.","This class is a gem! I have found that I love learning a new language and there is little stress involved in this class. The relaxed environment is a great way to balance out harder classes and an enjoyable way to learn a new language.","Take this course with Luca-- he is hilarious, passionate, has a lovely accent, and will be sure to bring you out of your comfort zone!","Luca is the best! He reall works to make sure you feel comfortable with the language!","Portuguese Ad is great! It is lots of fun and you learn a lot.","Max is a great TF.","Your experience depends A LOT on your TF. I loved my TF for AC and my TF for AD was a completely different experience.","Great class. Chill. You learn a lot.","One of the most fun classes I've taken at Harvard. The Portuguese Department and it's TF's are the best.","Awesome class. Useful language to have a grasp of. Assignments are fair.","This course is a blast and you truly walk away able to communicate in basic portuguese. If you have a remote interest in Brazil it's totally worth it. JUST DO IT!","it's a great class that goes at a good pace and the department is understanding if you get overwhelmed or need extra help","Though your experience depends a great deal on the teaching fellow, it seems that they range from \"pretty good\" to \"AMAZING!\" and this semester I luckily had an \"AMAZING!\" TF: Luca Prazeres. Get in his section if you canâ€”class flew by every day (though we were still learning!) and I am pretty sure this was my favorite language class I've ever taken thanks to him. I am very happy I took portuguese this yearâ€”do it!","They did not take as much advantage of our knowledge of Spanish as I had hoped.  We also didn't learn much more than the normal Ab class. I was hoping for more rigor.","Great, fun, easy class especially if you have enjoyed taking Spanish classes or any other intro language classes.","I really loved taking this course with Max. I was able to learn a lot of new verb forms in Portuguese and expand my knowledge of vocabulary. After this semester, I feel more comfortable with my Portuguese knowledge and highly recommend this course to anyone wishing to continue learning Portuguese after Portuguese Ac."]},"Spring '14":{"comments":["If you have Viviane, she will challenge you to learn. I think that every TF has his or hers pros and cons. Some focus of speaking Portuguese, others are grammar police. When taking this course, you should not only consider if the TF is right for you based on the time of the course, but also on what you see necessary for you to learn the language.","The course is very useful and fun but my positive experience was much due to having Stephen as my TF. I find that for these classes, your experience will be highly dependent on who your TF is, which may not necessarily end up that well for you.","This class is challenging, but will provide you with a solid instruction of Portuguese grammar.","This course is very interactive and fun. You make a lot of great friends because you get to see your classmates every day, and the professors are all very enthusiastic.","This is a class worth taking, although in order to advance with the language, students must put in additional time and effort on their own in preparing the material.","The Portuguese Department does a really good job of making sure that you get a strong foundation in the language. I definitely feel that I could travel to Brazil and be able to get around without a problem after taking this class.","The class was great. It was such a fun way to learn more Portuguese. It wasn't too easy but it wasn't too hard either; it was a very balanced class. The teaching was great too!!!","This is an awesome course, a lot of fun, and a great way to balance a schedule. You meet Monday through Thursday so I noticed that I actually got to know my classmates and form meaningful relationships with them, unlike every other class I've ever taken at Harvard. Also, Viviane is awesome. She's hilarious, super understanding, and just a great human being overall.","if you participate, go to office hours, do your homework and take this class seriously, you will see immense improvement in you command of the language and be successful!","This is a great class, and you learn a ton (especially with Viviane)! It's a bit more rigorous than people may be used to for language courses in the Romance Languages department, but I'd say it's worth it.","This class is so much fun. I learned a tremendous amount in one semester and was able to talk about real issues that affect portuguese speakers while learning to use the language. The mixture of language and culture made this class so fun.","This class is incredibly fun! However there are small assignments that add up and end up taking time.","This is a great continuation of Portuguese Ac, but it is not as easy. Ac comes naturally, especially for Spanish speakers, but you will have to put more work in for Ad because many of the moods\/tenses taught are not found in Spanish."]},"Spring '15":{"comments":["I enjoyed Ad much more than Ac. The class was better organized, I received more feedback on all assignments, and the workload was more reasonable. I hope to continue with Port C after this positive experience.","Not as helpful as Portuguese Ac","Definitely take! You learn a lot","If you already took first semester Portuguese, then Portuguese Ad will be much of the same except you go over future tenses. This class is really great I actually enjoyed it much more than the fall semester, I especially liked the novel we read for class. Definitely recommend for anyone coming out of Ac. GREAT course with great instructors. Portuguese is a fun language and here in Boston there are a ton of Portuguese speakers you can talk to as well. There was a new 1-hr a week skype session with college students from Brazil, this was fun but often cumbersome because it added an hour of classtime to the class.","The class is a journey of fun and learning. If you are passionate about learning Portuguese, this class will provide the tools to be able to hold a serious conversation with natives. Highly recommend, and Ben Legg is an excellent preceptor.","In Portuguese Ad, we work hard and play hard. In addition to learning grammar and vocabulary, you will have a chance to read a novel and watch several movies. There will be fun cultural events both inside and outside the classroom, and opportunities to speak with native speakers through Teletandem. It is fun and interesting, and you will learn a lot!","its fun, not too hard, and teaches you a lot","Portuguese is a fantastic language, and this course is great for those with a background in Spanish. That being said - this course is fairly jumbled, which creates a falsely laid-back environment that comes back to bite you when it's time to take a test.","The course is good although sometimes disorganized. Often the load of work is manageable, when not, you can always share it with the professor. Classes are dynamic.","Learning good portuguese is possible through AC and AD.","Do the reading and have fun. Also go to the extracurricular events put on by the apartment.","This course is tough, only take if you're committed to learning the language. It's not as easy as the first semester and is academically more rigorous. Unlike other foreign language classes, you're already reading books in Portuguese and analyzing them.","Portuguese is a great language to learn, and the department at Harvard is incredible. All the professors are really relaxed but also very good at teaching. You learn a lot without realizing you are - it's an incredibly painless learning experience, and I can't say that about any other course I've taken so far. Also, BenÃ© is the bomb.com!","Only take this if you really really REALLY know Spanish.","This course needs some work in its organization. I feel that I did most of my learning outside of the classroom on my own. I learned the most when I went to see professors during office hours, but class time seemed almost a waste. It was boring and repetitive most times, so I didn't always feel engaged with class activities. I think this class will improve, but I recommend it for a solid foundation of basic brazilian portuguese. Not an amazing class, but not difficult either.","This is an excellent continuation to Portuguese Ac. The course provides a variety of activities that fortify your learning experience. All of the teaching fellows are knowledgeable and willing to help."]},"Spring '16":{"comments":["After Portuguese AD I reckon I could get by pretty satisfactorily in a Lusophone country.","This class is amazing for Spanish speakers who want to learn Portuguese without having to labor through verb conjugations and the other boring aspects of language learning.  The TFs are all amazing and FUN people who really do care about students' learning.","Portuguese is a very underrated language.","great class, I improved my portuguese quickly. It is a lot of work though, so be prepared.","Take it! It has been one of my favorite classes at Harvard!","Wonderful course. You learn a lot in a short period of time and have fun. Alex is a great teacher.","Take it and start early! I wish I had started portuguese sooner.","Great introduction to Brazilian Portuguese. If you take it though, make sure BenÃ© is your TF! He really focuses on helping you learn the language versus fixating on grades and assignments. He's mainly interested in your personal growth & learning, and that approach to teaching is much needed (and so helpful especially with language learning).","More of a focus on grammar and social topics in Brazilian culture\/history. Great class to improve conversational skills and writing skills."]},"Spring '17":{"comments":["TAKE THIS CLASS! TAKE PORTUGUESE!!! This was one of the best decisions I made at Harvard! The two professors I have had the pleasure of meeting during fall and spring semester were not only incredible, caring, dedicated teachers but AMAZING people. Dr. Gontijo, the department head, is also excellent. This course is so well designed, so fun, and so worthwhile. I speak Portuguese very well after only two semesters and I understand nearly everything. They incorporate workshops and other fun activities into the course which is refreshing. One morning we even had fruit, homemade cake, and Samba lessons! This course literally made my mornings brighter, even on Cambridge's gloomiest days. Take the 9 AM section - it is always smaller and offers more speaking time.","In general the whole Portuguese department is great and learning the language is a blast. Portuguese for Spanish Speakers is the best because everyone in the class is similarly struggling with Spanish coming in the way. This class makes you read CapitÃ£es da Areia and that is a really interesting book! You also learn about many different issues affecting Brazil today. I would highly recommend it.","Pretty good course overall. Sometimes a lot of busy work.","The work isn't always evenly spread out. It's not undoable but is annoying at times."]}},"mostRecentQ":{"overall":"4.50","workload":"4.50","difficulty":null,"recommendation":"4.50","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"PORTUG Ad","course_id":"4444","cat_num":"1315","1s":"2","2s":"2","3s":"12","4s":"5","5s":"1"},"QWorkload":{"number":"PORTUG AD","course_id":"4444","cat_num":"110641","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}},"success":true}