{"scores":{"Spring '17":{"course_score":{"overall":"4.20","workload":"5.10","difficulty":null,"recommendation":"4.40","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.30","workload":"4.50","difficulty":null,"recommendation":"4.30","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Spring '15":{"course_score":{"overall":"4.60","workload":"9.20","difficulty":null,"recommendation":"4.50","enrollment":"11","response rate":"72.73","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.70","workload":"3.30","difficulty":"3.30","recommendation":"4.30","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.20","workload":"3.20","difficulty":"2.80","recommendation":"4.20","enrollment":"4","response rate":"100.00","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.40","workload":"2.00","difficulty":"2.80","recommendation":"4.40","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.00","workload":"2.75","difficulty":"3.00","recommendation":"3.50","enrollment":"6","response rate":"66.67","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"4.73","workload":"3.09","difficulty":"3.45","recommendation":"4.64","enrollment":"14","response rate":"78.57","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.50","workload":"3.12","difficulty":"2.88","recommendation":"4.25","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '11":{"comments":["Although I cannot compare to a full year of Italian at Harvard, I cannot claim to possess after one semester the equivalent of a full year of Italian study.  You must keep up with the work and study on your own; if you want to get a lot out of the course, you must do this in addition to the copious homework material. All things considered, it's probably one of the better ways to learn Italian. Classes are enjoyable and, unlike many other courses, can give you the sense that you are learning in class and not simply at home.","I can't imagine a better introduction, so long as one is motivated and has some resources to supplement class materials on one's own. It was fun, relatively painless (except for social awkwardness during some creative exercises), and a great start. From day one, the teacher is speaking Italian, and it is a thrill to be able to follow along, even imperfectly.","Awesome course, you have to take it! This course is definitely doable, the only thing is most of the class knew the basic grammar of one or more Romance Languages beforehand and the speed that we move through the material with requires that you know at least a little bit of grammar before coming in.","This class was a fun class where you learn a lot quickly. Class does move fast and there is a significant amount of work involved but for the most part everything is geared towards improving language skills in Italian.","Its a lot of work, but if you already know a romance language and want to quickly get a functional reading knowledge of Italian and basic communication skills, its a good class.","This class is great if you want to get a feel for Italian in a very short amount of time, but it is pretty labor-intensive just in terms of workbook assignments every night.  That said, the amount of work assigned makes it pretty difficult not to become familiar with the grammar so it's beneficial even as it might feel annoying.  Also, in-class discussions are really fun because they end up being pretty comical and it's a really relaxed environment for just trying to absorb and get a feel for the language."]},"Spring '12":{"comments":["Be prepared to put in the time","This is an excellent course for anyone who has the time to throw themselves into Italian. The book is excellent, and it is definitely as difficult as it is entertaining. We listed to at least one song every day, and our classes favorite phrase is \"come si dice\" or \"how do you say...\" We've learned so many useful words this way (ex. the Italian verb for flirt is flirtare!)","A lot of attention is paid to grammar, so that might be difficult for students who have grown up speaking another language and have not been exposed to learning grammar. The class is a great experience overall. Students in the class got close with each other. Also, your italian improves tremendously.","This class was by far my favorite of the semester.  The class progresses at a quick, but gradual pace so that I found my Italian skills growing immediately.","SO GOOD! BEST CLASS IN THE WORLD","I took this class to fill 2 elective spaces in my senior spring. It was a lot of busy work, but not too difficult. Plus, I learned how to speak a new language! Pretty cool","Take it! You'll learn basic Italian, and the process will be as fun as it sounds! People who want to learn Italian are generally very cool and fun-loving people, and you'll get to see them every day and form a little Italian family! Dalila won't be teaching it next year, which is sad, but if you commit to the class, you'll likely have a great experience no matter what. The details of the course aren't ideal (poorly conceived exams, lots of busy work homework, mediocre textbook) but this will not matter to you one iota when you eagerly get up every morning to attend the combination uproarious comedy spectacle and intensely satisfying learning experience that is Italian Acd. Take it, take it, take it. (Tip: It's basically like 1 class, 1.5 at most, if you already know Spanish or French well.)"]},"Fall '12":{"comments":["It's a wonderful course but it requires a lot of work, so be prepared for that.","Take this class if you have a solid understanding of another romance language and really want to learn Italian. It is a lot of work and will occupy a lot of your time. Try as hard as you can to not save your homework until the last minute.","This class is useful only for a specific type of student. If you believe yourself to be that type of student who would really benefit from taking this class, then take it. If not, don't.","The workbook presents a lot of busy work (out of 4-5 hours a week on the workbook, only around 2 of those are valuable, you just kind of zombie through the other 3). That said, it does count for two classes, so the time it demands is appropriate to two classes. The teacher is great, she provides plenty of feedback and really tries to make everyone feel comfortable with the class- she helps out if someone is behind and is very approachable regarding questions and suggestions."]},"Spring '13":{"comments":["If your goal is speaking then this can be a very good course for you, esp. if Sarah Axelrod is the TF; if you're mainly focused on reading then you should probably take the \"Reading Italian\" course instead","This class is very intensive, do not be fooled. It moves very fast and does take a lot of work. I would have probably learned more if I had taken two semesters instead of Acd which combines Italian Aa and Ab into one semester. However, the class was so much fun and one of the highlights of my semester.","If you're willing to put the time into this class, you will be highly rewarded. This class was a joy to take from beginning to end, and a jewel of Harvard University.","It's so much fun, but definitely a lot of work! The pace is super quick, so keep that in mind when signing up for this class. You do learn a ton of material in a short amount of time, but it can be hard to keep up with. Favorite memories were going to the North End twice instead of holding a regular section."]},"Fall '13":{"comments":["It will take a bit of time given that it compacts two semesters into one, but this course will have you speaking Italian in one semester, no joke! It's a lot of fun (if romance languages are your thing), and you can get one on one teaching given that the intensive classes are usually very small.","Interesting course; can be work intensive but overall, very fulfilling.","I felt fluent by the end of the semester! Take this class; it's one of the best I've taken at Harvard. You have to be prepared to put in time and effort (it is intensive, after all), but it's not difficult. It feels great to learn a language in such a short period of time."]},"Spring '14":{"comments":["It really is two credits worth of work.","Don't be intimidated by the fact that the course is accelerated. There's a lot of work, but you'll get so much out of the course."]},"Spring '15":{"comments":["If you already know one Romance language and want to learn Italian quickly, this is the way to go.","This class can make you proficient enough in Italian to travel to Italy.","It is definitely worthwhile to take an Italian class with an Italian. Dalila explains the grammar very well and clearly.","If you have no knowledge of Italian or a fair amount of knowledge and just want to reinforce grammar, then take this course. Also, if you want to learn a language super quickly, then take this course since it's two semesters in one.","This class is a great intro to Italian if you know another Romance language and want to learn it fast. The course covers a lot of material in a short amount of time, so be ready to work. I found it most difficult just to keep all the grammar straight after learning it, since we don't spend time on any one grammar element to solidify it in our brains before moving on to the next one. Dalila is fabulous.","This course has too much work. You have to do the equivalent of EVERY exercise in the workbook as opposed to a selection, which is what every other language department asks of you. Because the number of exercises is so high, it makes learning vocabulary difficult.\r\nThis course will give a really grounding in Italian, but be careful what else you take with it and what extracurriculars you do with it. I.e. don't take 3 or 4 other classes and do a ton of theater etc. \r\nAlso Italian department in general is just very intense. That's not a bad thing but I think it's good to be prepared for it, because I caught off guard.","This course is difficult, but so worth it!"]},"Spring '16":{"comments":["It is a great course for learning the the basics of the language in a very short time. However, it really is very fast-paced. The teacher can't cover all of the course material (in depth) in class, so you should take responsibility for your own learning outside of class.","Italian ACD counts as 8 credits, but the homework is not twice as much as a regular class, from what I could see. It was very enjoyable and I liked the pace. I would definitely recommend.","I love the class. The everyday schedule is necessary for properly teaching you the language. Giorgia is engaged and active with students and the assignments are all very productive."]},"Spring '17":{"comments":["Prof. Lieberman is a legend.","To all students looking at this in the q-score: you're here because you're interested in entering a new world and learning a language. If this is the case, you will discover Italy with a better perspective in this class. This class has given me a better understanding of the culture, history, and politics of Italy as well as an introduction to literary works, such as Andreuccio. It's really quite nice introduction to the language. Highly recommend!","I really enjoyed taking Ital 15. If you're willing to commit, you can learn so much in one semester. I was pleasantly surprised when I began to understand Italian songs and slow news podcasts in Italian.","Italian 15 goes by really quickly but Peter is super chill and this is probably the most fun class I've had at Harvard so far. There's not that much work at all and even though you speed through the concepts quickly, as long as you learn\/review a little bit outside of class you'll be fine.","This class is a great way to  quickly get a foundation in Italian if you take it seriously. My only reservation would be if Lieberman is still teaching it"]}},"mostRecentQ":{"overall":"4.20","workload":"5.10","difficulty":null,"recommendation":"4.40","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ITAL Acd","course_id":"4417","cat_num":"3065","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"ITAL ACD","course_id":"4417","cat_num":"112340","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}},"success":true}