{"scores":{"Fall '15":{"course_score":{"overall":"4.40","workload":"3.10","difficulty":null,"recommendation":"4.40","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"3.80","workload":"2.30","difficulty":null,"recommendation":"3.60","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.45","workload":"1.45","difficulty":"2.36","recommendation":"4.64","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"4.46","workload":"1.46","difficulty":"2.31","recommendation":"4.69","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.25","workload":"1.50","difficulty":"2.33","recommendation":"4.50","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfd","cat_num":"3437","course_id":"3908","year":"2011","term":"1","id":"202d8c48b23dc38f395b4a072d8cf530","first":"Ryan Wesley","last":"Draft","InstructorOverall":"4.43","EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":"4.33","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '11":{"course_score":{"overall":"4.77","workload":"2.46","difficulty":"3.38","recommendation":"4.77","enrollment":"17","response rate":"76.47","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"4.67","workload":"2.40","difficulty":"3.27","recommendation":"4.87","enrollment":"16","response rate":"93.75","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}}},"Spring '10":{"course_score":{"overall":"4.62","workload":"2.56","difficulty":"3.38","recommendation":"4.62","enrollment":"20","response rate":"80.00","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfd","cat_num":"3437","course_id":"3908","year":"2009","term":"2","id":"81b8f9299cb036f009e493237d425ff6","first":"James","last":"Quattrochi","InstructorOverall":"4.69","EffectiveLecturesorPresentations":"4.53","AccessibleOutsideClass":"3.77","GeneratesEnthusiasm":"4.75","FacilitatesDiscussionEncouragesParticipation":"4.73","GivesUsefulFeedback":"3.71","ReturnsAssignmentsinTimelyFashion":"3.93"}]},"Fall '09":{"course_score":{"overall":"4.56","workload":"2.28","difficulty":"3.00","recommendation":"4.78","enrollment":"22","response rate":"81.82","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfd","cat_num":"3437","course_id":"3908","year":"2009","term":"1","id":"81b8f9299cb036f009e493237d425ff6","first":"James","last":"Quattrochi","InstructorOverall":"4.61","EffectiveLecturesorPresentations":"4.47","AccessibleOutsideClass":"4.08","GeneratesEnthusiasm":"4.61","FacilitatesDiscussionEncouragesParticipation":"4.65","GivesUsefulFeedback":"3.87","ReturnsAssignmentsinTimelyFashion":"4.06"}]},"Spring '09":{"course_score":{"overall":"4.86","workload":"2.43","difficulty":"3.14","recommendation":"4.86","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfd","cat_num":"3437","course_id":"3908","year":"2008","term":"2","id":"81b8f9299cb036f009e493237d425ff6","first":"James","last":"Quattrochi","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.86","AccessibleOutsideClass":"4.29","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Fall '08":{"course_score":{"overall":"4.83","workload":"2.17","difficulty":"3.17","recommendation":"4.50","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfd","cat_num":"3437","course_id":"3908","year":"2008","term":"1","id":"81b8f9299cb036f009e493237d425ff6","first":"James","last":"Quattrochi","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.67","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"3.67","ReturnsAssignmentsinTimelyFashion":"4.33"}]}},"comments":{"Fall '08":{"comments":["You learn so much in just one case. You learn in a total different way than just being taught the material. You actually get to investigate, ask questions, interact, and truly get the feel of science, medicine, and diagnosis.","This is the best neurobiology tutorial out there","its hard but definitely worth it"]},"Spring '09":{"comments":["Be prepared to put A LOT of time into this class, but expect to have learned a lot by the end.","JQ is the best teacher you will have at Harvard","This class was one of my favorite here at Harvard. I definitely would recommend this class to any student with a passion for medicine and science. I have definitely learned more in this class than any strict requirement class. It has been challenging, but in different ways than concrete classes. You have to work in a group, write novel case syntheses, and work hard but on your own schedule.","This is undoubtly the greatest class I've taken at Harvard.  You learn so much, but the didatic style is such that you learn it because you are so engaged with the material not because you are working to memorize it."]},"Fall '09":{"comments":["This is not a course well-designed for undergraduates.  It forces you to waste time looking for information in the wrong places rather than giving you facts and then asking you to do interesting synthesis with them.  I find the subjects we cover are blurred by incorrect information give by students over the course of the semester.","The free-flow feeling of the seminar generates great enthusiasm for the material and makes discussions last even longer than the allotted hour and a half class.","So much fun and a great community.","Learning from textbooks and tests is one thing, but learning about systems when you are having to explain the science behind the condition to a patient is experiencing it is something completely different.  You will learn so much about the nervous system, it is unbelievable.","This tutorial gives students the opportunity to learn collectively and apply the knowledge they learn to real cases.","Amazing course! JQ is a great instructor and really encourages your development as a contributing member to the scientific community. You'll learn so much and wonder how it's possible, since the class itself is only 2 hours a week.","Definitely one of the best classes I have taken at Harvard, and it has definitely increased my appreciation and love for neurobiology (this class makes me very, very happy that I decided to concentrate in neuro).\r\n\r\nEven though this class is a half-course only, don't let it fall to the wayside even as other courses and extracurricular commitments pile up near the end of the semester.\r\n\r\nThis course will give anybody with pre-med plans a definite advantage in the clinic, as it really just changes the way you approach clinical cases (for the better).","A really, really unique course; you truly won't find another one like it at Harvard.  The class feels a bit like an episode of House, but with more science and less dry humor.  You'll be amazed at what you can learn in such a short period of time.  This is probably the most independent, and information-rich class I've ever taken.  And it's great for that reason.","The workload depends upon how much effort you put into it.  You can realistically spend anywhere from 2-15 hours in a week on ICON depending upon how involved you want to be.  The case study format is amazing and you learn a lot.  This course has more work than any other neurobiology tutorial.","Take it, you won't regret it. How much you learn is directly proportional to how much work you put in it.","If you put effort into thinking about new approaches to the case you'll learn a lot more and get much more from the case with new concepts understood."]},"Spring '10":{"comments":["Really fantastic. JQ is an incredible human being and so, so knowledgeable. This will be the most unique class you ever take at Harvard. It teaches you to think differently about science and medicine and people, and it was really interesting to think about hard questions regarding those subjects.","This is a great course that provides a different perspective for learning- it helps develop a method of problem solving just as much as it introduces neurobio information.  Students learn by trying to solve neurological cases, so the course is ideal for anyone seriously considering becoming a doctor.  Although the course is fairly laid back, there is a lot of reading to keep up (but the reading is really fun once you get into the cases).  If you're not willing to put in the work keep up with the cases, then please don't take the class.  You'll ruin the experience for others by being a terrible team member.  There were several dead weights in one section who didn't contribute much at all, and they will probably complain about the workload that they didn't really do.\r\n\r\nIn terms of workload:\r\n-1 page single-spaced case syntheses are due a the end of each case, which last 3-4 weeks\r\n-The real work comes in keeping up with cases during the week, and contributing to our on-line discussions.  Some people spent several hours each week researching and reading course materials as well as posting online.  Others didn't do anything except the syntheses and glancing at the group discussions before class.","this class will challenge the way you think about medicine and biology in general. so awesome!","ICON is a great course for any neurobiology or pre-medical students, it is basically House the class.  But definitely be prepared to put in the work for it.","If you are at all interested in neurobiology in the future - either as a doctor or a researcher, TAKE THIS CLASS.  It was an incredible culmination of all of the knowledge I had gotten from previous neuro\/lifesci courses - I was finally given the autonomy to be in charge of my own learning.  I seriously believe that we have advanced the field of science through this course.  If I could, I would take ICON forever.  Best class at Harvard.","Don't take this class if you're not willing to put in a lot of time, but the payoff is great","This course will make you think in a different, unique way. It was my favorite course at Harvard!","Don't be fooled that the class is labeled as a half-class; the workload can definitely reach that of a full class as times.  However, you should still absolutely take this class as it teaches you a totally different way of approaching a neurological problem than the standard clinical approach.  The class covers a whole diverse range of neurological systems (a definite plus!) and you get to apply the information you learned to case study subjects.  The knowledge you learn is very practical.\r\n\r\nSince most of the learning is done and directed by the students working as a team in this class, this is an obvious case of the more you put in, the more you get out of the class.\r\n\r\nThis class is also great because a lot of the time, you not only look at the biological problems in the patient, but you also look at the more practical issues surrounding the health care system, the patient\/doctor relationship, etc.","ICON is a class like no other you will ever take as a Harvard undergraduate.  Imagine playing House MD with real patients in real time with a team of fellow students under the guidance of a Harvard med school professor.  Phenomenal!  This is where the rubber meets the road: turning academic theory into real world practice.","You're responsible for yourself in this course. The course guarantees that you will learn as much as you want to learn and more.","Great concept, but as long as it only counts for tutorial credit it's not worth the workload.\r\n\r\nWould only recommend if you're set on med school, since you can take a far easier tutorial if you're not pre-med.","Understand that this course is difficult to predict how much work it will require and how much effort you need to invest, but that it is worthwhile when you can pour yourself into it."]},"Fall '10":{"comments":["It's a class like you've never seen before.  You aren't given assignments but must figure out what you need to know and learn to make the case progress.  It's very overwhelming at first, but it starts to get better.  A lot of fun - highly recommended.","This class is quite time consuming, but truly unique and a great experience! One of the best classes I've taken at Harvard!","It's excellent. You will get as much out of this course as you put in, so be prepared to work, but it's incredibly rewarding. It's as close to House MD as you can get in academia and it's awesome.","This is an interesting class structure. You will be learning with the cases rather than blindly guessing at how the cases are -- the cases seem to be predetermined so it's not actually being on the brink of solving a really important case. Nevertheless, it's good to see how what is learned about the brain is actually applicable.","This is an awesome class that teaches you how to think like a medical professional and be an effective team player. The neurological cases we discuss are unique and interesting.","Wicked awesome. enough said.","This class is one of the best that I have taken thus far. If you are interested in medicine, case solving, or real-life applications of neurobiology than this is the perfect course.","It's a fantastic class, I've learned so much more about neurobio through this tutorial.","really cool!","Probably one of the top 3 classes you can take here at Harvard. The case based approach to study is astonishingly effective and the courses structure will bring out the best in you. Definite winner","This class is really a one-of-a-kind learning experience that covers a broad spectrum of topics in neuroscience in a unique way. It can be time consuming, especially for a tutorial, but it is worth the effort!","You will not take another class like this at harvard.  Within each case, you can explore what you specifically are interested; even the case synthesis focuses on your individual interests.  Usually in classes you'll have one unit on the nervous system, followed by one on the circulatory, etc - in this class it all comes together.  Furthermore, you have to piece it together as a team - the teacher doesn't tell you how all the scientific concepts fit together.  That said, JQ is excellent at leading the discussion, and is extremely accessible outside of class.","A challenging and exciting course that brings you closer to your fellow students. Professor Quattrochi is brilliant and a great discussion leader. The method of learning is novel but the most fun and effective I've experienced here at Harvard. If you like problem solving and thinking critically, take this class."]},"Spring '11":{"comments":["This was the BEST course I have EVER taken at Harvard. There should be more classes like ICON.  Finally - someone has realized that you don't need weekly assigned readings from a textbook and clicker questions in order for students to learn.","One of the coolest classes in the life sciences (that I know of). The course structure is very unusual (and fun) - concepts are learned through the framework of trying to solve a specific problem. The format requires a lot of individual initiative and can be challenging but is very rewarding; the more you put into it, the more you'll get out. If you like problem-solving, this will be a wonderful class for you. Plus, Professor Quattrochi is brilliant.","This class taught me more about neurobiology than any other neurobiology class I've taken so far. The hands-on approach to learning makes the class really rewarding, and enabled me to really understand all of the material we covered in the class.","This was one of my favorite courses at Harvard. Not only was it fun and exciting but my knowledge of Neurobiology increased tremendously. I felt as though this class gave me a good idea of what it will be like to solve medical cases in the future as a doctor.","This class is a LOT of work for a half class. I definitely put in as many hours for it as for some of my other classes. I don't know if it's worth it. keep that in mind.","This class is one of the most engaging classes I've ever taken. Each case we studied in ICON fascinated me and I would research the case constantly. However - the class is nothing if you cannot dedicate your time and attention to it. Per semester, this class counts as a half-course, but it is more than a half-course's work. Of course, you can probably get by just with a minimal amount of work, but then there's no point to taking a class that you're missing out on.","It is a great tutorial that teaches you a lot about neurobiology in a unique practical way.","This class is probably the most interesting and engaging of the Neuro tutorials - however, it is also considerably more time-intensive, so I would not take it on top of an already heavy workload. You will get less out of the class...that's what happened to me and I wish I had been able to spend more time on it!","A course like you've never taken - you actually need to learn the material and figure it out.  But once you get over the initial struggle, you'll get so much out of this class - I definitely learned the most from this one class than any other this semester.  It's a lot of fun and very worthwhile if you put in the time."]},"Fall '11":{"comments":["The course provides a molecular-based view of diseases\/disorders such as Alzheimer's and schizophrenia, and is interesting for anyone passionate about cell biology and neuroscience. This is the first year the course is being offered, so organization could be improved, but overall Cat is a great facilitator.","Dr. Dubreil is an extremely enthusiastic and friendly person. I know this class was in its first year, so there were things that could be improved, such as the structure\/organization of the class, but overall it was an easy, painless, and enjoyable experience. As a side note, if you aren't interested in the extremely nitty-gritty parts of novel therapeutics, this class isn't for you. All the paper are extremely technical and though the class was painless on average, the papers were very boring to read.","This is a wonderful class, and I'm glad I chose to take it. It's not very work-intensive, but it still made me learn a lot, and I enjoy the class.","You learn a lot about things that you never really take the time to sit down and think about, and it really changes your perspective on a lot of conditions and the way they are approached.","I have learned so much!"]},"Spring '12":{"comments":["This tutorial is great if you're interested in basic science research and how it might apply to new therapeutics in the pipeline for some major neurodegenerative disorders. Cat is great!","This is a great class. Catherine did a great job covering major diseases that affect the CNS. Class discussions were always interesting, and I learned a lot about diseases and drug development.","An interesting class that will stretch your abilities to understand scientific jargon...although not terribly exciting on a day to day basis, ended up being a good class.","Of all the tutorial topics, this one jumped off the page for me, and Catherine is full of energy, a great teacher, and very approachable. You'll definitely have a ton of fun!","Great class! Cat is amazing and has a lot of passion for Neurobiology and therapeutics. You'll learn so much and build great relationships with everyone in the course.","I would definitely recommend this class if you're interested in CNS disorders and therapeutics! The course gives a great introduction to several CNS disorders and novel therapeutics, and I thought the course helped give a fresh perspective on CNS therapeutics by challenging us to think outside of the box for our novel therapeutic papers.","Dr. Dubreuil is awesome. She's super nice, friendly, chill, and knowledgeable about things. The material is interesting, but it can be overwhelming if you don't have a solid background in MCB\/biology. You don't have to have a background, but I think to really get something out of this, you need an MCB\/bio background."]},"Fall '12":{"comments":["A pretty relaxed class covering some pretty interesting topics in neurobiology. I'm not crazy about the class, and to be honest it's not quite as exciting as I expected it to be, but I think it's really interesting and great practice to be reading primary articles every week. Learning about and thinking about the way drugs are developed was also really interesting and not as sophisticated as I had imagined it to be.","This class is very interesting, encourages you to combine biology with critical thinking to consider novel therapeutics, and is not too much work.  The professor is great and the papers are interesting.","This course is incredibly interesting and relevant to the most up to date research in neuro-related diseases and disorders. I'm really glad to have taken this course.","It is a very chill environment without too much work. Make sure you are interested in reading about neurological disorders and clinical trials.","This is easily the most relevant biology course I've ever taken. After years of intro classes, I feel plugged into where life sciences are moving, and it's very exciting.","This class is amazing! The subject matter is very current and interesting! Catharine is a great professor who is always willing to adapt the class to what we were interested in! There is very minimal work because it focuses more on learning and discussion than grades!","love the subject; very pertinent and neccessary discussions to world of neuroscience and neurobiology today"]},"Fall '14":{"comments":["Class is really informal,which is nice. Catherine knows the material really well, so she can explain a lot of the new ideas that are out there.","Catherine is great - very engaging and knows what she's talking about. This is a great option for your tutorial.","There's more writing than I had expected, but it's an interesting class!","Not useful at all, hoping to get a more in-depth view of CNS and diseases but walked out of the semester with virtually no gain in knowledge."]},"Fall '15":{"comments":["Very cool class, too bad it's the last time it's being taught.","Relaxed and informal class! Catherine is extremely knowledgable in the material which makes for interesting discussions. Good option for your tutorial.","The course covers interesting material but does not facilitate discussion, often with just Catherine or one student presenting about the topic.","This class is so chill yet you learn so much! It provided a fantastic, not overly competitive atmosphere for us to enjoy learning for what it is.","So interesting! Very relevant. Take if you do research\/are premed."]}},"mostRecentQ":{"overall":"4.40","workload":"3.10","difficulty":null,"recommendation":"4.40","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"0","2s":"0","3s":"1","4s":"2","5s":"4"},"QDifficulty":{"number":"NEUROBIO 95hfd","course_id":"3908","cat_num":"3437","1s":"2","2s":"3","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101A","course_id":"3908","cat_num":"113003","1s":"2","2s":"5","3s":"0","4s":"0","5s":"0"}},"success":true}