{"scores":{"Fall '09":{"course_score":{"overall":"2.64","workload":"2.67","difficulty":"2.65","recommendation":"3.16","enrollment":"64","response rate":"89.06","QCourseOverall":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"8","2s":"16","3s":"24","4s":"4","5s":"4"},"QDifficulty":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"12","3s":"17","4s":"12","5s":"1"},"QWorkload":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"15","3s":"18","4s":"7","5s":"5"}},"instructor_scores":[{"number":"GOV 99r","cat_num":"3652","course_id":"2194","year":"2009","term":"1","id":"707cad502af55832db541f2f9fb46eb1","first":"Cheryl B.","last":"Welch","InstructorOverall":"3.36","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"3.78","GeneratesEnthusiasm":"3.67","FacilitatesDiscussionEncouragesParticipation":"4.17","GivesUsefulFeedback":"4.25","ReturnsAssignmentsinTimelyFashion":"4.25"},{"number":"GOV 99r","cat_num":"3652","course_id":"2194","year":"2009","term":"1","id":"d3c6e75f3acee2b558fcf8133a5b0e85","first":"Joseph Stanley","last":"Kochanek","InstructorOverall":"3.46","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"3.87","GeneratesEnthusiasm":"4.12","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.33"}]},"Fall '08":{"course_score":{"overall":"2.85","workload":"2.27","difficulty":"2.38","recommendation":"3.00","enrollment":"57","response rate":"54.39","QCourseOverall":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"8","2s":"16","3s":"24","4s":"4","5s":"4"},"QDifficulty":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"12","3s":"17","4s":"12","5s":"1"},"QWorkload":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"15","3s":"18","4s":"7","5s":"5"}}},"Spring '08":{"course_score":{"overall":"2.58","workload":"2.85","difficulty":"2.46","recommendation":"2.88","enrollment":"59","response rate":"45.76","QCourseOverall":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"8","2s":"16","3s":"24","4s":"4","5s":"4"},"QDifficulty":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"12","3s":"17","4s":"12","5s":"1"},"QWorkload":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"15","3s":"18","4s":"7","5s":"5"}}},"Fall '07":{"course_score":{"overall":"3.06","workload":"2.06","difficulty":"2.30","recommendation":"3.14","enrollment":"70","response rate":"47.14","QCourseOverall":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"8","2s":"16","3s":"24","4s":"4","5s":"4"},"QDifficulty":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"12","3s":"17","4s":"12","5s":"1"},"QWorkload":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"15","3s":"18","4s":"7","5s":"5"}},"instructor_scores":[{"number":"GOV 99r","cat_num":"3652","course_id":"2194","year":"2007","term":"1","id":"c1e9ffa46ec3d5e5fce6129d8ae4b4c1","first":"Timothy J","last":"Colton","InstructorOverall":"3.31","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"3.83","GeneratesEnthusiasm":"3.83","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.33"}]},"Fall '06":{"course_score":{"overall":"3.15","workload":"2.10","difficulty":"2.81","recommendation":"3.38","enrollment":"87","response rate":"43.68","QCourseOverall":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"8","2s":"16","3s":"24","4s":"4","5s":"4"},"QDifficulty":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"12","3s":"17","4s":"12","5s":"1"},"QWorkload":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"15","3s":"18","4s":"7","5s":"5"}}}},"comments":{"Fall '07":{"comments":["If you want to write a thesis, you literally *must* take this class. If you don't want to write a thesis, you literally *can't*.","If you are planning to write a thesis, really make time for it.  However, this class is helpful for making sure that you at least think about your thesis for one hour a week.","While I think a thesis is imperative for every Harvard student who has any sort of intellectual curiosity, the tutorial component is not conducive to the process.","It's a thesis.  Know that going into it.","Long discussion about thesis commitment.","Make sure you're really excited about your thesis topic before you sign up for 99r!","Write a thesis. Just don't depend on the tutorial aspect to help you.","The department should finally listen to thesis writers and do something to change this course and make it more useful.  Major changes are necessary.","Only if you are writing a thesis (!!!) and have patience.","Umm....only take this if you're writing a thesis.....","The problem is that the course is necessary to write a thesis. I love my thesis, but the course sucks. It also makes no sense, because part of the objective of junior gov seminars is to begin preparing you to research, and write theses. So, this is pointless.","It was not that helpful in my thesis work.  Though classes were mandatory...so thesis students won't have much of a choice about this course.","Not really any choice. Must be done for all students wishing to write a thesis.","There's not really a point to it, but you have to go anyway to pass the class. Sorry kids.","you have to take it."]},"Spring '08":{"comments":["writing a thesis is very fulfilling producing your own body of research is awesome","It is a necessary evil on the road to writing a thesis","Writing a thesis was a great decision for me, as much as at times I may say otherwise. The workshop was not helpful in that. My adviser was really the key, as was the work I put in. Given that we all had different processes, I did not find the workshop format helpful. However, office hours are always a good thing, especially on a project of such magnitude.","I wish we would have class less often, especially during first semester. Honestly, I thought it was a waste of time.","Only if you have a good section leader will the class be helpful since there was no structure to it at all","Unfortunately, this course is compulsory if you want to write a thesis.","thesis writing was one of the most rewarding experiences of my life. sitting through all these seminars, however, was not. that was time that could have been better spent elsewhere.","It is a good resource but not incredibly useful.","Well, this course is mandatory for thesis writers, but in terms of actually writing your thesis I feel like this course could be made much more useful through smaller sections and a stronger focus on methodology.","The course sucks, but you have to take it in order to write a thesis.","Ask questions about aspects of the thesis process that you are unfamiliar with early on. It may be useful to try to meet individually with your section leader to go over your own particular issues.","must be an able time-manager and self-starting worker","Be prepared to work hard on your thesis.","The thesis writing was the most enjoyable experience in the government department for me. But I loved my topic, and found that as key to a good experience.","Do not write a thesis for the honors but it ended up being a rewarding experience for me and for most of my friends.","... not quite applicable"]},"Fall '09":{"comments":["Good for the purpose of getting thesis work done- otherwise it doesn't do much.","There is no feedback on work.","Have a good idea of what your thesis will be.  Don't expect this class to particularly be of much help.","Though I'd give this course extremely high praise, it's only because of my TF. I've heard that other sections have TFs who are not as good. Someone even told me that in one section, students submit their thesis work only two hours before the class meets each week! That sounds to me like an enormous waste of the participants' time, and people in that section have confirmed to me that it is. The beauty of this class is that it gives you the opportunity to have your work read by other people, and if that doesn't happen, you're going to be in for a rough semester.","This course in itself is not very useful...most of the feedback received on thesis work is from the advisor. The seminar is useful in that it forces to meet deadlines and keep moving along with work but not as a tool to improve the substance of one's thesis.","It is a required course for thesis writers. i'm glad that the government department offers\/requires this course for senior thesis writers because it helps to have deadlines and to meet other thesis writers who are going through the same confusing\/stressful process as you.  I just think improvements could be made in terms of how the course is structured (workshops instead of classes; more TF review of your work instead of peer review)","You have to take it if you're writing a thesis...it will be a waste of your time.","the tutorial is not representative of the amount of time you should spend working on your thesis and it does not prepare you much for it either","Very helpful in process of writing thesis.","not all that helpful\/necessary in the thesis-writing process","If you are a thesis writer, the worth of Gov 99 depends entirely on your existing relationship with your adviser and the strength of your peer review group.","Writing a thesis is fun. Really!","It's pretty useless","You have to take it","I would recommend writing a thesis. I think the weekly sections should be abolished.","Well it's necessary to write a thesis, so you don't really have a choice. It's pretty painless though.","Well, if you're writing a thesis, it's not so bad.","It's necessary to take this course when writing a thesis, so I definitely do recommend it to anyone who wants to write a thesis.  It's not an awful course, there's just many ways in which it could be improved to help thesis writers to a greater degree."]}},"mostRecentQ":{"overall":"2.64","workload":"2.67","difficulty":"2.65","recommendation":"3.16","enrollment":"64","response rate":"89.06","QCourseOverall":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"8","2s":"16","3s":"24","4s":"4","5s":"4"},"QDifficulty":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"12","3s":"17","4s":"12","5s":"1"},"QWorkload":{"number":"GOV 99r","course_id":"2194","cat_num":"3652","1s":"10","2s":"15","3s":"18","4s":"7","5s":"5"}},"success":true}