{"scores":{"Fall '15":{"course_score":{"overall":"4.70","workload":"6.30","difficulty":null,"recommendation":"4.60","enrollment":"44","response rate":"84.09","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}}},"Fall '14":{"course_score":{"overall":"4.70","workload":"7.00","difficulty":null,"recommendation":"4.50","enrollment":"46","response rate":"80.43","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHNSE 120a","cat_num":"4283","course_id":"762","year":"2014","term":"1","id":"11da8e198d5d8b45228c18bd75af1283","first":" Jie","last":"Ying","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Fall '13":{"course_score":{"overall":"4.50","workload":"2.80","difficulty":"3.70","recommendation":"4.40","enrollment":"62","response rate":"91.94","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHNSE 120a","cat_num":"4283","course_id":"762","year":"2013","term":"1","id":"cf5239e004ff68f8f0a023f66e201961","first":" Xuedong","last":"Wang","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Fall '12":{"course_score":{"overall":"4.67","workload":"2.95","difficulty":"3.55","recommendation":"4.50","enrollment":"60","response rate":"95.00","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHNSE 120a","cat_num":"4283","course_id":"762","year":"2012","term":"1","id":"cf5239e004ff68f8f0a023f66e201961","first":"Xuedong","last":"Wang","InstructorOverall":"4.84","EffectiveLecturesorPresentations":"4.89","AccessibleOutsideClass":"4.53","GeneratesEnthusiasm":"4.84","FacilitatesDiscussionEncouragesParticipation":"4.78","GivesUsefulFeedback":"4.43","ReturnsAssignmentsinTimelyFashion":"4.84"}]},"Fall '11":{"course_score":{"overall":"4.63","workload":"2.95","difficulty":"3.53","recommendation":"4.56","enrollment":"44","response rate":"97.73","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHNSE 120a","cat_num":"4283","course_id":"762","year":"2011","term":"1","id":"cf5239e004ff68f8f0a023f66e201961","first":"Xuedong","last":"Wang","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.84","AccessibleOutsideClass":"4.74","GeneratesEnthusiasm":"4.74","FacilitatesDiscussionEncouragesParticipation":"4.77","GivesUsefulFeedback":"4.53","ReturnsAssignmentsinTimelyFashion":"4.92"}]},"Fall '10":{"course_score":{"overall":"4.53","workload":"3.22","difficulty":"3.36","recommendation":"4.66","enrollment":"37","response rate":"97.30","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHNSE 120a","cat_num":"4283","course_id":"762","year":"2010","term":"1","id":"35371e92eaa8a105481d55392393222c","first":"Congmin","last":"Zhao","InstructorOverall":"4.83","EffectiveLecturesorPresentations":"4.86","AccessibleOutsideClass":"4.59","GeneratesEnthusiasm":"4.69","FacilitatesDiscussionEncouragesParticipation":"4.73","GivesUsefulFeedback":"4.46","ReturnsAssignmentsinTimelyFashion":"4.76"}]},"Fall '09":{"course_score":{"overall":"4.60","workload":"3.02","difficulty":"3.52","recommendation":"4.60","enrollment":"44","response rate":"90.91","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHNSE 120a","cat_num":"4283","course_id":"762","year":"2009","term":"1","id":"cf5239e004ff68f8f0a023f66e201961","first":"Xuedong","last":"Wang","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.85","AccessibleOutsideClass":"4.81","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.89","GivesUsefulFeedback":"4.68","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '08":{"course_score":{"overall":"4.22","workload":"3.52","difficulty":"3.70","recommendation":"4.22","enrollment":"37","response rate":"62.16","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHNSE 120a","cat_num":"4283","course_id":"762","year":"2008","term":"1","id":"cf5239e004ff68f8f0a023f66e201961","first":"Xuedong","last":"Wang","InstructorOverall":"4.55","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.68","GeneratesEnthusiasm":"4.43","FacilitatesDiscussionEncouragesParticipation":"4.58","GivesUsefulFeedback":"4.53","ReturnsAssignmentsinTimelyFashion":"4.75"}]},"Fall '07":{"course_score":{"overall":"4.52","workload":"2.91","difficulty":"3.86","recommendation":"4.50","enrollment":"57","response rate":"42.11","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHNSE 120a","cat_num":"4283","course_id":"762","year":"2007","term":"1","id":"cf5239e004ff68f8f0a023f66e201961","first":"Xuedong","last":"Wang","InstructorOverall":"4.82","EffectiveLecturesorPresentations":"4.86","AccessibleOutsideClass":"4.86","GeneratesEnthusiasm":"4.86","FacilitatesDiscussionEncouragesParticipation":"4.91","GivesUsefulFeedback":"4.71","ReturnsAssignmentsinTimelyFashion":"4.94"}]},"Fall '06":{"course_score":{"overall":"4.48","workload":"2.79","difficulty":"3.63","recommendation":"4.74","enrollment":"52","response rate":"42.31","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"instructor_scores":[{"number":"CHNSE 120a","cat_num":"4283","course_id":"762","year":"2006","term":"1","id":"cf5239e004ff68f8f0a023f66e201961","first":"Xuedong","last":"Wang","InstructorOverall":"4.74","EffectiveLecturesorPresentations":"4.68","AccessibleOutsideClass":"4.75","GeneratesEnthusiasm":"4.58","FacilitatesDiscussionEncouragesParticipation":"4.62","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.92"}]}},"comments":{"Fall '07":{"comments":["It's a lot of work, but you get very good at Chinese.","If you want to be able to be dropped in China and feel comfortable getting around, take this course.","Keep an eye on the website and schedule - there are many oral presentations scattered throughout the semester that it is easy to forget about.","Be prepared to do a lot of work but rewarded accordingly.","This is a very interesting and fun course, but only good for those who want to learn the language and are prepared to dedicate a lot of time to learning it.","Study every day!","This is one of the best classes I have taken yet at Harvard.  I will be sad to see it end, and miss my teachers dearly.  This is not something I say lightly and not something I have said about any other class in any other subject in my time here.  I cannot recommend this course highly enough.","you learn a lot, demanding class, great professors","It is a very good class if you want to improve your Chinese.","for the most part very well taught and develops a strong level of chinese.","If you want to learn Chinese quickly and are willing to invest the time outside of class needed to do it, this is the class for you.","be prepared to regularly do a sizable amount of work","The instructors are great. They generate a lot of enthusiasm and are very approachable. However, do not take this class unless it is going to be your most important class. If you cannot focus just on this class, you will not have a good time.","Very good course, but rigorous and requires every day prep.","If you want to learn Chinese, how to speak, read, and write, this course is flawless."]},"Fall '08":{"comments":["Be prepared to work hard, particularly on memorization. You really only get out as much as you put into this class. If you make an effort, though, you will be rewarded by learning an incredible amount of Chinese.","This course takes a lot of work, but it's not hard work; memorization is required, but as long as you do your flash cards every day you'll be fine.","It requires a substantial commitment of time but is rewarding.","Best course at Harvard","it takes a lot of time but it is worth it","Take it if you want to learn Chinese well!","If you thought first year Chinese was difficult, be prepared to amp up the pace some more.","Make sure you remember the vocabulary!","I would recommend this course if students are willing to put in the time required of it."]},"Fall '09":{"comments":["It is a very good way to acquire language skills","This is a great class","As long as they've taken the beginner level, this is a really effective and helpful class","Study some over the breaks, but characters and tones are quick to disappear from memory without practice.","Take every opportunity to practice speaking in class and think as creatively as possible.  By doing this, the course is simultaneously challenging and entertaining.","Great course; I'm kind of glad I did not go to HBA because then I would not have had the pleasure of attending Xuedong Wang's fantastic class","This class is very challenging but rewarding in the long run. It's definitely not as easy as Chinese Bb, but not crazy difficult either. The teachers are great and you will come out with a better sense of Chinese than when you first came in.","there are a lot of work to do for this class, but it is worth doing so.","It's still fun and has the same atmosphere as Ba. There's nothing to fear in continuing.","this class is basically a continuation of Ba\/Bb.  Assignments are a bit harder, but grading is still very lenient.  Same time commitment.","Nothing short of living in China can instruct you as well in Chinese language and modern culture. The teachers have the understanding that only a native Chinese person can have, and the ability to convey information to non-Chinese speakers clearly and logically.","Be prepared for an enormous time committment, and be sure that you have a very solid background in the language. If you invest a lot of time (really a lot of time) you will notice definite improvement.","The work may seem tedious, but it is all VERY worthwhile. There is no such thing as busy work in this course! Take all assignments seriously.","You get out of this class what you put in.  Listening to the recordings is immensely helpful not just for acclimating the ear to the sounds of the Chinese language but also for mimicking dictations.  Wang Laoshi is incredibly friendly and open while also making sure that class stays on track and focused.","This class is great; because Wang laoshi is so motherly, she is sure to take you under her wing with much love and dedication and train you to speak like a zhong guo ren in no time!","The pace is extremely demanding, but you will learn a lot.  Be ready to work a lot and for a long time.","This course requires a lot of work, but the teachers are excellent","There is a constant, but not over-heavy workload. It shouldn't be more than a half-hour or so each day, if that, but you have to be willing to work most days. The work itself is not, difficult, though -- mostly vocabulary memorization.","If you put in the work, then you will do fine in the class; just don't fall behind, because then the amount of work demanded would become overwhelming. That said, the teachers are great and the course is very rewarding.","It is challenging, but incredibly rewarding.  It is easy to see your improvement throughout the course.  Even though the work is difficult, the class is fun because the teachers are all funny and the students are all close - the class really becomes a community.","Second year Chinese is definitely harder than first year but once you get the hang of it, it's manageable and your Chinese improves a lot.","I would only recommend this class with enthusiasm if a student was interested in dedicating a significant amount of time and effort to improving his or her Mandarin Chinese. If a student is not prepared to dedicate herself to the class, it will be extremely overwhelming, and worse, a waste of a lot of time.","It's just a continuation of Chinese Ba\/Bb, so if you took that and enjoyed it, you'll love this one too.","A lot faster than CHinese Ba Bb series. Moreover, the course isn't as strictly organized as the B series. Make sure you look at your assignment sheet daily","If you love Chinese, this class is great. However, it takes a lot of work.","In order to get anything out of this course, you need to be willing to put in the work.  If you are not, it will be a waste of your time.","You need to work very hard to keep up, but if you are committed to learning Chinese, you will really enjoy most of it.","It requires a lot of dedication.","Very work intensive but you get in what you get out.","Be ready to put in tons of time into this course."]},"Fall '10":{"comments":["Unless you're a language prodigy, don't expect (as I foolishly did) that taking the first-year course over the summer will allow you to breeze through this course.  It has its fun moments, but surprisingly little time is devoted to making the students speak Chinese, the focus--as usual--being all on grammar.  So if you love grammar, this is the course for you.","It's difficult but rewarding.","Second year is definitely more manageable than first year!","I strongly encourage students to come into class with a genuine desire to practice speaking the Chinese with fellow classmates.","A class you can always look forward to. Takes a lot of commitment, but totally worth it!","It's a lot of work, but I mean that's to be expected with Chinese. Would be super-painful if it weren't taught so well.","If you want to learn to use Chinese competently, I don't think there's a better program in the country. The teachers are really excellent, and while you need to keep up with the material constantly, it's not too much to learn per week, but you learn a great deal of material in one semester.","So fast! But so effective, too. Do you homework and keep alert in class and you'll love it. The teachers are wonderful and classes are small and tight-knit. Yes!","If you want to learn Chinese, take it.  Though there are many useful speech structures and vocabulary, in order to increase fluency, you should take any chance to converse in Chinese with the staff and other students.","i highly recommend this wonderful class! be forewarned: you will learn a lot of Chinese.","Daily preparation is essential. But if you do, Chinese will be the most rewarding class you take at Harvard.","If they want to study Chinese and are prepared to work hard - they should take this class.","To do well in this course, it's important to enjoy learning Chinese and to devote energy into it.  It's definitely worth it, though, and the teachers make learning Chinese both fun and easier than it otherwise would be!","Amazing teaching staff and a very fun class in which to learn a very important language.","This class is very similar to Chinese Bb, though a little more advanced.","really enhanced my chinese beyond where it was previously","N\/A","Be prepared to work VERY VERY VERY VERY hard.","hen hao wanr."]},"Fall '11":{"comments":["I definitely recommend this class for anyone who wants to learn Chinese.  It is challenging, but extremely rewarding.  However, it is time-consuming and tough, so probably not the best move if you're looking to just fulfill your language requirement.","If you are willing to put in the work for this language then you will definitely see a great benefit. The teachers make learning very enjoyable and are always willing to help you out.","It's a very well run, well organized class in which you're sure to learn a good amount of grammar and vocabulary. The work load is extremely consistent and the expectations very transparent.","Be prepared to work hard for this class, but you will get out a lot and learn the language well.","Be prepared to work hard.","A class that really, visibly helps you improve in Chinese.  A good amount of work, but not overly burdensome\/difficult.","Learn how to study and do the proper work early, it's important to establish the right study habits for this class.","If you have taken Chinese already at Harvard, you already have a strong foundation. Second year Chinese will consolidate that foundation. If you want a citation, go for it. If not, consider the cost and benefit of taking this course. I would strongly suggest planning on going to China as well.","It is one of the most well taught classes at Harvard!","The teaching staff are very capable and enthusiastic about their jobs. Chinese 120a is a well run course, and the workload is not easy but definitely reasonable.","The Chinese language department is the best! All of the teachers are very nice, helpful, and friendly. In class, they go over the grammar terms repeatedly to help you practice and familiarize yourself with the new material. This class is the best and I really enjoyed learning Chinese!","Having not taken the Ba\/Bb Intro Chinese, I cannot say whether it prepares you well enough for this course, but my four years of incompetent and badly structured high school Chinese was ample preparation. Importantly, a love of the language and discipline to sit down and study nightly are all one needs to sail smoothly through.","Wang Laoshi and Zhang Laoshi are amazing teachers who will push you to do your best without being too intimidating about it--go in and talk with them, they're really helpful!  Don't be scared away by the vocabulary or pace of the class, if you want to learn Chinese this is the best way to do it.","Definitely take this course if you are planning to ever go to China, or if you are at all interested in culture and language. Chinese is a great language to know, not only because it is useful in business-settings, but also because it is FUN!","A recommendation is moot. If you want to take Chinese you take this class.","a lot harder than chinese ba\/bb. be ready to work hard and learn a lot of new vocab and grammar. they don't baby you as much as they did in beginner chinese.","be ready to work. You could have worksheets, oral recording, an individual session, oral presentation, listening exercises, and dictation all in the same week.","If you want to improve your Chinese, take this class Wang laoshi and the section teachers are super nice, and you'll learn a ton while having fun.","Chinese 120A is a really manageable segue from AP high school Chinese into college level language, especially if Chinese isn't your strong point. The class is highly structured, and if you stick to the course schedule, you'll be able to learn a lot of Chinese, thoroughly, in a short amount of time. Practice and preparation are required out of class time to reap the benefits, though. The coursehead and preceptors are extremely knowledgeable and able when it comes to grammar and usage. Make time to visit office hours, or come to class with questions to ask. Individual sessions are a great and valuable time to verbally practice grammar and vocab in conversation.\r\nIt's up to you to learn and engage with Chinese in this course--they move fast, and it's up to you to keep up--but the structure is strong and if you  are organized, there's a lot to gain.","I would definitely recommend any of the first-year Chinese courses. However, this class is big step up from Chinese Bb. It moves very quickly and it's very easy to fall behind in this class. Therefore, my reservations for this class would be: be prepared to be outpaced by your classmates, some of who will be native speakers; be ready for more challenging homework assignments; and seriously consider working on the homework with someone else. This is one thing I regret not doing for this class. It would have made it much easier, to have had someone to go over my mistakes, and to read my writing and correct it for me.","If you want to improve your Chinese, this course is very good although it's a lot of work.","Lots of work especially for the listening quizzes, but still is a fun class to take. You come out of the class learning more than just grammar and vocabulary, but also learn a lot about chinese culture.","Be ready to put a LOT of time into it! But the teachers are kind and funny and the student environment is very \"we're all in this together\".","This is such a worthwhile class to take.  My one suggestion is to read every chapter before coming to class and not just the new words section.  This will enhance your experience leaps and bounds.  The faculty is fantastic and the homework does actually help, although it can be repetitive.  The class requires a lot of initiative on your part, but you will learn a lot.","Great way to learn Chinese: Reading, writing, and speaking. A lot of work during the week with memorization and grammar. Usually memorize 60-80 characters a week. Hard exam so study throughout the semester. Teachers are awesome and nice. Enjoy it when you take it.","Chinese 120a is a lot harder than Bb and it packs a significantly greater workload. That said, you will learn so much Chinese in just one semester. After the first few weeks, you really get into a rhythm and the workload doesn't seem terrible anymore so just stick with it.","If you want to learn Chinese, there is nowhere better!","memorize for the long term, not just to get through weekly vocab tests","Great class for learning Chinese.","This class is a blast! Your Chinese will improve by leaps and bounds, the Laoshimen are fantastic, and you'll have a great time. Definitely take this if you want to keep your ä¸­æ–‡ï¼\u0081"]},"Fall '12":{"comments":["Chinese 120a is a great course. You learn and unbelievable amount of new vocabulary and grammar, and the teachers are all really nice and helpful. It does require a solid amount of work, and it will nag you with class every day and with homework almost every night, but if you're at all interested in continuing to study Chinese, it's definitely worth taking!","It's a lot of work, but it is completely worth it.  The entire Chinese department is fantastic, feedback is constant and incredibly helpful.  If you put in the time, you end up learning a lot, and it's not too hard to do well in the class if you put in effort.","The workload is intense (especially towards the end of the semester), but Wang Laoshi is wonderful and the drills are actually a lot of fun (you end up talking about many different topics with the new words).  Make sure you keep up with the new words and sentence patterns and continue to review them and incorporate them into your knowledge base throughout the semester.  You'll get the most out of the class if you do this.","great course, really well-taught. my chinese has definitely improved a huge amount this semester. if you keep up with the vocabulary and memorize the grammar structures the class is really quite easy.","The only thing I wanted to comment about the assignment was that there were too many! I am a science concentrator and I found this class to be my most time consuming class.","This class is definitely tougher than Chinese Ba and Bb but helps you get more used to applying the language in everyday speech. It drills the grammar and vocabulary learned in Ba and Bb. The workload is very heavy, but you will get out of the course what you put into it. Definitely recommend for those who want to improve their Chinese and consolidate what they've learned.","This class is so much fun, especially if you \"click\" with the people in your section!","This is a fantastic course. Wang Laoshi is kind and funny, and the section laoshis are fantastic too. The workload is definitely heavy- time consuming. However, if you put the time into it, it is worth it.  The laoshis are more than willing to help you, and they are always enthusiastic.","The course is tough and it really pushes you hard, but the Laoshi are there to help you every step of the way. It is a pleasure and an honor to work them, honestly. Take this class because you want to learn Chinese and because it is incredibly well taught. Oh and, don't ever fall behind, you'll pay for it later, with interest.","itÂ´s the best chinese course ever, as long as youÂ´re prepared to work very hard on it.","This class is very, very intense.","This class is excellent if you're serious about learning Chinese.  You will work your butt off, but you will absolutely get your money's worth.","This class is a great course with great teachers, but it will require a good amount of work.","This class builds on your vocabulary and teaches you new sentence patterns that are crucial to conversational Chinese. You learn a lot, but sometimes at an overly intense pace.","Take the class! You will learn so much and be able to use Chinese in daily conversation much more naturally. The teaching team is amazing.","An excellent continuation of Chinese B, taught in basically the same format as the first year, with more of an emphasis on written compositions and a higher intake of vocabulary than recording assignments. Homework is generally more difficult, while lecture and section are about the same as the first year.  The smaller teaching staff may be a disadvantage to the personal attention received in first year Chinese.","It is a good class, and you learn a lot of Chinese.","This class is great; all the teachers are wonderful and will help you improve your chinese tremendously!","As with any other chinese class at Harvard, would not recommend taking as an elective. VERY time consuming. \r\nbut if needed for concentration\/ secondary, you can't find a better program anywhere else in the world. excellent teaching staff and the community developed in the chinese department is very strong.","Your Chinese will definitely improve a lot. Wang laoshi, Dong laoshi, and Zhang laoshi were all fantastic! Also, keep in mind that you'll have to do a group presentation with people from your section when you're deciding which section to be in at the beginning of the semester. While the class is definitely a pretty good amount of work, it is manageable and really fun!","This is a great class and you will learn a lot, but you should only take if you're ready to put in the time. The teachers are really dedicated and want you to succeed, and if you work hard you will come out knowing a lot of Chinese.","Chinese 120a is an excellent course. Wang Lao Shi is cheerful, wonderful, and knows each student individually by the second week of the course. Section is productive and the TFs ensure that each student receives ample time to practice their speaking skills. It's important to stay on top of character memorization as the ting xies (dictations) can become overwhelming and stressful if you fall behind. Make sure to prepare adequately before lecture (Tues\/Thurs) because Wang Lao Shi will cold call you about the text and grammar. The homework is consistent and the entire semester is planned out ahead of time so you have plenty of notice to prepare yourself for tests and quizzes. This is a great course overall and I really recommend it!","You better be real serious about learning Chinese if you're going to take it.","Chinese 120A is no joke, but you'll certainly get what you've asked for in signing up: a deeper and broader understanding of the Chinese language and culture.","This class will increase your fluency like you've never expected. Regardless of your weakness in learning Chinese, all the faculty are always open and ready to help.","its so hard and requires a lot of work, I work harder in this class then any other class","it's hard but you get what you put into it!","Chinese 120a isn't simply more vocabulary and grammar -- you will definitely improve your è¯­æ„Ÿ, too! Lectures explain more complex grammar constructions, as well as covering language subtleties that extend the basics covered in Ba\/Bb.","This class is great but you have to be willing to do homework or study Chinese every day! The teachers are great and it is fun but make sure you want to put the time into it or else it will be a bit challenging!","You should make sure your level from previous classes places you comfortably in this class (regardless of the placement test)","Be prepared for a lot of work","The teaching staff is excellent, and they all want you to succeed.  The more you put into this class, the more you will get out of it.","The class is very well taught and all of the teachers are extremely enthusiastic and helpful. As long as you are prepared to do a significant amount of work\/preparation each week, you will learn a lot. If you stay on top of your work, and keep up with 1-2 hours of Chinese each day, it will be much easier.","The workload is huge. Worksheets, recordings, take-home-tests, weekly tests, oral presentations, memorizing the text, individual sessions, etc. It just seems like way more work than is necessary. For those who have taken Ba and Bb, it's more work, but the work is easier to do since you're more comfortable with Chinese. The teaching staff is wonderful, and the class itself is great, just don't take it if you're not ready to devote the large amount of time outside of class that is necessary.","It's just a tad more difficult than Chinese Bb so don't let the course title intimidate you. Learning the characters is half the game. Figure out which words are important (v. & adj. usually) and find a way to review them since unlike grammar patterns, character retention just doesn't (can't) get much class time. After each chapter a lot of them will disappear and then boom! show up again on the exams. Vocab. quizzes sometimes include characters that are not from the chapter vocabulary; however, they often come from the text for that chapter, so if you're weak on characters, pay attention to the ones in the text that you've forgotten how to write. Great teaching staff. Sections a ton of fun.","If you want to learn Chinese after Chinese Ba, and you haven't given up on the program, this is course to take.","Prepare to be learning a lot more characters at a faster pace. Don't slack on studying for dictations because then you'll never learn the characters.","If you've taken Chinese Ab\/Bb, you know what to expect: the pace of the class is similar. There's less of an emphasis on pinyin during quizzes and increased focus on more advanced vocabulary words and four syllable phrases. But topics are more interesting as you advance: we had a chapter on bars in China! (Relevant + useful?) As long as you approach Chinese without the expectation of mastering it all, you'll have a ball. The teaching staff makes it worthwhile!"]},"Fall '13":{"comments":["This class will definitely improve your Chinese knowledge, but you should know that it is much more intense than Chinese Ba\/Bb. You can expect to memorize at least 50 characters per week, every week. You can expect to spend even more time than this, keeping up with all of the speaking assignments and homework. The teachers are extremely nice and helpful, but this doesn't quite make up for the difficulty and workload.","Be ready to dedicate a substantial amount of time to studying for dictations! The more time you put in, the more rewarding the course will be for you. The teachers are a fantastic resource, and you'll come out of the class with much more Chinese language expertise.","It is a lot of work but it is worth it; I feel like my Chinese language ability has improved a lot in both speaking and writing.","Chinese is great: the teachers are wonderful, classes are mostly enjoyable, and you really do learn a lot and your Chinese improves a great deal. But the workload is pretty substantial. You do have to study pretty much every day - in addition to having to go to class every day - but as long as you go in with realistic expectations, you'll have a good time.","Be prepared to get tested on material multiple times a week","It's a great class for  fulfilling the language requirement plus Wang Laoshi, Cui Laoshi, and Zhao Laoshi are all fantastic teachers who all care about your learning. Just be prepared to work. There are a lot of characters to learn each week.","Great class with great teachers. As a freshman already passed out of the language requirement though and planning to concentrate in math\/science, I regret not taking CS50 instead, and waiting until later to continue my Chinese. The level of the class was perfect for me, having taken four years of high school Chinese. Also, the first day might be very confusing, with regard to class logistics--Wang Laoshi seemed to expect everyone to have taken Chinese Ba\/Bb--but don't be discouraged! Just schedule a time with her and everything will make sense.","This is an amazing class. If you like Chinese and Chinese culture in any way, take this class. The teachers are some of the best at what they do, they have clear enthusiasm and passion every day, the class is meticulously designed, you learn an absolute ton. It's not a very hard class to get a good grade in, but it's a class in which your Chinese really just improves astronomically.","It is hard, but definitely worth it.","The teachers make the course that much more enjoyable.","This course is definitely more work than Ba\/ Bb, and less fun, but you get used to it.  It definitely improves your Chinese a lot. There is less emphasis on word translations but more emphasis on learning new grammar structures, which is very important. You also learn a lot of distinctions between formal and colloquial language.","Wonderfully taught. Has helped me improve my Chinese so much.","This course is great! Your chinese improves a lot in only one semester and it's definitely possible to do really well in the class if you study enough. The teachers are amazing, always here to help you.","120 is a really great class with strong teaching staff. It's quite a bit harder than Ba\/Bb because of the increase in the number of characters we have to memorize. The material taught is interesting and by the end of the semester, you realize that you can communicate about many aspects of China's culture, societal differences, population characteristics, environment, etc.","This is a difficult course because of the time and effort you have to put in not necessarily because the material is super difficult. But if you are committed and really want to learn the language, you will be amazed how much your speaking abilities and vocabulary improve over the course of the semester.","Make sure to ask questions to teachers! They are very willing to help during or after class.","Extension of Chinese Ba.  No difference.  Expect a constant stream of characters and grammar.  Its second year so not as rewarding as it might be, but I'm definitely sticking to it next semester!","If you enjoyed Ba\/Bb, then take second-year if it fits in your schedule. It's a very similar experience, but as your proficiency with the language grows, you can talk about more interesting and useful topics and you feel like you get a lot out of a single semester of study.","This is an intense, rigorous Chinese class which meets 5 days a week. It is towards the path to a citation, so most people who take it are on their way to the more advanced levels at Harvard. Be prepared to be constantly learning new characters and doing various assignments, and just learn a ton of Chinese.","Chinese is exactly what everyone says it is: very difficult.  But don't let that prevent you from taking the course.  It is extremely well taught and will definitely expand your Chinese knowledge.","You need to keep up with the assignments to get the most out of this course.","I had only been studying Chinese for two months prior to enrolling in 120, but it was the best decision I made. I don't know how the class is for those that took Ba\/Bb, but for me the completely Chinese environment and wonderful teaching staff made it easy for me to really expand my Chinese ability.","The teachers are very competent and know their stuff. However, they are a lot more serious and less humorous than the Ba teachers. As a result, class is sometimes really boring and is definitely not as much fun as Ba. However, you definitely do learn lots of Chinese.","You will work hard and learn a lot.","This class is a pretty serious time commitment and requires a lot of effort","A great continuation of your Chinese learning experience. I got much more comfortable with the spoken language.","It was a good class! All the teachers were great (nice, helpful, reasonable, approachable, funny- see if you ever get a chance to hear Wang Lao Shi's British accent, because it's so hilarious [but in a cute way]). The workload was doable and never felt useless (though sometimes some parts of the homework were really difficult, but the teachers were always lenient whenever that was the case). The tests were also generally not too bad, though they do occur somewhat frequently, and dictations are twice a week (blehhh). If you do take this class, I recommend not restudying chapters you've already studied for tests past the first one- the syllabus will say something like \"Test I (Lessons 1-3)\" and then \"Test II (Lessons 1-8)\" but for Test II if you want to save time you'll be fine if you just study Chapters 4-8. Same for the future tests.","The teachers are very enthusiastic but be prepared to put in a lot of time in the class.","The teachers are great and you learn A LOT of Chinese.","Great class! The workload is definitely manageable, and the class is small, so you get to know the teachers and other students.","Necessary in the coming age of China.","Chinese 120 is an excellent continuation of first-year Chinese at Harvard! The teaching staff are incredible and extremely dedicated. The coursework is genuinely interesting, covering relevant topics like food, travel, and cultural differences between the US and China. Know, of course, that the class is rigorous -- be sure to prepare for all dictations and spend time reviewing outside of class -- but you will find it highly rewarding!","This is a great class and if you put in the work your Chinese level will improve greatly.","It is a great class with wonderful teachers, but you have to really love Chinese to put in the investment. It meets 5 days epr week and has frequent assignments and assessments, so you never really get a break from the course.","This course is definitely a huge jump from Ba\/Bb. I used to think first year was pretty intense but still manageable; however 120a is a whole different beast. They will throw so many new characters and new grammar at you on a daily basis and you just have to keep up somehow. As with all other Chinese language classes, it is incredibly time intensive so I wouldn't recommend taking it in addition to an already heavy course load (like I did resulting in my intense internal panic once I saw how difficult the final was). If you do take it though, the lao shis are so great and absolutely hilarious. The course definitely has a wonderful (but small) teaching staff who really care about the students.","Incredible class. I bit more commitment but nothing out of the ordinary. Take it if you want to solidify your Chinese and learn your way around China. Fantastic.","Make sure you are willing to put in the time for this course if you want to do well."]},"Fall '14":{"comments":["Excellent course, make sure to review and practice with the grammar patterns and vocab frequently","Make sure to have a solid background on reading, writing. and grammar as it will be expected of you in the course. You will not be able to speak English in class unless it is completely necessary, so be prepared to practice speaking a lot.","Really felt like I solidified my basic Chinese. Textbook and materials are well written, and class is well structured. Harder material than Ba\/Bb but doesn't seem harder because it is similarly structured. Would definitely recommend","be prepared to put in a lot of work!","The teachers are perfect, you'll learn a ton without feeling too overwhelmed","Chinese 120a is a very rigorous course. It is well taught, and is a course that requires a lot of INPUT. Take this class if you are passionate about the language and want to take advantage of a great department. The department is structured such that you will receive significant 1-on-1 time with professors.","It's my favorite class at Harvard. Definitely take it, the teachers are wonderful.","This class is fantastic--Chinese is definitely a difficult language, but if you're willing to put in the work it's fascinating and rewarding.","Similar to Chinese Bb in how the course is run. Very stringent grading, with policies for point deduction extremely vague. However, the amount you'll learn over the course of the semester is huge; I cannot recommend this course highly enough. My only qualms are that there are not greater measures taken in order to ensure vocabulary words and grammar structures are thoroughly learned and remembered for the entire semester.","The Chinese program at Harvard has no equal.","Out of all the classes I took this semester, I found Chinese to be the best taught, and as a result my Chinese improved a tremendous amount, and that I learned more in this class than I did in any others.","This course requires a lot of hard work and daily practice, but the language improvement is noticeable.","Quizzes are extremely difficult, expect to spend lots of time in preperation","While intimidating, the Chinese language is an equally rewarding subject to consider studying.","Take if you only have 1 year of experience with chinese.  Do not take if you have more than that.","This course is excellent for teaching you massive amounts of Chinese in a relatively short period of time. You should take this course if you have an interest in improve your language skills beyond the basic level. Lessons cover practical topics, like travel, food, and studying, which gears you well for any travel abroad you may wish to take in the future. Do the preparation before class by reading the dialogues and learning the vocabulary because you will be more likely to retain the lessons for the assessments throughout the semester.","Great course to take if you want to continue to improve your skill in the language.","This class, like all Chinese language classes, requires a lot of work. There are two dictations per week of about 25 characters, a homework assignment (which'll take between half an hour and an hour), a recitation, and oftentimes also a quiz or essay. Don't be fooled by this only being a second-year language course: I came into it as a freshman, having taken up to 5th year Chinese in high school (I skipped a year in the language because I stayed in China for a summer with an immersion program), and it was definitely the right place for me and still a challenge at times. \n\nThat said, this is a FANTASTIC Chinese course. I think it would be very difficult to find one of its caliber anywhere else. The teachers are extremely kind and organized, and you get a ton of individual attention. If you're looking to hone your Chinese skills, this department is extremely well-qualified to help.","I really love learning Chinese at Harvard and I think the 120a course is great. My reservations are actually that it's too easy, but which I mean that I see a lot of areas in which other language courses push us that Chinese doesn't. For instance, I also took second year Spanish and feel that we were given far more writing tasks in Spanish than in Chinese. I would really appreciate the opportunity to improve upon my writing ability instead of just doing homework sheets with sentences that are really simple and come straight from the text book.","If any part of you wants to learn Chinese, do it here! Great class, difficult, but you will see results.","More no-nonsense than Chinese Ba or Bb, but it's still a great class and a ton of fun.","It's amazing and everyone should take it!","If you're okay with taking a challenge, take this course. It's totally cool and absolutely worth it.","Chinese 120a is a phenomenal class. It is very fast paced but it really expands your Chinese vocabulary and enables you to communicate in a much more effective and authentic manner. It is definitely a lot of work, but I think it is important to remember that the teachers are there to help you. They want you to do well in the class, so if you have any issues make sure to tell them. Go to the one-on-one sessions to improve your speaking and pronunciation. It helps tremendously when preparing for oral exams.","This class builds well off of what we learned in Ba and Bb. While there could be more focus on speaking over writing, Chinese 120a has helped me understand the language and culture better. If you want to continue to study Chinese, this class is both an excellent choice and your only choice."]},"Fall '15":{"comments":["Absolutely great, I loved this class! It does get tiring after a while that it meets 5 days a week, but its definitely worth it if you want to improve your chinese. I would note that that a strong foundation of  knowledge of Chinese is essential; either chinese Ba\/Bb or at least a few years of high school Chinese, depending on how good your high school's Chinese program was. I took 3 years of elementary school chinese and 4 of very repetitive high school Chinese and I thought this class was the perfect fit.","If you put the work in (daily review of vocabulary and grammar, reading, etc.), then the course is very manageable. But if you fall behind, it will be challenging. There are many resources to help you (especially the excellent teachers) if you need assistance, so do not worry about that part of it. Just bring the will to learn!","If you are not sure whether to continue with Chinese, do so. This is a great course and you will be happy you stuck with it.","The chinese teachers are amazing","I have learned so much from this course, and I would highly recommend it to anyone interested in a rigorous Chinese language class.","great class, very analogous to last year's course. Very difficult, very time consuming, very worth it.","If you're looking to take a language class at Harvard, I recommend Chinese to everyone. It's structured, offers a lot of individual attention, has a minimal workload, and focuses on improving speaking skills. I also love all of the teachers and have gotten a lot out of all of my classes in the department.","This is good stuff! Just be prepared to do a lot of memorizing and a good bit of speaking.","Harvard's Chinese Language Department has to be one of the best in the country, and Chinese 120a - like its prerequisites - proved that the be the case. The faculty are phenomenal, the content at an appropriate level of difficulty, and the class structure makes learning Chinese easy and fun.","Excellent followup to Chinese Ba. This class will improve your vocab a lot and solidify what you learned in Ba. That said, it usually felt more serious than Ba, and opportunities to speak were somewhat fewer because of lecture and section size.","The teachers here really care about you. They want you to do well. Don't be scared of messing up!","It is undoubtedly a difficult course, however, the hours spent studying every week does not come without everlasting benefits.","Harvard's Chinese courses have some of the best language curriculum I've seen. It is certainly a time-consuming class, but you will learn quickly. Though there is constant work, it's easier than doing p-sets or writing papers and provides a nice respite from actually cognitive work.","The teachers are incredible, but, in order to do well, you will likely need to have taken more than just BA\/BB. This class moves quicker than BA\/BB, and the expectations are much higher.","Great continuation of the introductory Chinese courses at Harvard. As with those, the instruction of this course with superb. Clear lesson plans and learning objectives. Instructors were all very engaged and provided constructive feedback that really improves your language abilities. I would definitely recommend this course if you are at all interested in advancing your understanding of Chinese past the first year level.","Great class but very hard","It's a good class but not a great one. You'll learn a lot of new grammar but conversational ability probably won't increase as much as you like it too. It's also the same routine week after week so it gets a little dry. But overall you'll definitely come out knowing more chinese than you did initially","If you are deciding what language to take as part of you language requirement, I highly recommend taking Chinese. Harvard's chinese department is full of amazing teachers and you'll essentially be component in the language after a year or two alone.","If you want to learn Chinese, this is the place to do it!"]}},"mostRecentQ":{"overall":"4.70","workload":"6.30","difficulty":null,"recommendation":"4.60","enrollment":"44","response rate":"84.09","QCourseOverall":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"0","2s":"0","3s":"0","4s":"12","5s":"24"},"QDifficulty":{"number":"CHNSE 120a","course_id":"762","cat_num":"4283","1s":"0","2s":"0","3s":"28","4s":"19","5s":"10"},"QWorkload":{"number":"CHNSE 120A","course_id":"762","cat_num":"113793","1s":"1","2s":"19","3s":"11","4s":"0","5s":"1"}},"success":true}