{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"6.00","difficulty":null,"recommendation":"5.00","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"2","4s":"1","5s":"1"},"QWorkload":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"TURKISH 130B","cat_num":"113853","course_id":"5322","year":"2016","term":"2","id":"c7524691424bf460fb17adaff219d911","first":" Himmet","last":"Taskomur","InstructorOverall":"5.00","EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '13":{"course_score":{"overall":"4.25","workload":"2.75","difficulty":"3.75","recommendation":"4.25","enrollment":"5","response rate":"80.00","QCourseOverall":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"2","4s":"1","5s":"1"},"QWorkload":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Spring '13":{"comments":["This class is demanding in ways that are not always recognized; without a formal curriculum it's easy to feel like you're not seeing personal improvement. It is also somewhat disorganized but you will come out of it having learned.","Efe is very good at making Turkish come to life in the sense that he will tell you when you sound like an Ottoman merchant using a certain grammatical construction that is \"correct\" but not ever used now. If you want to learn how people actually speak and read interesting contemporary fiction and poetry in Turkish with someone who is an active participant in the Turkish literary scene, this course is great.  I can assume that if you've invested the time to learn this much about the Turkish language already, you won't be surprised by much, but this is an entirely likable course that draws critical, dedicated students.  Regardless of the occasional exasperation of our ever-higher-standards-seeking instructor, the level of discussion in the class was always extremely high, both for an advanced foreign language course that is not a European language, and for classes in general. If Efe is your Turkish literary and cultural shepherd, it may be occasionally disorganized but it will never be dull."]},"Spring '17":{"comments":["The instructor made it a content heavy yet enjoyable class.","Take this class to greatly advance your Turkish speaking, reading, and writing. However, what was more important for me was actually the content--we discussed cinema, modern politics, literature. The class was not just informative, but also genuinely interesting every day.","At this level of Turkish, most learning is on the level of refining comprehension and growing one's vocabulary. In this class, we grew our language skills by discussing modern Turkish politics, art, and culture in depth. I feel that my spoken and written Turkish greatly improved as a result of this course - definitely recommended, especially if you want to finish that language citation!","Efe is an excellent teacher and your Turkish will improve drastically. I came in with many weaknesses in my Turkish but by the end of the class by grammar was solid and I was able to speak with confidence. It's also a really fun class and you learn quite a bit about Turkish history, in the language itself, so it makes for a very rich and unique learning experience."]}},"mostRecentQ":{"overall":"4.80","workload":"6.00","difficulty":null,"recommendation":"5.00","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"2","4s":"1","5s":"1"},"QWorkload":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"}},"success":true}