{"scores":{"Spring '17":{"course_score":{"overall":"4.00","workload":"7.40","difficulty":null,"recommendation":"4.20","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.60","workload":"4.30","difficulty":null,"recommendation":"4.90","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Spring '15":{"course_score":{"overall":"4.20","workload":"5.90","difficulty":null,"recommendation":"4.40","enrollment":"12","response rate":"66.67","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"3.60","workload":"5.30","difficulty":null,"recommendation":"3.80","enrollment":"34","response rate":"79.41","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.00","workload":"2.80","difficulty":"3.40","recommendation":"3.70","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.50","workload":"2.30","difficulty":"2.90","recommendation":"4.50","enrollment":"57","response rate":"87.72","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.55","workload":"2.27","difficulty":"2.91","recommendation":"4.55","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"3.93","workload":"2.39","difficulty":"3.03","recommendation":"4.03","enrollment":"63","response rate":"93.65","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"4.41","workload":"2.18","difficulty":"2.47","recommendation":"4.47","enrollment":"18","response rate":"94.44","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.20","workload":"2.14","difficulty":"2.80","recommendation":"4.07","enrollment":"76","response rate":"92.11","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"4.65","workload":"2.30","difficulty":"2.50","recommendation":"4.60","enrollment":"26","response rate":"76.92","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"4.24","workload":"2.34","difficulty":"3.02","recommendation":"4.22","enrollment":"70","response rate":"87.14","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ITAL Aa","cat_num":"4309","course_id":"4415","year":"2010","term":"1","id":"466cf6b6d086b2b0326cee3b6f8193e3","first":"Elvira G.","last":"Di Fabio","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.54","GeneratesEnthusiasm":"4.92","FacilitatesDiscussionEncouragesParticipation":"4.77","GivesUsefulFeedback":"4.46","ReturnsAssignmentsinTimelyFashion":"4.46"}]},"Spring '10":{"course_score":{"overall":"4.08","workload":"1.96","difficulty":"2.84","recommendation":"4.08","enrollment":"31","response rate":"83.87","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ITAL Aa","cat_num":"4309","course_id":"4415","year":"2009","term":"2","id":"466cf6b6d086b2b0326cee3b6f8193e3","first":"Elvira G.","last":"Di Fabio","InstructorOverall":"4.07","EffectiveLecturesorPresentations":"4.14","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.47","FacilitatesDiscussionEncouragesParticipation":"4.33","GivesUsefulFeedback":"3.62","ReturnsAssignmentsinTimelyFashion":"3.69"}]},"Fall '09":{"course_score":{"overall":"4.02","workload":"2.20","difficulty":"2.92","recommendation":"4.18","enrollment":"63","response rate":"98.41","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Spring '09":{"course_score":{"overall":"4.71","workload":"2.50","difficulty":"2.50","recommendation":"4.71","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Fall '08":{"course_score":{"overall":"4.17","workload":"2.40","difficulty":"3.08","recommendation":"4.34","enrollment":"71","response rate":"88.73","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Fall '08":{"comments":["I would tell future students to expect to spend a lot of time learning the material outside of class. We were all expected to come to class familiar with the material, and it is necessary to stay on top of the material.","if you want to learn to speak a language quickly, take this course.","A fun and enjoyable way to learn this beautiful language.  I thoroughly enjoyed the class.","Expect to participate in section, so study and come prepared.","just read over the text every night before class","I would tell future students that they should join this class because they would have a great time in class while learning multitudes more about a language than they ever did in high school.","I would be prepared for several, small daily assignments.  In terms of planning ahead, smaller assignments aren't given out until the class before they are due, so it is important to build in time and have some flexibility.  This class involves a lot of small group activities, which are pretty fun and seem to be a good way to learn and practice a language.","Be prepared to put the time in for this class.  It requires you to study every night and to do quite a lot of work over the weekends (coming in as a close second to Life Science 1a).","This class is perfect for anyone interested in learning the basics of the Italian language whether you've taken classes in Italian or any other Romance language or not. The workload is not too bad if you leave time to complete the essays and the take-home quizzes without rushing.","Its hard at first, but it becomes fun and exciting as you go","Get Maiko as your teacher.","Italian Aa is a good basic introduction to Italian. My mother's family speaks Italian and by the end of the course I had a much better grip on what they were saying and was more able to converse with them.","Great teachers, manageable amount of homework.","For a class in which you learn a LOT and have a great time, take Italian Aa.","It does require time but all of the work is worthwhile.","It's really fun!","Its fun. I had prior knowledge of Spanish at it can make learning italian very confusing at times.","While the time commitment is probably a bit higher than for most courses, the pleasure of course was well worth it.  Plus, you learn Italian.","The class was excellent. I learned a lot of Italian and had a great time doing it.","This is an excellent introductory language course.  It's truly aimed at teaching you the material and allowing you to apply it and excel -- it's nice to be able to leave the class and take a concrete sense of improvement along with you.","I would tell future students that taking Italian Aa is a fun way to learn a new language.","This is a really fun class to take especially if you enjoy learning Romantic languages. It takes a more fun and interactive approach to learning a new language while using multiple visual and auditory media. I would definitely take this class again!","Put in the work to practice your grammar and you will both enjoy the class and be pleased with your progress in italian","I would tell them that language courses are fun and that they are useful. I would warn that they do take time as well.","Take the 9 o'clock class as it is smaller and has students who want to learn. Do some Italian everyday.  Start from the beginning making flash cards or Excel sheets with vocabulary as it mounts up quickly.  Have the good luck to have a good teacher!","The coursework could be much more rigorous and engaging.  If students were pushed harder, they would learn more;  as it stands, learning Italian well requires students to take more independent initiative and effort than the course itself requires.","I can't speak for the other TF's, but Cara was really great and made for a very comfortable learning environment.  The course load was very moderate compared to what I've heard from students in other language classes.  Italian is a lot of fun and because it's generally not stressful, it was a lot of fun.  However, don't led the light workload fool you -- you still have to review often and understand the material in order to do well on the chapter tests and participate intelligently in class.","Italian is a fun, enjoyable language to learn. It is a good choice for fulfilling the language requirement. It is less intense than other languages because it uses the same alphabet. Having knowledge of the Italian language can open an individual's opportunities to explore an interesting and exciting culture.","Get that notion of \"what's the point of learning this?\" out of your head -- the gratification comes straight from learning the language.","This class moves very fast. You start working and learning right away and the pace does not slow down. It is definitely a good class with good assignments, but it is difficult to keep up if you fall behind.","It is a lot of work and a lot of memorization and moves very rapidly.","I would say that it is a fun language that is pretty difficult. There is a TON of work involved, so it is not a language to take to fill a requirement. It is more work than it is worth undoubtedly.","Italian Aa is a great class but be prepared to work hard.  Although it is an intro class, it moves fast and you need to be diligent to keep up.","The TF's are really nice and they make classes very interesting and exciting. There is always a fun activity to look forward to that brightens up your day!","The course is fun and exciting. It's truly an enriching experience. The department is fantastic, and they are willing to go to extremes to ensure that you succeed.","It sometimes seems like there's a disconnect between the tests and the teaching, however, a little bit of studying everyday goes a long way in this class. It was not effective to wait until the end of the week to study before the quiz.","AMAZING. If you want to learn Italian this is the way to go.","While this isn't the best introductory language class I've taken, it is a fun and good one.  I would recommend trying intensive if you have the time in your schedule and want a more rigorous introduction to Italian."]},"Spring '09":{"comments":["This is a great, fun, easy class to take if you want to learn Italian! But make sure that your section leader is good, because EVERYTHING depends on that person being good!","It's pretty easy- only problem is you have to stay on top of all the assignments.","Be careful.  Introductory language classes are a LOT of work.","Great new language to learn!"]},"Spring '10":{"comments":["This class provides a great foundation for any beginner to learn Italian. The class not only instructs you how to communicate, but it also teaches you about Italian culture and customs as well.","A lot of the words and grammar that you encounter in the beginning aren't taught in the class until after. The quizzes are very difficult as well if you don't know all the additional vocabulary outside the book. Don't go to sections with grad students because they tend to know the language already and make it difficult for you to contribute! :(","This course is SO much fun, I absolutely loved it! Also, small class sizes made learning much easier and more active.","This class is AMAZING! It will truly generate an interest in Italian and Italian culture, and it will make you want to travel to Italy!","This is a fun class in the classroom, and relatively easy, but beware if you like to pack your schedule and plan it very tightly, because the disorganization and short-notice assignments of this class can be frustrating.","If DiFabio is teaching this class, then that is a good reason to take it! She was great","You learn a lot in a semester - it's awesome!","It was a really fun class.  You learn a lot of Italian in one semester.  Professor has great enthusiasm, a wonderful class!","I had many language teachers but Prof. Di Fabio is by far the best!","Italian is fun!  You'll learn a lot over the semester.","TAKE THIS CLASS! It's enjoyable and you learn a lot. The students you meet by taking this are from all over the world and studying so many interesting things! I loved this course and I know everyone else in my class did as well!","Fun class although sometimes the assignments seemed too childish.","It moves very very fast! be prepared!"]},"Fall '10":{"comments":["This class is extremely well taught.  The structure of the class is easy to follow, and assignments are very helpful in solidifying the concepts learned in class.","Professoressa DiSalvo is an absolutely phenomenal teacher. She is enthusiastic, engaged, and highly qualified, and truly does care about your progress in the course. The course was very enjoyable and i would definitely recomend it to peers on the basis that it provided an exceptional foundation to italian. Don't be fooled however, it requires a lot of work (10+ hours a week at least) and the one major improvement that the course can make is to LOWER THE EXTREMELY HIGH GRADE A RANGE for future students.","Be prepared to work. Alot.  This class has a ton of \"busy work\"-online homework assignments due three or four days a week, in addition to take home tests and quizzes, as well as projects, essays, and pop quizzes.  It is an immense workload because one has to \"stay on top of things\" in order to keep up.  This class is very fast paced and can be very stressful for someone not used to this kind of learning environment.","Italian Aa may not be as intensive as Italian Bab, but it still goes at a pretty fast pace; after just a semester you will be equipped to write a 300-word italian essay!","You will come out of this class with a very strong background in Italian. The TF's and course head are all very helpful, but also make this class a LOT of fun. It's run in a complete submersion style, so it's all Italian, all the time in class. If you're freaked out at first, don't worry! You will be amazed at how much you understand by the end of the class.","this is a great class to take.  You will definitely have to put in the necessary work, but you will learn a lot and have more fun in the class than most other classes.","Any language course - especially this intro Italian one - forces you to think in a way that no other course can.  As such, it provides a great balance for your other coursework.  Also, at the the end of the semester, you'll realize that you learned SO MUCH!  ps. I love Stacy.","Cool intro class; easy workload, lots of useful grammar and vocabulary. One semester covers present, imperfect, past and future tenses. Videos and other activities in class, useful conversation hour.","This is a great class for both students looking to fulfill foreign language requirements and students who are just looking for a fun, stimulating course. Italian is a wonderful language and is relatively easy to learn.","Expect busy work, but it is necessary for learning any language. I feel comfortable conversing in basic Italian, and I am looking forward to Ab but the grading system is a little confusing at times","it will take up a lot of time","while taking a new language is fun and interesting, it is also A LOT OF HARD WORK.","My experience with this course was a little frustrating because I ended up with a TF I did not really connect with a lot.  Also, she wasn't a native speaker, which really frustrated me because I was bothered by her accent, and I felt our listening comprehension could have gotten a lot better if she were native, and because it was occasionally reinforcing bad habits in our own conversation.  I have heard, however, that other TF's were very good.","This is a great class and Cara is a great teacher. The material is very manageable if you put a little work in every week and don't let it build up. Over all a great class!","This class is fun and you definitely learn a good amount of the Italian language.","This is a great class!  Be sure not to fall behind because it is harder to catch up and be sure to have fun. Don't forget to practice... cramming doesn't work very well for learning languages.","It's hard!","It's not an easy class, but you'll learn Italian faster this way than any other way. Don't take it if you don't love the language or if you don't want to continue with Italian, at least for a little while.","This class is probably easier than some of the other languages.  That being said, the way the class is conducted creates something of a sink or swim approach.  Because everything is in italian, you either understand it or you don't.  Also, although you may not get a ton of work, I highly recommend spending time studying on your own or going to the RLL tutoring center.  I made the mistake of not allowing for that.","A fun language course with lots of in class activities, but always a new twist which kept the learning process engaging and fun to attend, even at 9 in the morning on Monday, Wednesday, and Friday.","This class is a lot of work!","Awesome class! Fun people, fun materials! Take ittttt! :D","The take-homes are the hardest part of the class. That's the only hesitation I have about recommending it.","You will be immersed in the language of Italy from the first day in this class.  This immersion and support in the classroom and in the conversation hour will give you the basic vocabulary and grammar skills.  There are many interactive activities done in the classroom which help with writing, speaking, hearing and understanding the language.  These activities also make the class fun.  This language course also teaches the students aabout hte culture of Italy.","This course definitely enhanced my passion to learn more about Italy. The language craftily introduced me to all that Italian culture has to offer. Not to mention, I loved talking about the food!","Come prepared to learn Italian, but also to have fun while doing so. It was my favorite class this semester! Even conversation hours were really fun and exciting!","I always looked forward to going to this class because it was fun and interesting to learn a different language, especially Italian because it's so fun to say all the words.","I took this totally for fun (I've already fulfilled my language requirement) and as one of the few seniors in the class I found the class to be very enjoyable, low-stress, and fairly easy. The one complaint I have is about how many tedious online assignments there were, but I guess that's necessary when first learning a language. I wish there were more hands-on learning opportunities to get in touch with the culture, like a field trip to the North End.","Professoressa Di Fabio is great; in this class, you'll listen to music and cook while gaining basic fluency in Italian.","This class is absolutely amazing! I had so much fun in this class, honestly it is worth taking if you just want to learn a new language. The class is relatively easy and relaxed, but even from one semester you will be surprised how much you can learn how to speak in Italian.","This course moves very quickly so if you don't want to learn italian and you just want to get you requirement out of the way maybe reconsider taking this because you cant just skate by and get a good grade.","Definitely take this class if you have any interest in learning Italian.  It's very rewarding to learn so much so quickly.","This class completely depends on your TFs.(class and conversation hour). My Section leader is great; however, my conversation hour TF has a horrible Italian accent. A first DAY Italian student could speak with a better accent with her."]},"Spring '11":{"comments":["You will learn a lot of Italian by the end, and if you have a good teacher (as we did!), it will be a lot of fun.","Italian is a beautiful language and it's fun to learn about Italy- but you have to want to do it! It takes up a huge chunk of your time\/ schedule","Take this course! It is very fun and engaging, while still very helpful in teaching the material.","Good basic intro to Italian.","This is a really fun class with a lot of really cool activities throughout the week. It can sometimes be busy with worksheets and labs but it is really fun and one of the only classes I always look forward to. Try and get Patrizia because she is so funny and a really great teacher!","This is a very enjoyable, relaxed class with a wonderful TF - Patrizia!","This was a really fun introduction to Italian. Patrizia was a great teacher and knew how to create classes that were both interesting and fun. I did feel that it moved a bit quickly and wish we could have spent some more time with certain grammar lessons, but overall, I'm happy to have taken this course. It was really interesting to learn about this beautiful language and the culture it's from.","This course is a whole lot of fun and you will learn a lot of Italian in a very short time!","I would say be careful about the grammar and double and triple check everything because they grade pretty harshly","great comprehension of the material; amazing instructor","The workload is completely managable, and you will leave with a good, basic understanding of the language and ability to speak it. The class is engaging and definitely worthwhile! Patrizia is wonderful!","This class is awesome! Definitely worth it.","it is fun but lots of busy work"]},"Fall '11":{"comments":["Its a great language and a ton of fun.","Italian Aa is a great class to take.  Italian is a fascinating language to learn, and the teaching staff is excellent.","This course was truly amazing and gave a wonderful background to Italian that I never dreamed of achieving in several short months.","Fun class. This depends a lot on your TF, however. Good, pretty standard intro language course. Much easier if you have background in another Romance language.","Be prepared to work. You have a lot of workbook activities, but it is mainly mindless work and is very doable. I really enjoyed this class and I'm glad I chose this class to fulfill my requirement.","It's fun and you get to learn a nice language!","So fun!","If you have a desire to be able to have a moderate conversation on a trip to Italy, this class is great and the TFs are wonderful!","The course moves quickly, but it is enjoyable.","Its hard for a language, but fun and you learn a lot. Also, I would try to get Chris Brown as your TF cause he was a great teacher","This class is pretty cool.  It is taught in Italian and that is a little annoying, but you should definitely take it if you're looking for an easy way to fulfill a language requirement.","Do this course - easy to pick up, not too much work, italian is a great language","Take language classes whenever you can, they are so fun!","The class is graded seriously but you still learn a lot. I already feel as if I could get around in Italy if I needed to.","It can be a fun class if you get a good teacher, but it is one of those classes that it won't make much of an impression on your academic thinking as a whole. (i would have rather taken some other course in its place, as I don't feel I got a lot out of this course)","Italian is SO awesome!  You should take it.","Do not take this course if you've never taken italian before and need a language requirement fulfillment. So much busywork, and really feels like a waste by the end.","If you want to learn Italian take this class. Don't be afraid that it is taught in Italian. It doesn't take that long to be able to figure out what is going on and the teacher is always willing to help you out if you get lost. The class are fun and the workload is not too heavy.","Italian Aa is an awesome class!  It's a pretty painless way to learn another language, especially if you already know another Romance language.  Lectures are usually pretty engaging, although they could spend more time on the grammar.  The tests are pretty much all take-home, and the workload is fairly light.  You'll end up speaking way more Italian than you realized you could learn in one semester!","Study a bit every night.","This course starts off relatively easy, but it definitely gets harder throughout the course of the semester. Don't slack off because you're doing well! \r\nLots of fun though! A great class to take and an excellent way to fulfill your language requirement!","Take this class with Christopher Brown! He's a great and understanding TF. Italian Aa is a fast but easy course, and you really come of it with a good basica understanding of the  language.","It is a great introduction course to Italian, whether you have taken any romantic languages or not.","It's easy to do well if you put in the time.","Homework is not that difficult, but communicating in class can be.","The class itself would have been fine, wasn't really a fan of my TF.","So worth taking! It's easier than you would expect a class taught entirely in Italian to be.","As someone who has always wanted to learn Italian, I really liked Italian Aa. Dalila was a really nice TF who clearly wanted us to learn the language, and the songs she played for us in class were really fun and were a nice break from the powerpoints. Be warned though: it's hard work. You really need to take the time outside of class to learn the vocabulary and do the HW (don't save it for the night before! really!). The other thing is that sometimes in class we'd see a concept but wouldn't really go over it, so that was kind of difficult, and our TF spoke really fast so a lot of times I would leave section having no clue what just happened. I would also recommend that you have some sort of background in a romance language, because it's hard to learn all the grammar from scratch. But you definitely learn a LOT of Italian in a very short period of time, although it focuses more on writing than conversation.","It is so much fun and you learn so much about the language and culture!","If you're bored with a language you have previously taken, take italian! Its interesting and not too difficult if you've taken Spanish before.","Only take this class if you really want to learn Italian. I just had to fulfill my language requirement and thought Italian would be interesting (and it is). However, it is frustrating at first to be at a beginner's level and even if it is similar to other romance languages, it is still distinctive.","A great, relaxed class.  You learn a good deal of Italian and by the end you can have coherent conversations.  If you put in a little bit of extra work (go to office hours, read over the grammar rules at home, etc) you can really get a lot out of the course.  The teacher for my section was excellent and extremely helpful.","I had reservations about taking this course because it's taught in italian and I had no experience with learning a spoken foreign language. Although I thought that some aspects would have been more clear had they been explained in english ( at least the first time they were introduced), the book was very helpful for filling in things that I didn't pick up on in class, and looking back I think being exposed to the language during class was very helpful.","Fun, rewarding, fair."]},"Spring '12":{"comments":["This class is great, fun and I feel that I learned a ton!","This class is worth the effort. You really learn the language and so much about the culture too. A fantastic course!","This class is fun! A perfect introduction to the Italian language.","great class - Italian is a beautiful language and thanks to the immersion teaching style you learn so quickly!","This class is fun and worth taking.  You will have a good time if you already speak Spanish but probably struggle a bit more if you have little experience in Romance languages.  I can't speak anything and still enjoyed the class a lot.  But having taken both Italian Aa and Spanish Aa at Harvard, I would recommend Spanish over this class if you are just looking to fulfill your language requirement (and have no prior experience) because that is definitely geared more towards students with zero Romance language skills.","Enjoy this class - it definitely is fun and exposes you to a beautiful language!","Be sure to review a lot on your own outside of class or you will end up cramming a lot before exams.","Take this class! It's such an easy way to get a handle on an amazing language! Now I understand the Italian bits in The Godfather, and they're really not like the translations, haha.","If you have already taken a few years of another language, Italian is a great language to learn. I enjoyed going to class everyday. It is not an easy class because section meets four times a week and homework is due almost everyday but it is also not a hard class.","Great class! That is the 4th language I am learning,  this was my best experience","This is such a fun class, definitely take it! Italian is such a beautiful language and fun to learn! It is not very difficult if you practice, which you cannot help but do because the class is conducted completely in Italian--and don't be nervous about that, all of the class is learning together and your teacher will be more than happy to slow down or repeat things if you get confused. You do plenty of fun activities and pick up the language very quickly by listening and speaking. The only downside of this course is that toward the end, four days a week of this class can get a little tedious, but it's very likely that this will end up being your favorite class and one that you actually look forward to going to!","course is almost too easy, will not really learn the language unless they restructure it and make it more interactive.. right now they take you thru the book without really allowing the material to sink in through class activities! you will learn enough to get around Italy but outside practice is definitely needed!"]},"Fall '12":{"comments":["This is a great course.  It doesn't have a very intense workload, and Italian is a very fun language to learn.","This class was a very interactive and fun way to learn Italian. The assignments were pretty easy to complete in a short amount of time and the class itself brought a lot of practice in answering questions in Italian and coming up with short dialogues to practice grammatical concepts and vocabulary learned in each unit. However, a lot of this class was based on learning these concepts and vocabulary outside of class and coming to class prepared to practice and \"play\" with this knowledge.","It is not bad if you need to fulfill your language requirement but the class is far too time consuming to take as an elective unless you really want to learn the language. You will learn a lot in this class though","Only take it if you plan on staying in Italy for an extended period of time, or if you want to live there in the near future. Otherwise, take a language course that you have previous experience in.","Enjoy it! It's a fantastic course!","This was my favorite course this fall, and if you've ever considered taking Italian, you should definitely go for it.","Italian Aa is a fun language class and I'd recommend taking it if you want to fulfill a language requirement or if you just want to take it for fun.","This is an excellent course that combines regular practice in speaking, listening to, and writing the Italian language with fun interactive exercises such as museum and cafe trips and conversations with native speakers.  The class is taught in section and conducted entirely Italian. This seems overwhelming during the first few days, but soon the benefit of this immersion materializes in improved communication skills and the class becomes far easier to follow.  The workbook and weekly take-home quizzes can grow tedious at times, and it's tough having class four times a week, but all your work will seem worthwile when you realize how far your language skills have progressed. Previous study in a Romance language would be helpful for some grammar concepts but is not neccessary.  Overall I recommend this course to anyone looking to fulfill the language requirement, study abroad in Italy, or simply become enriched by better understanding another culture.","No romance language necessary, but it will make your life a lot easier.","Italian Aa provides a good introduction to the Italian language, and most of the TFs are very low-key and fun to interact with on a daily basis. The assignments aren't too challenging and lots of other resources are used in order to teach the class (movies, museum visits, songs, etc.)","Its a great class and the sections are only like 10 people so you get to know everyone creating acomfortable learning environment.","Take this class! Italian is a beautiful language, and Italy has an incredible culture: this class provides you with the opportunity to learn both of these! The material is not challenging, but try to keep up with the workbook assignments so that you're not scrambling to complete them the night before they're do. The textbook and these assignments also make section that much more helpful because section reinforces ideas that you should have learned from the homework, rather than being the first time that you have encountered these ideas.","Do not be fooled by thinking knowing another language, for example Spanish, will help you learn more readily. Most likely you will just occasionally litter your comments and essays with stray spanish words which you didn't even notice you were integrating.","Make sure you sit squarely in front of the chalkboard (versus a seat at an angle) so you can read what's written on it.","This class is great! Not too much work, but you get a lot out of it.","If you have been exposed to a first level language course with little English spoken and have enjoyed it, then you will probably enjoy this class.","italian is fun","Don't take it unless you love the sound of Italian, but if you do, you'll get a lot out of it.","I would only recommend it as a summer course if required.","Italian's a great language to take! The class is usually a lot of fun, you learn a lot, and it's very fulfilling. You'll feel like you can have basic conversations with Italians by the end of the course.","Really well taught.  Keep up with the assignments, it makes life way easier.","This class is definitely a good introduction to Italian but it is also fairly difficult. Also, the books are really expensive. Be ready to work, and you will get a lot out of it.","If you have time, it's really helpful to actually study\/read through the chapter units when that's the only homework for the night. It's tempting not to because there's nothing to turn in, but it saves you a lot of time down the road\/that weekend studying for the take-home quizzes\/in class.","I bet if you put in the work it would help. Do not leave languages as the last class because then you will not actually learn much. I should have read the book more often and studied.","Be prepared to think. Just because this is an intro language course, which generally have the reputation of being simple, doesn't mean that you can procrastinate. However, the homework is not heavy and the class is greatly enjoyable.","Homework assignments can be tedious but this class is a great language class and you will be surprised at how much you will learn in one short semester.","be ready to study on your own, but you learn so much in one semester","Make sure to study every night.","This is an intro course, so not knowing a language aside from english is totally fine, in fact; spanish speakers, for example, experience a difficulty with discerning Italian from Spanish, and often times that serves them no good.","This course is a great introduction to Italian that I recommend for anyone possibly interested in learning it.","DO ABSOLUTELY EVERYTHING YOU CAN TO GET INTO PROFESSOR LIEBERMAN'S SECTION!!!","Italian is a beautiful language, so if you're interested, take the course. And make sure you get a fun teacher for section, or else you're in for a tough semester.","Taking a language course provides a nice change of pace from bigger lecture classes.","That do not be fooled into thinking this class has no work, it has. Despite this it was one of my best classes freshman fall with my TF constantly willing to help.","Italian is a beautiful language spoken in many places and is a pleasure to learn! Prof. Begolo creates a wonderful atmosphere of laughter and learning. Every morning in this class was a great time because I learned so much, enjoyed learning with my peers, and the activities were a lot of fun! Prof. Begolo proves that learning can be a great joy.","It's a lot of repetition, but in one semester ingrains an understanding of Italian in you at the level achieved by probably 3+ years of language at a high school level.","Your professor is key to your enjoyment in the class.  If you don't like your professor, find a section with a professor that you like."]},"Spring '13":{"comments":["Painless, fun way to start a language. Whether you're going to study Italian throughout college, or need a fun Senior Spring-style elective, take it!","I highly recommend this course, if you are interested in learning Italian. It's a fun and productive way to spend a semester.","Mary is firm but a good instructor. Don't mess with the deadlines and you'll be fine. Expect nightly work which is kind of a pain but that's how it goes with intro language classes. Only two exams and no final too, not bad.","This class is a very engaging and enjoyable introduction to the Italian language.","If you are curious about Italian language and culture and would like to learn more about them in a very enjoyable setting, this is the class for you!"]},"Fall '13":{"comments":["This class is a good way to learn Italian.  The book is useful though the online homework is not particularly relevant at times.  Julianne does a good job as TF, get her if you can!  She is very fair and willing to work with you to make back points that you lose.  The class isn't too hard if you stay on top of the work!","It was a great introduction to Italian. I would recommend to all students to take a Harvard language course even if they place out in the Placement tests. It is a very different approach than in high school and is pretty much immersive from day one. Also because the intro language courses are small and meet so frequently, you get very close with the group.","This class is excellent. It is fun and engaging and you learn to communicate in Italian very quickly.","Immersion in a living language that is both fun and informative.","Make sure you take time to do the homework even if it seems like busy work because it really advances your proficiency.","warning: its all spoken in italian","You'll gain basic conversational skill in just one semester.","This class is fun and rewarding! It is not much work, and you learn quickly. Familiarity with a Romance language is helpful, but not necessary. Try to get Soroor's section! She couldn't have been a better TF!","If you really want to learn italian, start trying to think in that language.","Get Soroor.","This was an enjoyable and painless language-learning experience with a very good TF who inspired enthusiasm and comfort among the students. The conversational component of the class reinforced our learning and the games we played were an enjoyable way to cement our understanding. I left class wanting to speak Italian to anyone who would listen.","it is entertaining and interesting to learn about italy while you learn to speak the language.","It moves quickly but you learn a lot.  Requires some patience and time but well worth it if you want to learn italian or finish the language requirement.","This course is the best language experience I've ever had!","This course is a very fun, easy, and satisfying way to fulfill the language requirement.  The teaching staff is friendly and helpful, the coursework is easy, and the class activities are fun.  It's a great way also to learn a surprisingly large amount of Italian in just a semester!","The class is enjoyable and teaches you a lot, but it moves pretty fast. You don't need to have any prior experience in Italian, but some experience in a foreign language would be very helpful. If you're willing to put the work an effort into the class, it's a great experience.","A great introduction to Italian. If you're considering learning in a low stress environment, this is a good beginning language class. Class sizes are small, you get to know everyone and have a lot of fun learning together. Classes aren't always the most structured but usually always enjoyable.","It's very fun and interactive, but there's a lot of homework.","If you want to take a language, this is the one to take.  It's useful, fairly easy to learn, and so beautiful.  I've had so much fun in this class and have become so close to my classmates.","-You have to keep up with the material and the class will definitely force you to do that; lots of cold-calling and in-class participation so you really have to do the work","This class has a lot of different teachers but my teacher was awesome! You learn Italian in a low stress environment and the work isn't bad at all.","You learn a lot of Italian, but it's taught in a relaxed enough way that it doesn't feel pressured. Just a worthy use of your time.","The homework is a bit tedious but the course is fun and the professor is enthusiastic and makes the course fun","Italian is an interesting and beautiful language","This course really makes you feel like you're accomplishing something. I only wish I'd taken it earlier.","This is such an amazing class, I loved it. And if you want to learn Italian and have no background this is the course for you. But if you want to do well you need to stay on top of the assignments on Quia and the Take Home Assignments on the weekends.","Its a fun, no-stress way to learn a foreign language. You learn a lot in a short time!","Being on top of your work really helps you get a lot more out of the class-study the chapters before section.","This class is great, and it even opens up opportunities to study abroad. To be completely honest, if you want to learn a foreign language but don't want to be completely overwhelmed, this is a great option.","Fun and you learn a ton of Italian without even realizing it","Italian is a fun and beautiful language, and the teaching staff were all helpful and engaging."]},"Spring '14":{"comments":["This is a great class! Yes, you'll have to study and yes, you'll probably feel lost all the way until the end. But it is fun and not too difficult. Plus, Italian is such a beautiful language. Take it!","Never to take Italian at Harvard if avoidable.","I loved this course!!! To better learn the language, I suggest: getting a playlist of cool Italian songs to listen to while you study the language throughout the semester (it is so cool when you finally realize that you understand what is being said) and do not rely on translating...instead of connecting the new word with the english translation, connect it to the actual image."]},"Fall '14":{"comments":["This class was fun. Intro language classes really tend to depend on the instructor.","If you are interested in learning the Italian language, this class is perfect for you. This is not necessarily the easiest course because learning a language is not the easiest thing to do. But, if you are willing to put the effort and time into mastering the material it can be a rewarding course.","Great TFs, great coursework material. If you want to learn Italian this is a relatively painless way to get started. Going to class 4 hours a week feels like a lot but our section ended up getting pretty close by the end of the semester! I'm definitely planning on taking Ab. While this class doesn't have a ton of work, it comes pretty regularly, so there isn't a ton of flexibility for getting things done on your own time. If you have other classes that are more regularly (as opposed to periodically) demanding, you might want to consider how to manage your time schedule. Relatively low workload, high reward: understanding Italian.","Italian is a cool but not very useful language, and it will take more than just an intro course to become proficient.","John Welsh is a good teacher. Not sure if there is better, but you will not go wrong with him.","Class is both engaging and informative.","This is a great class that is an effective and fun way to learn Italian. I loved starting my day with it. As an HDRB concentrator, almost all of my classes so far have been large lectures. I enjoyed having a small class with lots of interaction. Each class was different and the lessons were effective. I had a great time in this class. I felt like I learned things but it was very low stress and balanced the rest of my schedule well.","I really enjoyed this class! You really get an opportunity to immerse yourself in Italian for an hour 4 times a week, and you get to explore language, music, and culture in an awesome way.","This class was engaging and fun, difficult though.","Its really fun and a cool language","Please make sure you shop all the sections that might potential fit your schedule. Keep in mind that the class is taught completely in section, and not all Harvard graduate students teach well! I had to learn everything from the textbook and still go to class for four hours a day. It was extremely frustrating. Also, make sure you get enough feedback on your work. Email your TF if he\/she is not giving you back your homework assignments, tests, and quizzes. \nI had experiences in learning two other foreign languages prior to taking this class. I would simply suggest self-teaching the basics and enroll in an intermediate level class if you're motivated enough to do so.","Shop all TFs to find one you can learn best from. Also review the material your going to learn the next day the night beforehand.","Be careful which TF you chose since they can make all of the difference in what kind of experience you will have throughout the semester","Italian is a beautiful language, and the class itself is great! Ceil is a wonderful TF, and the class itself is intimate and fun. I just wanted to hop on a plane and fly to Italy after every class. The assignments are also generally fun, but some could be annoying and too long. However, keep in mind that this is not an easy class and is a very decent amount of work. I would highly recommend everyone pick up Italian as a language, though; it really is beautiful!","If you are looking to satisfy a language requirement or become a more interesting person, Italian is a fun way to do so! The language and culture is beautiful, the class is engaging and well taught, and if you have already studied other romance languages nothing here will surprise you.","Be prepared to do almost all of the learning on your own, as you will not learn much in class if you are not able to understand or get feedback from your instructor.","This class was fine - a solid introduction to Italian (which, by the way, is a beautiful language). There were some assignments where it was unclear what the educational value was relative to the required effort. Still, class was not too stressful, and usually fun. I wish there had been some way to know that the textbook for this class basically non-negotiably costs $200+ (it's important to buy it new because it comes with a code for a mandatory online workbook) - it was a source of stress once I had already enrolled in the class, and I might not have taken it in that case.","very engaging class. not too hard but requires a lot of energy to keep up with activities during and out of class.","There is a fair amount of busy work in this class, and not having spoken a Romance Language it was a bit difficult at times, but I enjoyed the class."]},"Spring '15":{"comments":["Take a language class!","Great class! A decent amount of work. You will always be doing something small (1-2 hours) for this class but its good. Definitely take it, Julianne (the section preceptor) is so so so wonderful. You will have a good time with this class, I promise.","This class changed a significant amount of my future for the better. Julianne made me go from wanting to drop the class my first day to falling in love with Italian and deciding to study abroad in Italy next spring. Yes, it is overwhelming at first if you don't speak any other romance languages already, but the work you put in goes so far and lasts far after the class ends. Amazing experience! Also, Julianne is incredibly inspiring as a person and teacher.","This course was a really interesting, in-depth, and complete introduction to the Italian language, as well as quite a bit of Italian culture. It was fun, challenging, sometimes confusing, but mostly a positive experience.","Class: very helpful, and Julianne is such a great teacher\r\nAssignments: very doable and helpful in learning the language","Very hard without very strong\/or near fluent background in a Romantic language, classmates are very competitive, many of whom already have a background in Italian.","The course is a great way to learn some Italian that you can use if you travel abroad! Julianne was an excellent TF and made the class super enjoyable, despite its difficulty."]},"Spring '16":{"comments":["This course is very accessible for anyone who possesses the desire to learn a new language, even without previous experience.","It is challenging but not structured to be difficult in a tedious way - the difficulty is in actually cementing the language in your brain. The assignments are usually short and sweet. It's a great beginner course.","Italian is an amazing language to try at college.","I really enjoyed this class because I learned so much along the way, and enjoyed every minute of it. Through music videos, events, and interactive activities, I learned the basics of Italian.","Take this class with Matt Collins if at all possible. Great community, great learning, fantastic fun.","Definitely take this course, especially if you are studying abroad in Italy!","If you have to fulfill a language requirement and are interested in studying a Romance language, TAKE THIS CLASS! I loved learning how to speak such a beautiful language, and the class itself is rigorous but not painful at all! Italian class was the highlight of my day each day. However, Matt will not be teaching this class next year, so maybe shop it to see how the instructor is, because Matt truly is da bomb.","If you want to learn Italian at moderate pace and become relatively fluent in the language, this definitely a phenomenal course to take."]},"Spring '17":{"comments":["It's a good class, and DiSalvo is a very nice and level-headed teacher. Just be aware that tests are graded more harshly than you would expect from the style and pacing of section. Also, the online textbook (where most of the homework is done) can be annoying to use.","This is an incredible class to take at Harvard, and although it is a lot of work and effort, Mary is an amazing instructor and made the class very very great.","This is a wonderful class! If you are looking to fulfill a language requirement, this could be a great option. If you are planning to take it as an elective, though, be aware of the potential work load. We had nightly assignments that took between 30-60 minutes depending on how fast your work and weekly assessments. This course (like many other intro language courses at Harvard) moves very quickly. In one semester, you will cover the equivalent of 2 years of high school level language instruction. It is helpful if you have studied latin or a romance language before.","The course will definitely teach you a lot of grammar and vocabulary if you choose to put in the time and effort it takes to learn them. However, the way the assessments are set up â€“Â especially major tests\/midterms â€“Â there is not a lot of incentive to memorize the vocabulary\/etc. with great detail, so it is easy to slip between the cracks. Take this if you want to learn Italian and will be intrinsically motivated.","I spent a summer in Italy and came back really wanting to learn the language, and I am so glad I took this course. Mary was a great teacher, and the course ended up being a fun and relatively low stress (thought you do have to put in effort, obviously) counterpart to my concentration courses. I would highly recommend! I felt like I learned a lot in a short period of time, and am looking forward to continuing with my studies next year."]}},"mostRecentQ":{"overall":"4.00","workload":"7.40","difficulty":null,"recommendation":"4.20","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"ITAL Aa","course_id":"4415","cat_num":"4309","1s":"0","2s":"2","3s":"2","4s":"1","5s":"2"},"QWorkload":{"number":"ITAL AA","course_id":"4415","cat_num":"113814","1s":"4","2s":"6","3s":"2","4s":"0","5s":"0"}},"success":true}