{"scores":{"Spring '14":{"course_score":{"overall":"3.90","workload":"2.20","difficulty":"2.30","recommendation":"4.30","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"0","2s":"1","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"8","3s":"0","4s":"0","5s":"1"}},"instructor_scores":[{"number":"PORTUG Ba","cat_num":"0514","course_id":"4445","year":"2013","term":"2","id":"236617a38a87bad4c9b9fc047b741407","first":" Guilherme Trielli","last":"Ribeiro","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '13":{"course_score":{"overall":"4.15","workload":"1.92","difficulty":"2.54","recommendation":"4.31","enrollment":"21","response rate":"61.90","QCourseOverall":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"0","2s":"1","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"8","3s":"0","4s":"0","5s":"1"}}},"Spring '12":{"course_score":{"overall":"4.10","workload":"1.76","difficulty":"2.14","recommendation":"4.24","enrollment":"37","response rate":"81.08","QCourseOverall":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"0","2s":"1","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"8","3s":"0","4s":"0","5s":"1"}}},"Spring '11":{"course_score":{"overall":"4.55","workload":"1.69","difficulty":"2.07","recommendation":"4.66","enrollment":"37","response rate":"78.38","QCourseOverall":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"0","2s":"1","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"8","3s":"0","4s":"0","5s":"1"}}},"Spring '10":{"course_score":{"overall":"4.84","workload":"2.25","difficulty":"2.55","recommendation":"4.80","enrollment":"26","response rate":"80.77","QCourseOverall":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"0","2s":"1","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"8","3s":"0","4s":"0","5s":"1"}},"instructor_scores":[{"number":"PORTUG Ba","cat_num":"0514","course_id":"4445","year":"2009","term":"2","id":"b59195749224ca9830d6ff9b5a29e43d","first":"Clemence","last":"Jouet-Pastre","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.71","AccessibleOutsideClass":"4.86","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.75"}]},"Spring '09":{"course_score":{"overall":"4.58","workload":"1.96","difficulty":"2.41","recommendation":"4.74","enrollment":"30","response rate":"93.33","QCourseOverall":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"0","2s":"1","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"8","3s":"0","4s":"0","5s":"1"}}},"Spring '08":{"course_score":{"overall":"4.47","workload":"1.87","difficulty":"2.20","recommendation":"4.55","enrollment":"43","response rate":"69.77","QCourseOverall":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"0","2s":"1","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"8","3s":"0","4s":"0","5s":"1"}}},"Spring '07":{"course_score":{"overall":"4.42","workload":"1.80","difficulty":"2.68","recommendation":"4.64","enrollment":"39","response rate":"66.67","QCourseOverall":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"0","2s":"1","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"8","3s":"0","4s":"0","5s":"1"}}}},"comments":{"Spring '08":{"comments":["This class is a fun respite from a busy academic schedule.","It's a good introduction to Portuguese. Lab classes are important to improve conversation (are optional but it's an excellent oppotunity to practice)","It's interesting and painless.","Voces vao aprender tanto!","It is a great way to learn a new language! You are pushed to learn, but never feel overwhelmed.","This class will give you the groundwork to speak with Brazilians and travel in Brazil!","A great introduction to the language and cultures of the portuguese speaking world.","This is a good introduction to Portuguese language.  Some background in a Romance language is necessary to get the full benefit of this course as there is a certain amount of assumed understanding.","This is a great class and the Portuguese language is a lot of fun to learn. You also learn it quickly.","This class is not an insubstantial amount of work, but it is not terribly challenging (especially for those with some Romance language familiarity) and a wonderful way to learn a lot of Portuguese in a short time.","If you know Spanish this is an easy class that can help you get a basic proficiency in Portuguese.","I learned a lot from this class with very little work.","it's an easy A and lots of fun","Portuguese is a fun language and you will learn a lot about the culture of Brazil, I'm just skeptical you will be able to remember the material that is covered because it is not emphasized or drilled well.","great class to learn portuguese. teacher was excellent!","be prepared to move fast, and learn quickly. make sure you have the time to put in the extra effort.","Sections are actually enjoyable. Despite the fact that they are longer than the standard - two hrs instead of one - they go by very quickly.","take this class with Nilma.. she is absolutely awesome."]},"Spring '09":{"comments":["Professor Nilma is incredibly kind and maintains a fun, friendly, open class environment.  The class is a great introduction to the Portuguese language and moves at a quick pace.  However, you should not expect to be able to speak about complex topics by the end of it.","Nilma is so friendly, funny, open, helpful - so is the course head, Clemence!!!","This is a fun class that allows students to learn a great deal quickly without all of the stress of other intensive language courses.","be prepared to sit in a room full of students with strong spanish backgrounds","Nilma Dominique is the best language teacher I have had at Harvard.","A great course.  You will progress the fastest if you are diligent about keeping up with the workbook and lab exercises before each class.","It's a fun course, but it's basic.","As long as you put the time and work into this class, the rewards are incredible. I would never have dreamed of learning to speak a new language, one I didn't even know how to say \"yes\" or \"no\" in until the first day of class, so quickly.","Stay on top of the work","I would tell them that it is fun and easy to manage.","Plan time for assignments\r\nThere will sometimes be 2 assignments\/test per week","Buy the recommended books too.  Also do the work on the day it's assigned so as not to fall behind.  This course moves super fast.","This course is a great (and fast paced) introduction to Portuguese.  The small classroom size and excellent teaching helped me achieve a steep learning curve.","This class is fun, relaxed, and interesting.","The class is so fun and really well paced. It is easy enough to take as a 5th course.","It's very fun and produces a practical skill. Also, Nilma is the best TF.","Very good class for basic Portuguese skills. If you want to learn more, take a full year course.","It's so fun!"]},"Spring '10":{"comments":["Grading is very fair - if you do the work and study a reasonable extent you will get an A. The only negative is that the course can be quite time consuming.","Enjoy Portuguese","The class is fun, fast-paced and good to take for those who already know a romance language.","have fun and an open mind!","If you want a comprehensive introduction to the Portuguese language, there is no better way to achieve this. While the pace of the course is challenging, the final product, with the right amount of dedication, is rewarding.","Portuguese Ba is a great way to start learning the language with supportive and enthusiastic professors.","this is the only class where EACH TIME I'd walk out of the classroom with a smile.","Go to the tutoring center to practice speaking.","start the licoes early, they take a while sometimes, watch the videos over and over again","it is really fun and you will be so amazed at how much you learn and how quickly you learn it","Be careful -- Professor Jouet-Pastre's enthusiasm for Portuguese is contagious!  You run the risk of falling in love with the language by taking her course!  Also note that the course is designed to be iterative, but if you happen to fall behind one week, the professor does a great job reviewing and repeating material in a way which level-sets the class without feeling redundant.","This class is amazing. So much fun and little stress. Great for senior spring."]},"Spring '11":{"comments":["If you want to become fluent in Portuguese with this class, you can do it.  However, if you just go through the motions, you will leave not feeling satisfied.","this class is incredibly fun and relaxed. you will learn Portuguese pretty well without even working too hard. we had to teach ourselves grammar outside of class, but it really isn't too hard. take it.","If you have any interest in the Portuguese language\/culture, definitely recommended!","This course was a lot of fun and the tfs' excitement about Portuguese and Brazilian culture is contagious!","ana paula is the best! definitely take this class. it's easy, fun, and you learn a lot.","you're not going to learn a TREMENDOUS amount, but it's a pretty nice class to take. it's not really that intensive, but you do learn, and it's pretty enjoyable.","It is the most fun class, i looked forward to it every week. Ana Paula is the best teacher it is a shame she can't teach for the next two years. Although the content of the course does speak for itself.","Take this class! Portuguese is such an easy language to learn if you know a little bit of spanish already, plus there is always something going on at Harvard, in Cambridge, and in Boston that has to do with Brazilian culture. You will be amazed at how quickly you learn!","Portuguese Ba is simply too easy, covering little material for a class billed as more intensive.  If you're looking for an easy class and an easy A and have a background in another romance language, take it. If you're looking to learn a language, look at other Portuguese offerings or other languages.","Ana Paula is the sweetest person and such a fun teacher.  At the same time you will learn a lot of portuguese and about Brazilian culture.","It's a great course! It mimmicks immersion in the way it's taught and you come out with a very satisfactory result in your language ability.","TAKE THIS CLASS! The TFs were awesome and it's a fun language to learn. It's totally not like Spanish though, so be advised.","This is a fun, easy class. I refer to it as Portuguese for seniors since it doesn't require an intense review of grammar, it meets in the afternoon, and it only meets twice a week.","This was the most amazing class. Ana Paola is incredible. She cares so much for her students and our class had the most incredible, supportive, fun environment. All of the students were always helping each other. Also, Portuguese is so much (especially if you already speak Spanish). It is so much fun to learn all about Brazil and to improve so quickly. I was so sad on the last day of class because it was such a fun semester.","Portuguese Ba is really fantastic. Make sure you get a good TF, but it's a fast-paced, fun introduction to Portuguese. Take it!","it was really fun!","A good introductory class, pretty easy and fun .","Great class! TFs are generally flexible with you in regards to assignments and you wont regret taking it at all. The Portuguese TFs are very welcoming and warm with students, and this causes a great atmosphere in class."]},"Spring '12":{"comments":["This course is a great way to get through beginner's portuguese however do not expect to be able to speak Portuguese upon completion. Heloisa is great yet kind of scattered. Class is entertaining, but often feels like you're not getting enough out of your time invested in the classroom. Still take it though.","You WILL learn Portuguese. The 2-hour section is incredibly long, and it's immersion-style teaching so you don't really do grammar. But you will learn Portuguese.","It's really easy, but you won't get much better at Portuguese.","Great class! I definitely feel like I learned a lot of Portuguese!","The best language class you could take at Harvard. 2 hour classes twice a week is a blessing; you get familiar with the sound of the language very quickly. If you're on the fence about this... TAKE IT.","Very fun class. There is obviously work involved, but nothing overwhelming. The 2 hour classes usually go by pretty fast too.","Take this course if you would like to go abroad.","This class is an incredibly easy intro to an awesome language and the culture of Brazil, great senior spring elective.","Class itself was pretty easy and if you make an effort you can learn a lot. but they make it very easy for you to not make an effort.","This is a good and fun experience for gaining a basic familiarity with the language.","Learn a lot of culture and portuguese and it's very enjoyable!","Requires a lot of commitment out of class to get the most out of it.","It is very helpful, I feel much more knowledgeable about navigating in Portuguese-speaking countries, it was a great introductory course.","If you want to learn portuguese take this course. If you know spanish it'll make it very easy to pick up the language.","This is a good course in that you learn a fair amount of portuguese in a small amount of time! Awessome! But, the lack of flow between the chapters...inother words, the lack of a cultural frame to use and think about the words we where learning made it feel like I was just memorizing instead of actually using the language in class. I would have really liked to have more creative projects and to have been exposed to a greater extent to brazilian culture. i think that this lack of being able to \"own\" the language by using in ways that you didn't expect hurt my experience in the class.","The course is a great way to begin studying portuguese.  No previous experience is required and the course is set up to teach just the basics, and a little more."]},"Spring '14":{"comments":["You will get an A.","This is a great, chill class! Very nice tfs, great environment, and you will learn a lot of Portuguese!","Portuguese is a great language and the department allows you to learn it in a relatively stress free environment.  Even if this is a 5th, 6th course, I recommend it without hesitation.  It's easy but you'll still learn the language.","Take this class seriously because you can really learn a lot of Portuguese and a lot about Brazilian culture."]}},"mostRecentQ":{"overall":"3.90","workload":"2.20","difficulty":"2.30","recommendation":"4.30","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"0","2s":"1","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PORTUG Ba","course_id":"4445","cat_num":"0514","1s":"1","2s":"8","3s":"0","4s":"0","5s":"1"}},"success":true}