{"scores":{"Fall '15":{"course_score":{"overall":"5.00","workload":"4.00","difficulty":null,"recommendation":"5.00","enrollment":"3","response rate":"66.67","QCourseOverall":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"0","2s":"0","3s":"0","4s":"0","5s":"2"},"QDifficulty":{"number":"IRISH 132","course_id":"453","cat_num":"6725","1s":"0","2s":"0","3s":"3","4s":"2","5s":"0"},"QWorkload":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.70","workload":"4.00","difficulty":null,"recommendation":"5.00","enrollment":"3","response rate":"100.00","QCourseOverall":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"0","2s":"0","3s":"0","4s":"0","5s":"2"},"QDifficulty":{"number":"IRISH 132","course_id":"453","cat_num":"6725","1s":"0","2s":"0","3s":"3","4s":"2","5s":"0"},"QWorkload":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.40","workload":"2.20","difficulty":"3.40","recommendation":"4.00","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"0","2s":"0","3s":"0","4s":"0","5s":"2"},"QDifficulty":{"number":"IRISH 132","course_id":"453","cat_num":"6725","1s":"0","2s":"0","3s":"3","4s":"2","5s":"0"},"QWorkload":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"IRISH 132","cat_num":"6725","course_id":"453","year":"2013","term":"1","id":"6fad88adea9109ffd34edb0c6b7879a8","first":" Tomas","last":"O Cathasaigh","InstructorOverall":"3.30","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.00"}]},"Fall '12":{"course_score":{"overall":"4.83","workload":"2.50","difficulty":"3.33","recommendation":"4.83","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"0","2s":"0","3s":"0","4s":"0","5s":"2"},"QDifficulty":{"number":"IRISH 132","course_id":"453","cat_num":"6725","1s":"0","2s":"0","3s":"3","4s":"2","5s":"0"},"QWorkload":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.33","workload":"3.67","difficulty":"4.00","recommendation":"4.00","enrollment":"4","response rate":"75.00","QCourseOverall":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"0","2s":"0","3s":"0","4s":"0","5s":"2"},"QDifficulty":{"number":"IRISH 132","course_id":"453","cat_num":"6725","1s":"0","2s":"0","3s":"3","4s":"2","5s":"0"},"QWorkload":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '11":{"comments":["You will enjoy the support of an energetic and invested instructor who is committed to your understanding and appreciation of the Irish language and related cultural context.  You will also likely enjoy the language itself, which is hard enough to elicit sardonic resignation at times but which also proves quite rewarding once understanding is achieved.  I would recommend Irish 132 to anyone interested in studying an interesting, challenging language.  I also would be aware of the commitment in time you may have to make, which could range from 10-20 hours a week, depending on your own facility  with language acquisition.","Taking a considerably rare language with such experienced instructors and in such a small setting is not an opportunity you should pass up\/","This class is really dense. They teach you a lot of stuff over a very short amount of time. Every day is a new tense or a new something. It's definitely not an easy class, and in some ways it's almost too dense for an introductory class."]},"Fall '12":{"comments":["Don't take this course looking for an easy way to coast through the language requirement. Chances are Irish isn't like any language you have studied before, and doing well in the course requires a significant time investment. If you are genuinely interested in the language and culture, however, this class will give you a solid foundation.","Irish is one of the most rewarding languages to learn, despite its difficulty. You are guaranteed a very personalized learning experience and a small class size. If you are considering Irish, DO IT.","Such an interesting and complex language, but Matthew makes it go down easy! Highly recommend this course with him.","This is a fantastic class. Small class, so you get a lot of individual help and attention, even in class time. Matthew Holmberg is a great teacher, always open to questions, and his explanations of idioms and various aspects of Irish culture are one of the highlights of the class.","I strongly recommend this course - AS LONG as you take it with a friend or someone you can study with. Taking it alone would have been a lot more stressful!"]},"Fall '13":{"comments":["This class is great! A lot of language classes are pretty large, but in this class you get a small group so you can actually bond with students and the TF, who is fantastic by the way. Plus you get to really surprise people when they ask you what you're studying and you say \"Irish\"","I would recommend it wholeheartedly only to those students prepared to work hard to learn a new language. Irish is very difficult, so a lot of effort and determination will be needed to pass, but it's worth it!","If you are willing to put the work in, this can be a great class. Matthew is a very fun TF, and you will likely have a small class size, which means you will really learn a lot. The course requires you to spend a lot of time outside the classroom learning the language, so it is not the easiest way to get through the language requirement; but nonetheless, I would definitely recommend it to anyone with an interest in Irish.","This class is something that you'll probably either really love or really hate. But the grading is more than fair and the class is fun."]},"Fall '14":{"comments":["Irish may not be the most practical language, but it's fun to learn. I'm going to continue taking the language. Also, Kathryn is a really good teacher.","This may vary from person to person, but for me the language didn't really start to \"click\" until about halfway through the course, so it can be a bit of a struggle to get started. Once it did, though, it was incredibly rewarding and I strongly recommend anyone with even a passing interest in Irish to take this class.","This course is well taught and gives you a solid base in the Irish language. It also mixes in lessons about Irish culture."]}},"mostRecentQ":{"overall":"5.00","workload":"4.00","difficulty":null,"recommendation":"5.00","enrollment":"3","response rate":"66.67","QCourseOverall":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"0","2s":"0","3s":"0","4s":"0","5s":"2"},"QDifficulty":{"number":"IRISH 132","course_id":"453","cat_num":"6725","1s":"0","2s":"0","3s":"3","4s":"2","5s":"0"},"QWorkload":{"number":"IRISH 132","course_id":"453","cat_num":"119128","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"}},"success":true}