{"scores":{"Fall '12":{"course_score":{"overall":"4.13","workload":"1.39","difficulty":"2.00","recommendation":"4.42","enrollment":"35","response rate":"88.57","QCourseOverall":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"0","2s":"2","3s":"4","4s":"13","5s":"12"},"QDifficulty":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"8","2s":"16","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"20","2s":"10","3s":"1","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"3.85","workload":"1.32","difficulty":"2.45","recommendation":"4.30","enrollment":"23","response rate":"86.96","QCourseOverall":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"0","2s":"2","3s":"4","4s":"13","5s":"12"},"QDifficulty":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"8","2s":"16","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"20","2s":"10","3s":"1","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"3.31","workload":"1.59","difficulty":"2.31","recommendation":"3.61","enrollment":"49","response rate":"95.92","QCourseOverall":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"0","2s":"2","3s":"4","4s":"13","5s":"12"},"QDifficulty":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"8","2s":"16","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"20","2s":"10","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"E&M-REASON 15","cat_num":"5707","course_id":"1972","year":"2010","term":"1","id":"fc7ab7bde087f3972832115ec0b96a34","first":"Karin B.","last":"Michels","InstructorOverall":"3.52","EffectiveLecturesorPresentations":"3.53","AccessibleOutsideClass":"2.89","GeneratesEnthusiasm":"3.64","FacilitatesDiscussionEncouragesParticipation":"3.83","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"3.90"}]}},"comments":{"Fall '10":{"comments":["This is not a rigorous, analytical course. Rather, this is a basic introduction to the methods and topics of public health and epidemiology, which are areas that just don't get covered elsewhere in most people's educations. I found the topics very interesting, and the lectures were always engaging. Part of what made the lectures so engaging was Professor Michels' excellent command of interactive style--she bans laptops in class, and I personally think that that is a good policy. Overall, I recommend the course, especially for people with a heavy load in other classes who want a lighter class that will still teach them something.","Good to take if you need to complete math requirement but do not like math","I was looking for a really easy QR core, and this was definitely that! But if you're looking for a really exciting QR core, this is not your best bet.","easy but boring","Easy class if you need an easy class to take. However, the subject matter isn't particularly interesting unless you are sure you have an interest in epidemiology. The class is mostly just learning about different study designs and learning the calculations that go along with them.","Very interesting","Lectures can be a little dry at times, but this class is probably the easiest class I've ever taken at Harvard. Take it. For sure.","You need to do the reading.","This course is ridiculously easy and super painless. Just take it.","Class with some very interesting material, but a wealth of material that is also tedious and forgettable","The Professor is very good, but she is too full of herself. You do not always want to hear how she is great friends with every eminent epidemiologist in the world and how high - powered her career is and how she needs two mobile phones. Also, the guest lecturers are similarly arrogant and love putting students in a spot (esp the DAGs guest lecturer). The TFs more than make up for it. They are friendly, helpful and always readily available and responsive.","Interesting survey class for anyone interested in public health.","This is a painless way to complete your QR!","This class had days which were interesting, but a lot of times lecture and section were long and pretty boring.","Not a very difficult class if you like statistics although lectures are kind of boring","Great and easy class to take.  Useful information about how studies are conducted.","pointlessly easy class which does not provide an easy grade, rather it's only time consuming","Easy way to take care of math requirement. Material is generally interesting. Chances for extra credit.","Painless course","This class is excellent for those looking to fulfill a QR and looking for a class without a lot of math. The class is interesting. If you engage in the class, attend every section (which is mandatory), you will do very well. I studied < 5 hours total for the final exam and felt totally ready for it. Did I mention you learn valuable information about health for the rest of your life (it could even help you to extend your life!)?","If you need a QR or EMR, this is a relatively painless way to get it done. Also, I definitely took some knowledge away from it that I think will be useful in real life.","Medical Detectives is supposed to be an interesting and relatively easy alternative to a math requirement.  It was neither interesting nor relatively easy.  The class is slightly difficult because it is poorly taught, not because the material is tough to understand.  I would almost have preferred taking something like Stat 100 to fulfill my math requirement.  You can take this class and you will be fine, but you certainly won't learn anything.","This class is an easy one to take for the math general education requirement","This isn't a bad way to get your EMR core out of the way, if you can't find anything else. The teaching staff are enthusiastic and readily available and that makes a big difference.","This is a great course for people who are afraid of math classes. I walked away from this course feeling much more like a mathematician, with confidence boosted, than when I started the semester."]},"Fall '12":{"comments":["take this to fulfill EMR requirement. It is very easy yet useful for practical application in daily lives!","Class was a lot of fun!","Take this class! Very painless and easy. I would suggest starting the psets a little early in order to ask questions, because they can be a little confusing. Overall this class was pretty good. Easy subject material, just painstakingly long class time. If you have problems concentrating for more than 40 minutes, I would not suggest this class.","It's a great class- a great balance between learning a lot but also having a light workload. Also, the TF is absolutely amazing and wonderful.","Class escalates in difficulty as semester goes on. Lots of nitpicky formulas to memorize and utilize for public health measures and statistical implementation. Final project is very interesting and applies many statistical methods learned throughout the semester.","This is a great class where you learn a good amount about public health. Ida is a great TF and very nice. It's a shame the class won't be offered again.","Very interesting and rewarding class.","It is a super easy way to fulfill your EMR credit, but it really is uninteresting. The lectures are ridiculously dry and long and while the staff is extremely nice and sections are wonderful, it is really still not enough to save the course as a whole.","Generally painless GenEd. Not the most interesting or engaging, but never pointless or arbitrary.","Very painless way to meet a requirement or a harmless elective that also has some interesting material.","The course is a very easy but educational introduction to the world of medical research.  You don't have to have any science\/medical\/math\/stat background to take it, though, and it gives some great analytical skills too.  I wish it had been more challenging, but it was still a great course with a very skilled TF.","You will leave this class with a pretty good understanding of how health studies are conducted, and if you're math-phobic, you should definitely take this.","This is quite a good class, and its sections and lectures combine well. You will come away having learned something significant. The things you memorize or work through make sense.","Awesome class. Dr. Michel is a great teacher and the class material is interesting. Definitely a must take class."]}},"mostRecentQ":{"overall":"4.13","workload":"1.39","difficulty":"2.00","recommendation":"4.42","enrollment":"35","response rate":"88.57","QCourseOverall":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"0","2s":"2","3s":"4","4s":"13","5s":"12"},"QDifficulty":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"8","2s":"16","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"E&M-REASON 15","course_id":"1972","cat_num":"5707","1s":"20","2s":"10","3s":"1","4s":"0","5s":"0"}},"success":true}