{"scores":{"Spring '17":{"course_score":{"overall":"4.50","workload":"3.50","difficulty":null,"recommendation":"4.80","enrollment":"10","response rate":"40.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["This is an amazing course for anyone interested in clinical psychology or more specifically eating disorders. There are weekly readings and thought papers however they were interesting enough not to be bothersome. The instructor is also amazing!","The workload is very high but the content is interesting.","This is a gem of a class. Rebecca is an amazing professor. Class felt like an environment for exploration, where we could really dig into an dissect these topics comfortably. She gives a ton of feedback on assignments and is incredibly accessible. (I even went to her when I was torn between summer plans and she was an incredible guide.) She is also a clinician, and it is incredibly valuable to hear about her personal experience with patients. Be prepared to discuss some topics that can be difficult at times, but I can assure you that this class was SO rewarding, if you have an interest in clinical psych.","This is a great class about an often stigmatized and mis-understood disorder--I would recommend taking it if you have any interest at all in better understanding eating disorders and how to treat them."]}},"mostRecentQ":{"overall":"4.50","workload":"3.50","difficulty":null,"recommendation":"4.80","enrollment":"10","response rate":"40.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}