{"scores":{"Fall '15":{"course_score":{"overall":"4.20","workload":"3.70","difficulty":null,"recommendation":"4.60","enrollment":"16","response rate":"81.25","QCourseOverall":{"number":"PSY 980V","course_id":"13330","cat_num":"119716","1s":"0","2s":"0","3s":"3","4s":"3","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980V","course_id":"13330","cat_num":"119716","1s":"3","2s":"6","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '15":{"comments":["You can get by with little effort in this class, but you won't get much out of it unless you do the reading, blog posts etc.","This is SUCH an eye-opening class and the way that it's structured allows for the class members (including professor and students) to bond and engage in open-minded discussion. Truly a gem of a class!","Learned an incredible amount in this class; thing's that have changed the way I see the world and understand people. Manageable workload; engaging discussion; interesting lectures; great teacher. Really nothing not to like about it.","This is a wonderful course where you get to view the differences between the rich and the poor in regards to their psychology and behavior. By the end of the course, I felt I had a much better grasp and motivation to combat socioecononomic inequality in the United States. The class is small, so you have plenty of opportunities to voice your opinion in discussion. The courseload is reasonable, and as long as you plan according to the syllabus, you should be fine. I was particularly grateful for how much the course followed the syllabus, and I was able to get all the readings done ahead of time as well as my weekly assignments. The group project can be difficult and frustrating if your group members are not very responsive or hardworking, but with careful planning and strong communication, I think those barriers can be overcome. The lecture component is a very small part of class time, so if you are not interested in discussion-based classes, then this might not be the class for you. However, I overall had a positive experience with this course and would recommend it for this who are interested in studying socioeconomic status through a psychology lense.","This class was without a doubt my favorite class at Harvard so far. Sasha was incredible, and the material I learned was very applicable outside of the classroom. It was not a very difficult course, but it required an honest effort and it made you think critically about very important and often controversial issues. I am very grateful to have made the lottery!"]}},"mostRecentQ":{"overall":"4.20","workload":"3.70","difficulty":null,"recommendation":"4.60","enrollment":"16","response rate":"81.25","QCourseOverall":{"number":"PSY 980V","course_id":"13330","cat_num":"119716","1s":"0","2s":"0","3s":"3","4s":"3","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980V","course_id":"13330","cat_num":"119716","1s":"3","2s":"6","3s":"0","4s":"0","5s":"0"}},"success":true}