{"scores":{"Fall '15":{"course_score":{"overall":"4.50","workload":"5.50","difficulty":null,"recommendation":"4.50","enrollment":"31","response rate":"87.10","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.60","workload":"7.70","difficulty":null,"recommendation":"4.60","enrollment":"35","response rate":"97.14","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHNSE Bx","cat_num":"7066","course_id":"757","year":"2014","term":"1","id":"719228363c817de62997e5f43c6aa505","first":" Emily","last":"Huang","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Fall '13":{"course_score":{"overall":"4.20","workload":"3.30","difficulty":"3.40","recommendation":"4.40","enrollment":"34","response rate":"94.12","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHNSE Bx","cat_num":"7066","course_id":"757","year":"2013","term":"1","id":"719228363c817de62997e5f43c6aa505","first":" Emily","last":"Huang","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.30"}]},"Fall '12":{"course_score":{"overall":"4.40","workload":"3.10","difficulty":"3.33","recommendation":"4.48","enrollment":"43","response rate":"97.67","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHNSE Bx","cat_num":"7066","course_id":"757","year":"2012","term":"1","id":"719228363c817de62997e5f43c6aa505","first":"Emily","last":"Huang","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.56","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.85","FacilitatesDiscussionEncouragesParticipation":"4.51","GivesUsefulFeedback":"4.59","ReturnsAssignmentsinTimelyFashion":"4.76"}]},"Fall '11":{"course_score":{"overall":"4.56","workload":"2.98","difficulty":"3.18","recommendation":"4.60","enrollment":"48","response rate":"93.75","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHNSE Bx","cat_num":"7066","course_id":"757","year":"2011","term":"1","id":"719228363c817de62997e5f43c6aa505","first":"Emily","last":"Huang","InstructorOverall":"4.66","EffectiveLecturesorPresentations":"4.56","AccessibleOutsideClass":"4.65","GeneratesEnthusiasm":"4.89","FacilitatesDiscussionEncouragesParticipation":"4.79","GivesUsefulFeedback":"4.76","ReturnsAssignmentsinTimelyFashion":"4.73"}]},"Fall '10":{"course_score":{"overall":"4.60","workload":"3.26","difficulty":"3.34","recommendation":"4.49","enrollment":"37","response rate":"94.59","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHNSE Bx","cat_num":"7066","course_id":"757","year":"2010","term":"1","id":"719228363c817de62997e5f43c6aa505","first":"Emily","last":"Huang","InstructorOverall":"4.54","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.15","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.69","GivesUsefulFeedback":"4.44","ReturnsAssignmentsinTimelyFashion":"4.83"}]},"Fall '09":{"course_score":{"overall":"4.57","workload":"3.17","difficulty":"3.30","recommendation":"4.57","enrollment":"31","response rate":"96.77","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHNSE Bx","cat_num":"7066","course_id":"757","year":"2009","term":"1","id":"719228363c817de62997e5f43c6aa505","first":"Emily","last":"Huang","InstructorOverall":"4.73","EffectiveLecturesorPresentations":"4.63","AccessibleOutsideClass":"4.33","GeneratesEnthusiasm":"4.73","FacilitatesDiscussionEncouragesParticipation":"4.72","GivesUsefulFeedback":"4.59","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Fall '08":{"course_score":{"overall":"4.44","workload":"2.81","difficulty":"3.39","recommendation":"4.31","enrollment":"43","response rate":"88.37","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHNSE Bx","cat_num":"7066","course_id":"757","year":"2008","term":"1","id":"719228363c817de62997e5f43c6aa505","first":"Emily","last":"Huang","InstructorOverall":"4.69","EffectiveLecturesorPresentations":"4.42","AccessibleOutsideClass":"4.49","GeneratesEnthusiasm":"4.89","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.44","ReturnsAssignmentsinTimelyFashion":"4.85"}]},"Fall '07":{"course_score":{"overall":"4.50","workload":"2.42","difficulty":"2.73","recommendation":"4.62","enrollment":"42","response rate":"64.29","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHNSE Bx","cat_num":"7066","course_id":"757","year":"2007","term":"1","id":"719228363c817de62997e5f43c6aa505","first":"Emily","last":"Huang","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.58","AccessibleOutsideClass":"4.36","GeneratesEnthusiasm":"4.73","FacilitatesDiscussionEncouragesParticipation":"4.65","GivesUsefulFeedback":"4.46","ReturnsAssignmentsinTimelyFashion":"4.92"}]},"Fall '06":{"course_score":{"overall":"4.24","workload":"2.58","difficulty":"3.06","recommendation":"4.56","enrollment":"51","response rate":"70.59","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHNSE Bx","cat_num":"7066","course_id":"757","year":"2006","term":"1","id":"719228363c817de62997e5f43c6aa505","first":"Emily","last":"Huang","InstructorOverall":"4.44","EffectiveLecturesorPresentations":"4.41","AccessibleOutsideClass":"4.44","GeneratesEnthusiasm":"4.59","FacilitatesDiscussionEncouragesParticipation":"4.19","GivesUsefulFeedback":"4.32","ReturnsAssignmentsinTimelyFashion":"4.68"}]}},"comments":{"Fall '07":{"comments":["It's too many days a week. I appreciate the material we learned, but I didn't find classtime very helpful. Mostly, what I learned was from the assignments and having to study every week for the dictations.","If you hated Sunday mornings during your childhood because of Chinese school and gave up on it during high school, Bx is for you.","You have to put in daily effort to succeed in this class.","It is so fun!!! Language classes rock because you actually have teachers that know your name and where you are from...","It's a great class but be prepared to do a lot of work.","Make sure you read ahead. It will help you immensely.","For anyone who has some sort of experience in speaking and listening to Chinese but no experience in reading or writing, or if you never learned much from Sunday morning Chinese school, this is a perfect way to fulfill the language requirement, learn something very useful, and have loads of fun at the same time. The teachers are great, and they make the class very enjoyable.","It is a vocab class, though it is not a very intensive or rigorous class. I wish there was a more intensive class, because there are so many courses at Harvard I could be taking.","This class was great and you should take it.","The class allows you to connect to other Chinese students at Harvard, and is a great introduction to students that are able to speak and understand Chinese but can not write or read as well.","Huang laoshi is the bomb! This course is extremely rewarding. You will learn a lot of Chinese while having a lot of fun and making new friends. Although you'll have homework every night, this class is probably the least intensive out of all the Chinese courses offered at Harvard.","This class will improve your Chinese, but it has a lot of grunt-work involved. Be aware that non-heritage speakers may have an especially difficult time, as teachers teach this class for native, fluent speakers.","An excellent and comprehensive beginning course for native speakers.","It was a very enjoyable class and I learned more Chinese than I did in 3 years of chinese school.","This class is fun in that students and instructors share a wonderful personal connection, creating a great learning environment.  The instructors (Prof. Huang and the TFs) are clear, effective, funny (often hilarious), and very approachable. \r\nSome classes (but very few) may seem dull, but they are as exciting as students wish them to be. Students also contribute to the enthusiasm in the classroom, not only the instructor. Preparedness and a willingness to participate are the students' responsibility to make the class fun.","This is a fun and entertaining class to take, but will definitely teach you a lot of Chinese as well.","It is a class you wake up and look forward to attending.","It is amazing. You should definitely take this class."]},"Fall '08":{"comments":["This class is a lot of work.  The level of material is quite advanced.  Be prepared to spend on average 2 - 3 hours a night on homework.  The key is not just to finish exercises, but to understand and be able to use the language. That's the difficult part.","This class is fantastic for improving conversational Chinese. Many Chinese students have some Chinese speaking background, but lack fluency in expression and construct consistently simplistic sentences without understanding how to link ideas. This course allows students to expand their vocabulary and form complex dialogues; whether your goal be to converse with grandparents or read short stories, Chinese Bx will greatly boost your comprehension abilities.","This class is amazing! It's useful, fun, fast-paced but manageable, and you can meet some really amazing people in it. If you're up for a challenge, but really want to learn Chinese, I absolutely recommend this class.","The workload is HUGE, so only take this class if you are willing to work really hard, put in a LOT of time, and have a very strong Chinese speaking\/listening background.","The teachers are excellent, but the expected background knowledge for Chinese is fundamental to the course. The course does its best at teaching students how to read and write.  The homework load is large and sometimes difficult to manage, and keeping pace is stressful, which I wish it wasn't.","This class not only teaches you to write a 1500 character essay by the end of the semester, even if you had only started off with the knowledge of 3 or 4 in the beginning, but it allows you an opportunity to interact with other students with similar cultural background. The class is serious, but it is always fun to struggle through the cultural idioms and ideas, as we joke with one another about the different tones. Overall, this class is definitely worth it, if you are willing to put in the effort.","The professors are really great and we bond very well as a class. The assignments are long and projects are very time consuming, but the class has been a lot of fun.","- Remember how going to Chinese school was uncool, and you felt lucky to not have been forced to go? At the same time, do you want to improve your Chinese language skills now, seeing as how many non-Chinese people seem to be more fluent in your mother tongue? Take this class, you won't regret it.","Make sure to turn in your homework everyday and study for the tests!","Take this only if you actually know a little about characters. I feel like it would be very difficult for someone who has never seen characters before.","take it if you intend on continuing with chinese. your writing skills will improve, but your speaking skills will improve only if you take initiative to speak up in class.","This course was fun.","This class can be challenging if you have little background in Chinese. However, if you come into it with some basic speaking and writing knowledge, you can do well and have fun. Huang laoshi is excellent and the TF's are both helpful and entertaining.","The course is very effective, and I really enjoyed it.","Lots of characters to memorize.","It is a great class but I feel that a lot of students in the class have significant experience with the course material while for others this is their first time being assimilated to it.  It is the best class I took this semester and I would recommend it to everyone!!","Intense course for students who have a good handle on speaking Chinese and a more limited ability to read and write.","if you do your work, you will learn a lot and do well in this class","You should be comfortable listening to and speaking Chinese.","It is a hard class- but definitely worth it!","It's very entertaining and helpful.","It's a great interactive class for native heritage chinese students who are interested in learning a little more about the course. Additionally, the course material is relevant to freshmen, which makes it a win win situation"]},"Fall '09":{"comments":["This class truly makes you feel like a part of something bigger.  I highly recommend it, if you don't mind the work.","This course was my favorite this semester. It requires a fair amount of work and studying, but some of the work is done in groups and can be very fun. The teachers also worked very hard to give fun assignments and organized class activities that also taught us a lot about chinese culture. We also had individual meetings with the teachers every week to work on things that we were having a lot of trouble with.","While the course promotes itself as welcoming of anyone with any language experience, it is still greatly beneficial to have a strong grasp on Chinese. Only the truly motivated should enter this class otherwise.","It's a lot of work, but everything you learn is extremely worthwhile. It's also a very fun class with really great activities.","This is a fantastic course! Huang Laoshi is fantastic and so is Chen Laoshi (TF). You have to work really hard, but you get so much out of this course!","If you would like to learn Chinese, this class will get you well on your way. However, this is a very focused and practical class, so don't expect to get much joy out of doing the readings and work. There will be mild amounts homework almost every day, as well as unrelenting drills in section. In the end however, the satisfaction of having learned so much is worth it, and the teachers work very hard to ensure you learn as much as you can.","This is a great course and the instructors are just absolutely wonderful.","Make sure you have ample chinese background coming in. You should be conversational in Mandarin and able to comprehend everything the professor says in Chinese the first day of class. You will also need some pingying and character recognition, even though the class says you don't need reading\/writing background. Most students do have some of this background, and you might find yourself playing catch-up if you have none.","Huang laoshi and Chen laoshi are the sweetest teachers ever! This class will make you work, but if you're willing to put in the work (hand in homework every day), then you will reap rewards in the form of knowing how to read\/write\/understand\/speak a language that you really should have known as a Chinese person. If you speak perfect Chinese but can't write a word, if you dropped out of Chinese school because you thought you were cool but now realize that you can't get a job in China, if you want to impress your parents\/grandparents by writing a 1000-word essay in Chinese, then this class is for you.","It will be enjoyable if you really have in mind that Chinese is the language that you want to study.","It is a worthwhile class, but be ready to do the work.","your chinese will improve drastically","Be prepared to work every day for this course, and walk all the way to Vanserg, sometimes multiple times in one day.","You learn so much from this class, but be ready to dedicate a good amount of time to completing assignments. The class is relatively easy, especially since the grading is really lenient, but there is a lot of work. The teachers are excellent and really funny and cool.","A very fun class! The progress you make throughout the course is invaluable and impressive, as long as you put in the effort and time.","It is a lot of work; many hours need to be set aside for language study. You will get to know your classmates better than in most other classes.","Chinese Bx is an excellent way for Chinese speaking students to finally gain reading and writing skills.  The pace, structure, and texts of the course were all clearly designed for heritage students and were all effective.  Much of the learning of characters must be done on your own time, and there is a good bit of homework; however, lecture was a good mode for teaching grammar and also for general experience with the language.  The material seems ideal for those who have experience listening and speaking Chinese; whether or not to take the course is a matter of personal tastes.","I highly recommend that freshman take it, since a lot of the readings are oriented for freshmen - but of course it is good for anyone. The teachers are very caring and interesting. There is a steady and sizeable workload, but none is conceptually difficult. It's a great balance with more conceptually difficult classes. Work is very manageable - material is very useful.","If you have limited experience with Chinese this class is really helpful. It's a lot of work in terms of hours, but if you do the work doing well is generally not a problem, and the returns to your Chinese ability are clear and great.","This was my favorite class of the semester -- you both learn a ton and also make new friends, and have a lot of fun doing it!","This class is good for students who genuinely want to learn Chinese as long as they are willing to put in the necessary time and effort.","This class is amazing if you really want to learn Chinese, and you'll leave the course having a firm grasp of the Chinese language.","Prepared to do a lot of work on a daily basis.","This is a very enjoyable class to attend. Since the class meets every day, however, there is quite a bit of daily homework, much like in a high school class. The course is very satisfying because you will see concrete improvement in your reading and writing abilities by the end of the semester.","This course requires a lot of time and effort but it's definitely worth it - you learn so much over a very short time span. Teachers are both very kind and create a warm learning environment."]},"Fall '10":{"comments":["If you want to learn Chinese effectively and efficiently, this is the class for you.","This class is a lot of work, and many times the work is quite uninteresting. Take this class if you REALLY want to learn Chinese and can devote a lot of time to it.","Expect a lot of work; but you definitely do come out with more than what you expect in terms of your improved ability to read and write.","Lots of work but very fun!","Challenging but doable; you will learn a great deal of Chinese and you will quickly see the results of your effort.","I now understand why this class got such high Q scores. This class was probably my favorite class for freshman fall, and there was really no better way I could have improved my Chinese by so much. I started the class barely being able to write my name, and now I have mastered so much. The class is more based off of daily work, which balances well with pset classes like math, lifesci, physics, economics, etc. because you can take a break from your huge psets with a little Chinese homework.","if you've grown up around chinese but can't write (yet), TAKE BX. it's well-taught, educational, and really quite fun.","As long as you put effort into the class, you will learn a lot and get a good grade. The class is very focused on learning through practice and mistakes.","This class is a great experience, is very small and personal. In addition, the topics covered are very practical, and include many issues that are relatable to Chinese-American students and all first year college students.","The teachers are nice, the atmosphere is laid back, and the class definitely gets you to be literate. Downside is the workload; there is a lot of daily homework.","fun class and you learn a lot; lots of homework though and the class can be disorganized at times","Chinese is a really great class, but it's a lot of work and is sort of unorganized, but it's worth it nonetheless.","Professor Huang is outstanding and very fun. This was by far my favorite class of the year. Albeit a lot of work, it is very productive and helpful for a strong Chinese foundation.","This is an amazing class!  If you're even contemplating taking Chinese Bx with Huang Laoshi, do it!  If you work hard and consistently (don't fall behind or slack), the class is not actually that hard!  The teachers all work very hard to provide you the best experience and learning possible.  Plus, they are some of the nicest people you'll ever meet!","great course! don't be intimidated by the courseload, it's not too heavy. the professors are GREAT and really make the class what it is.","Although there is a lot of homework in the beginning, you will see your Chinese greatly improve from this class.","The teachers are incredibly enthusiastic, and you simply must stay on top of work and learn as you go and build on a strong foundation; otherwise, you become very confused at the end.","The professor is amazing, as is the TF. Both are very fun and warm and welcoming, and they really want to help you learn. The class is not intimidating, and they make sure that you feel comfortable asking questions. Be prepared to spend a lot of time doing the work, but know that if you put in the effort, you will learn so much in one semester!","This is a wonderful course taught by wonderful teachers. If you have always disliked Chinese and want to go out on a limb to take this, you won't regret it. It will be a struggle, but it's worth it.","To anyone considering taking this class: just do it.  I put it off for two years and really regret it.","It is incredible how quickly you can learn a language. Huang Lao Shi and Chen Lao Shi will push you, but they work with you directly to make sure you are all right. I definitely recommend this course!","This course will give back what you put in.  It's a cliche, but if the effort is not there, the grade will disappoint.  But no matter how bad you are at Chinese when you start out, if you put effort in, you will reap rewards.","This is one of the most engaging classes you'll ever have.","You should be able to speak semi-fluently, read basic characters and understand basic spoken chinese, otherwise the course is somewhat overwhelming. However, that being said, the course is really worth taking because you learn so much and the profs are really good.","huang laoshi is awesome! take the class it's not too hard if you keep up with the work","Work hard. Don't freak out about all the vocab and you should be fine.","Take it if you can't read or write Chinese, but you can speak it. You are an adult who is illiterate, fix that.","Harvard offers a unique opportunity for Chinese-American students to \"reclaim\" their heritage with Chinese Bx. You can't find this kind of class outside of Harvard, since it's tailored so perfectly to Chinese students with speaking and listening skills, but no reading or writing skills."]},"Fall '11":{"comments":["Amazing class! Lots of work, but you learn a ton and make a lot of friends. Class is very interactive and very fun. Teachers are super enthusiastic, very accessible, and very good teachers.","You learn a lot of useful Chinese but be ready to put in a fair amount of time.","Take it but remember that it's one of the more difficult language classes at Harvard. It will require time.","Be prepared to work hard and learn a lot - it will be worth it!","It's a fun community","This class is great if you are willing to invest the time and effort into studying Chinese--its difficulty will vary depending on your ability level. As someone who has never taken Chinese school, this course was perfect.","While I learnt a lot from this class and found it absolutely worth taking, this class (both lectures and sections) reminded me a lot of how classes were like in high school (e.g. people talking when teacher is explaining something, informal feel of high school classes), and I don't know how much I liked that.","One of the greatest classes to start off Freshman Year","If you suffered through years of heritage school without learning a thing, worry no more, this class is your savior. At the end of the semester you will realize that you learned A LOT. Writing and reading noticeably improves and at a rapid rate. Prior exposure to characters helps a lot. If you study traditional (i did) it's not that bad but does get frustrating at times as the class is taught entirely in simplified. The teachers will accommodate you though, and there is a traditional coursepack.","You will learn a lot, but don't fall behind.  Take advantage of the fact that the course has good instructors, don't slack off just because they are nice and make the class disruptive and useless for everyone else.  If you're going to not do your homework (which we go over afterwards in class), you mind as well not go because you're going to hold up learning for everyone else.","Your background will almost singlehandedly determine how tough this course is!","Definitely take this course! You make many great friends here, the teachers are all extremely flexible and approachable, and you are able to see your own tremendous progress.","This is an amazing class. If you have native speaking ability and any interest in learning your language, this is your class.","This course was a lot a fun, it would definitely be worth your while to take this course. The teachers are all very nice and the classes are some of the best of all the classes that I've taken during my first freshman semeste.r","This class will take up your life. You will be demoralized by the ridiculous amounts of daily work for this class that is needed to keep up with your peers (people who don't have as much foreknowledge especially). Because this class meets so often and interacts with each other so much, there will be social stratification by popularity, drama, and a bunch of other stuff. Really, from a social aspect, this could be the equivalent of an extracurricular. The course material is hit or miss (for example, the website sucks and the coursepack is confusing), but the instruction is top notch. Be prepared to invest a lot of time into this class. Don't be surprised with some others are better at the class then you. It's hard, but you will learn... You will learn a lot. åŠ æ²¹ï¼\u0081\r\n\r\nAlso, don't be surprised if this class tries to advertise stuff or reinforce stereotypes. I remember a whole unit on why one should concentrate in East Asian Languages, and a couple days on why one should go for Chinese citation or go to HBA. Also, there is some minor gender\/racial stereotyping in the class, but that's more of the difference between Chinese culture and American culture\/cultural sensitivities than anything malicious. On that note, this class is a pretty good way to get an introduction to Chinese culture without going to China. I can't really say more on that.\r\n\r\nOne last thing, make sure the course head know of any allergens you have, whether it be food or pets. This may be important.","If you are a native speaker who cannot read or write very well, take this class! The teachers are very accessible and sweet.  The material is not that difficult.  It is a lot of memorization, but if you keep up with the vocabulary, the class should be more than manageable.","An excellent class to help those without a reading or writing background to get up to speed on Chinese. Definitely take the course if you're at the level of Bx, but be warned that the course seems deceptively easy at the beginning.","The teachers are nice and welcoming and the improvements you make in this course are tremendous.","It's a great class. All the teachers are amazing and helpful. Be prepared for a decent amount of work, but everything else is great!","If you're looking for a fun, chill class reminiscent of high school language classes (but harder), you should take this BX. é»„è€\u0081å¸ˆ is great; seriously, she's like everyone's surrogate mom, and I love moms. Both TFs were knowledgeable and one was pretty hot, which was distracting at times (especially Halloween) but still that was awesome. Met some great kids in that class. Solid six for life.","awesome class, lots of fun, although its quite a bit of work, but you will learn a lot of chinese and make many friends.","Take it!","Huang Lao Shi is wonderful, and you will love this class!","Wonderful class for native speakers who know only a little chinese, improves your speaking, writing, and reading ability greatly","Taking only this course will not allow you to carry out extended conversations in Chinese, so I'd recommend it if you are sure that you'll put in the time to do work and if you're planning on using Chinese in the future (also if you need to fulfill language requirements quickly). If you're wondering whether you should pursue a language citation or as a major, I think this is an interesting course to take. I was personally thinking of a language citation and study abroad in China, but then I realized that there were other courses at Harvard that I wanted to take. I already fulfilled my language citation, and I kind of regret choosing this course first semester because there are so many hours of class to schedule. I do think that it has allowed me to better communicate with my relatives, though, and I feel more confident in my ability to pick up Chinese on my own in the future.","Take it if you want to gain a very useful skill.","This was my favorite class of the semester, even though it required the most work. It is so rewarding, and the teachers are absolutely amazing. They are very accessible, are enthusiastic, and are good at TEACHING.","If you're a native speaker contemplating finally, FINALLY learning how to read\/write Chinese, do take this course. Some parts were frustrating - there are organization issues with this class (website hard to navigate, multiple versions of worksheets floating around, etc), - but Huang Laoshi is fantastic and caring, as are the section leaders. And it's so worth it when you end the semester and realize just how much you've absorbed.","The teachers are what make this class truly excellent. Huang laoshi, Li laoshi, and She laoshi are always engaging and this class (especially section) has been one of my most fun classes this semester. Be prepared to work hard and spend a significant amount of time on this class (at least 10 hours a week). Make sure to be diligent in learning your characters and keeping up with the material, the class moves pretty quickly. This class is best suited for people who can be conversant in Chinese (I had very poor speaking skills at the start of the class, so it was relatively more difficult for me, but still doable if you put in the time). Great way to learn proper sentence patterns, interesting vocabulary, and how to read and write Chinese.","If you are a native speaker and want to learn how to read and write, definitely take this class!  This was by far my favorite class of the semester.  Even though the workload may seem larger (some homework every day), it's never overwhelming.  Huang Laoshi is the sweetest professor I've ever had.  The teachers all devote so much time to each student personally, and they really care about each and every student.  The tests and grading are fair, and the environment itself is very warm and welcoming.  Huang Laoshi even invited us to her house at the end of the semester for a meal!  I definitely recommend taking this class!","Make sure to practice speaking a lot before and during this class. Keep on top of all your assignments (remain organized because the course isnt)","If you have some speaking background in Chinese, and you're looking to learn to read and write, this is the right class for you. It's not easy and there is a significant course load, but at the end, you'll be glad you took the course because you really learn a lot and you get to interact with amazing teachers.","Be prepared for daily homework and a very complex grading system comprised of many different facets (essays, projects, tests, homework, etc.)","Be prepared to work hard! If you put in the effort, you will come out of this class with a very strong foundation in Chinese."]},"Fall '12":{"comments":["If you are interested in working with interesting students from the USA and around the world, with excellent professors and want to have much fun in the process - then choosing this course is a no-brainer!","Huang Laoshi and Pan Laoshi are wonderful and really made the class one that I looked forward to each day. The class is somewhat of a time commitment (homework due every day and large group projects), but your Chinese skill level improves dramatically from the beginning of the course to the end.","Take this course if you are one of those students who hated going to Saturday\/Sunday school for Chinese. You will truly develop an appreciation of Chinese if you take this course, because you learn so much within a short period of time. In addition, Huang laoshi is truly a great professor who goes great lengths to make sure that the class is fair and that students learn the most they can. In addition, you develop great bonds with fellow students no matter what year you are in.","Take this class. Make your ancestors proud.","You learn a LOT in the class, but it's definitely a lot of work and you have to push yourself to get through it. Review lots - that will help!","This is a great class! If you want to meet a lot of great people and improve your Chinese, take this class.","Even if you have passed your language requirement, as I did, you should still seriously consider taking this class as a FUN and EDUCATIONAL class. It was neither a wasteful nor a stressful class. Great balance, and Huang Laoshi is like a mom to us.","By far the best class I have taken at Harvard! Huang laoshi and Pan laoshi are absolutely wonderful!","Highly recommend! Huang Laoshi is the best -- good natured, funny, and very understanding. She is really dedicated to her students! The class is a lot of work, but it's manageable as long as you don't fall behind. The most rewarding part of it is the community; in no other class at Harvard have I ever gotten to know and love my classmates so well.","This is an amazing class! Huang laoshi is the sweetest teacher I have yet to encounter, and Pan laoshi is hilarious. Also, the class itself is very closeknit, and you will make a lot of new, Chinese friends. I definitely recommend you take this if you are a heritage student who wants to be able to speak better and write and read better.","It was a fun course, and I met a lot of friends through it. It was a lot of work, but my Chinese improved SO MUCH. Be prepared to do work - as long as you do the work, you should be fine.","I had a lot of fun in this course, but you have to put a lot of time into the work because it is accelerated. The instructors are very enthusiastic, perhaps the best part of the course, and the students are all at different levels due to the nature of a 'heritage speaker' class. You can learn a lot of Chinese if you study as recommended by instructors.","The professor makes this class really fun, and the class becomes very close as the semester goes on. Be prepared to spend sometime everyday on Chinese homework, and more when there are tests.","Whether you should take this class or not depends on your motive; it is class is definitely not an \"easy\" class, so if you plan to take it in order to get a language requirement out of the way and are not willing to work hard, don't choose it. However, if you want to take Chinese seriously and you already have a good speaking skill, then take it. The work from this course can get overwhelming but Huang Laoshi is very nice as a person. She invited us to her home at the end of the semester and cooked us really delicious Chinese food. Pan Laoshi is also very nice and funny.","It's a really fun class with excellent instructors! As people will no doubt say, be prepared to stay on top of things and you will be rewarded.","I would tell future students that though some parts of this class were disorganized, generally I enjoyed this class and I really did learn so much. With lecture MWF and sections TTh, know that you are signing yourself up for a 5-day-a-week commitment! However, if you are serious about learning Chinese, I recommend this class. Also, Professor Huang is really really sweet and at the end of the semester, she invited us to her house for Chinese food and it was really fun! She also brings us food and generally really tries hard to make sure freshmen are making a good transition into college and all students are enjoying her class. It's obvious that she cares about her students, and learning from someone who cares is pretty awesome.","No matter what your doubts or qualms are, TAKE THIS CLASS","The course is structured so that it is fun to learn Chinese, especially for American-born Chinese students who are sometimes reluctant to take Chinese. In this course, you will really appreciate the Chinese culture and develop a great relationship with the teacher and teaching fellow. While the course is fast-paced, you will truly improve in Chinese. The class also teaches you how to transition into college life and allows you to interact with other students and the teacher and teaching fellow, which is very lacking in most courses freshmen take.","This course will improve your Chinese character writing no end. Although there is homework every day, it is only beneficial as it always helps to reinforce what has been covered in the course.","if you are serious about learning chinese and improving, this course is the best introductory language course at Harvard. It requires a lot of work and diligence, but you will learn a lot.","This class is a great transition into learning Chinese reading and writing for the first time with reading and listening skills. Even though this class is a lot of work, Huang Laoshi and Pan Laoshi are a lot of fun and genuinely care about making the class a great community.","It's the best. It grows on you, and by the end of the semester, the fact that it has to end is terrible.","Huang Lao Shi is a fun teacher and she has lots of advice for new students in how to start college life. Classes and sections are fun though there is a lot of busy work. Sometimes instructions can seem confusing and disorganized but as long as you pay attention to her emails, you'll be fine. Have fun with the class! You'll learn a lot of new characters and will be able to write a pretty complex letter to your grandparents by the end of the course! You also meet a lot of other heritage speakers who come from similar backgrounds.","be prepared for lots of work but your chinese will improve a great deal. Professors are also extremely friendly and helpful","This is one of the greatest learning experiences that you can have. You have an insane amount of exposure to the brilliance of the teaching faculty, who will spend as much time as necessary to help you understand your issues. You also make a tonne of friends through the collaborative learning experience.","It definitely was a lot more work than I expected, especially at the end. I managed to cruise through the beginning because I actually knew most of the characters, but then at the end you really do have to put a TON of work in to memorize all those characters... and the organization of the class was pretty poor from the get-go, but Huang laoshi and Pan laoshi were absolutely wonderful and made the class extremely enjoyable. Speaking the language every day really, really helped with my fluency as well.","This is a VERY fast-paced class, and if you are planning on taking it, brave soul, I highly recommend balancing it out with some easier courses. There is homework every day, because there are lectures Monday, Wednesday, and Friday, and section on Tuesdays and Thursdays. Many nights I spent doing work solely from this class, and even then had difficulty finishing and getting enough sleep to function like a sane human being in the same class the next day. \r\n The teachers are very nice people. Huang Laoshi is a very sweet and warm instructor, and Pan Laoshi is quite funny. However, despite how amazing the teachers are, it doesn't change the fact that this course was a struggle for me, on top of which the class is sometimes quite disorganized (homework instructions unclear, topics covering things not learned in class, etc.). There is a dictation every week and tests every couple of weeks. If after all that, you still want to take on the stress monster that is Chinese Bx, I'll be seeing you in UHS, friend.","You learn an astonishing amount of Chinese in this class. The difference in reading\/writing ability from the first week to the last week is really quite impressive. However, this class comes with a large amount of busy work, and the thought that \"I didn't come to Harvard so I could copy words from an article into fill-in-the-blank questions for an hour a day...\" isn't uncommon. \r\n\r\nThe weighting for assignments is frustrating because certain assignments will take several hours to complete and only count for a tiny portion of your final mark, and the organization of the class itself (so many random assignments that no one knows what is due when) make for a generally frustrating experience. But, if you are looking to go from illiterate to a solid reading\/writing base in Chinese in one semester, this is the class for you. Be warned there are many people in the class that already have reading\/writing experience and are taking the course for an easy mark.","Study for dictations!","While you learn a lot in this class, it requires a lot of studying and time outside of class to do well. Also, the class structure can be rather disorganized and makes it a little frustrating at times.","This was my favorite class this semester! My Chinese improved tremendously. At first, I could barely recognize 10 characters, and now I am able to read full articles.","This course does require a lot of work and goes at a fast pace. However, the professors are really nice and make the learning experience fun."]},"Fall '13":{"comments":["The most difficult part is having class everyday and consequently homework every night, but just study a little bit everyday and it's worth it.","For the first time, I actually enjoyed learning Chinese. The teaching staff is awesome and creates a great environment to learn more about Chinese. There's a manageable amount of homework. I could not write more than one sentence before this class and now I can write a whole letter.","The course is fantastic; the work may be difficult and lengthy, but coming out of the course, I know so much more Chinese now than I ever did after attending years of Chinese Heritage Schools. The teachers are great and enthusiastic as well as understanding.","This was my favorite class this semester. I met some great friends, and I had a lot of fun in class. Section with Xu Laoshi is awesome!","This class is a lot of busy work that sometimes seems repetitive.  However, it is also a very enjoyable class and my chinese improved greatly throughout the semster.  Be careful as the workload goes from being moderate to excessive from the 10th week on.","Take it!  It's a lot of work, but it's really rewarding and it really allows you to connect with your culture and to know the language.","It was an absolutely fabulous class.","Be ready to do a fair amount of busy work, which is both good and bad. Though it may seem like you didn't come to Harvard to copy Chinese characters into a fill-in-the-blank worksheet, the homework is a nice balance to harder, more thinking-intensive courses. Also, be prepared to be a little confused, especially when learning grammar and sentence patterns. They're often not taught very clearly. All this being said, this course is a great introduction to Chinese for heritage speakers. Even if you were placed into a higher level Chinese class (like 123xb), definitely at least shop this course.","The instructors really take care of you in this class. This class is also what you make of it, if you put in a lot of effort and time for the extra credit work you can really improve a lot reading and writing wise.","Take this class!! It's really great and you learn a lot! Xu laoshi is so sweet and Huang laoshi is really funny and entertaining! How much time you put into this course will very much depend on how much Chinese you already know coming in, but it's not bad at all. Definitely recommend!","No matter how much previous experience you have with Chinese, you have to be willing to engage with the material. if you are, then it's much more rewarding and not too difficult.","You really should take this class if you've ever wanted to learn Chinese but never had time\/ didn't want to before college. The teachers are absolutely fantastic; they truly care about every student and are very open and helpful. You will learn so much if you take the class if you put in the right amount of work. The only thing to beware is that assignments can be a bit disorganized at times so it is important to contact the teachers or other students if you are unsure or confused.","Chinese Bx is great in that you the environment is very friendly and the teachers really care. You'll also get to know a lot of your classmates and class is usually pretty fun. However, beware if you're chinese skills are borderline for this class. Sometimes on the exams and homework things that aren't taught in class are tested\/used, so you'l be at a disadvantage. Take it thought, it's a good experience.","Take Chinese Bx! It's a very fun class and Huang Laoshi and Xu Laoshi are great teachers. You will enjoy your time in this class so much. It was my favorite class this semester.","It's definitely a difficult class, but very rewarding. Only take it if you are confident that you can understand the lessons and put in the time.","This is an excellent course for anyone who believes they fall into this particular description. An extremely low level of writing and reading but higher knowledge of listening and speaking is perhaps the ideal student. Any student more comfortable with writing and reading should probably be in a higher level course. Otherwise, the teacher is awesome, the students are awesome, and the class is generally a very good experience. Students are expected to put in work daily, but the work is not overwhelming.","Chinese Bx is a great time, funny engaging teachers and you'll make a lot of friends in the class, which is always referred to as a big family.  You should definitely not underestimate the time commitment though, as there is work every day.  Shop the class and see what you think, you can also youtube search chinese bx and see video projects from past students like course trailers.","It is a great class... if you are a heritage speaker AND are willing to put in a lot of time to do well and learn in this class.","Yes, this class meets every day. Yes, this class is a lot of work. But its consistently high ratings are there for a reason - Chinese Bx is really truly a great class. Huang laoshi and Xu laoshi are the nicest people ever, and they're there to help you in whatever ways you may need. Your classmates also become like family. You'll learn a ton of Chinese, and impress countless family members along the way. If you're worried that your Chinese isn't good enough for this class - don't be. I could understand Chinese and speak a little, but I knew less than 20 characters and I found the coursework to be just fine.","great instructors who really care about you","It's hard but good","Although the class is challenging, the workload is definitely manageable, and the teachers make it completely worth it. Huang Laoshi and Xu Laoshi are both so passionate about teaching, and they're so friendly that every student feels comfortable approaching them about anything. I found myself inviting both teachers to musical events throughout the semester -- they showed up and were thrilled to have been invited!","This is a great class! Huang and Xu laoshi were extremely helpful and very caring, I am amazed at my own progress in one short semester. Everything we learnt and every piece we read were so relevant to our own lives, it was great to be able to get together and learn with wonderful people. Homework .. there can be a lot of it, and at time seems tedious, but getting through it is essential for doing well in this class. Keep on top of revising vocab and what you have learnt for dictations and tests, will benefit you a lot. Taking this class was a great experience.","This is a wonderful course! Well worth your time!"]},"Fall '14":{"comments":["Loved it","While this class is a good introduction to the Chinese language for students with advanced backgrounds, be prepared for the workload! When they say that this is an accelerated class, they mean it- the material is taught quickly and everything is cumulative, so if you don't keep up it is far too easy to fall behind. Only take this class if you're up for the challenge!","Huang makes everyday of Harvard special. She doesn't only teach the class for the purpose of helping students with Chinese; she really does go above and beyond in making sure people are comfortable with life at Harvard.","It's a time consuming course, with daily work ranging from half an hour to an hour and a half especially when there's a dictation (not counting studying for tests). It's not especially difficult if you are willing to put in the time and effort, as there are extra credit opportunities and the teachers are more than willing to help you if you need it. The tests are fair, but focus a lot more on sentence structure and grammar than I expected. The classroom atmosphere is fun and familial, which is great for learning a language.  If you are interested in practicing your Chinese and\/or want to fill your language requirement, and are willing to put in time, this can be a rewarding way to do so.","don't assume your native speaker knowledge is sufficient, you actually have to study","Taking this class was honestly one of the most enjoyable academic experiences I have ever had. Looking back on the past semester, I can't believe I have learned so much in so little time. You will learn a lot and have lots of fun, since the class really feels like a small community. Definitely get to know your classmates and teachers, they are just as important in the experience of Chinese Bx as the language itself.","The only thing I liked more than the amount of quality material that I learned in the course was the teaching staff. Huang Laoshi, Xu Laoshi, and Zhu Laoshi are all great teachers that deserve praise for their work. I can't wait for 123xb next semester!","This is an absolutely amazing course - as I'm sure many of my fellow Bx friends would tell you. You will learn a lot in not just reading and writing but speaking and listening too. The teachers really care for their students and are such great personalities in the classroom. They really understand the students they are teaching. I had pretty rusty Chinese abilities coming in (from a Cantonese-speaking family and even then, my Chinese isn't that great) - but since I'd taken Chinese in high school, I figured I'd start here instead of Chinese Ba - great decision and would highly recommend the course!","Take this class! Chinese Bx is a fantastic class, not only for how much you learn in one semester, but for the fantastic community that this class strives to build. Going to Huang Laoshi's house at the end of the semester was very much a highlight. The TA's are also extremely committed to help you improve your Chinese by providing lots of good feedback.","If you want to improve your Chinese, and already know how to speak the language well, then take this class.","If you're a freshman, I'd highly recommend this course just for the reason that it feels like a safe, supportive environment in what can be an intimidating campus. As for learning Chinese, if you have a decent amount of Chinese experience, I would recommend taking a higher level class because this class will be too easy for you. Bx is really meant for students who can read and write very, very little.","It is very helpful and the workload is not too much","Warning: assignments in this class build up with astonishing speed as the semester goes on. When that happens, you do NOT want to fall behind. \n\nOtherwise, fantastic class and totally worth taking if you're a Heritage student who can't read\/write but can speak decently, because Harvard is one of the only places anywhere that offers a class specifically designed for this kind of person. It's part of a two-semester track, Chinese Bx in the fall (one year of beginner level) and Chinese 123xb (a year of intermediate) in the spring, at the end of which you'll be able to jump into advanced Chinese.  \n\nReasons why it's a great class: \nThe teachers are amazing and incredibly helpful and enthusiastic. The classmates are usually motivated, though you will find some more committed than others. Keep company with the more committed students, study outside of class with them, practice your Chinese as often as possible with Chinese friends, go to office hours, and do your homework every day, and you WILL succeed. \n\nProblems with the class: the website is disorganized, and the coursebook is not the prettiest. In other words, minor issues.","Chinese Bx teachers are friendly, dedicated, passionate, and committed to the improvement of their students. The real strength of this course is its full immersiveness - you are basically put into a Chinese speaking family for a week, and although there is homework every night, quizzes every week, multiple essays and tests, and a couple group video projects, the environment of the course makes it fun.\n\nThe only downside is that teaching materials are not as organized as they could be (finding note files on the course iSite is hard because lecture notes are not organized by date and the titles all look the same), and much of the grammar comes without explanation, so make sure that you are confident in your heritage Mandarin and that you don't need things explained, you just need to know how to write them.\n\nStill, as a heritage student with two Chinese-speaking parents who learned to speak but not to write, I recommend this course.","This class is absolutely fantastic if you want to learn how to read\/write Chinese quickly! It's not too much work, but you really do see your improvement over the semester. The teachers are kind (even when you're late) and there are a lot of extra credit opportunities. If you put in the effort, you will get an A.","It's a very fun course, the teachers are all super nice and they really care about the students. It may be challenging but if you work hard to do the homework and memorize all the characters, you should be fine.","The professors care a lot, and it really translates to you learning the material better. Lectures were entertaining and informative, and homework is necessary to your success - not much can be considered busywork without motive.\nTake it if you're a ABC wanting to finally learn to read and write - properly.","The knowledge you get out of this course really depends on your enthusiasm for the material. If you are very enthusiastic, this course can be extremely rewarding.","Take this class! I cannot recommend it enough. Huang laoshi, Xu laoshi, and Zhu laoshi are all so nice and wonderful and really know how to teach Chinese. I learned a lot while also having a lot of fun! However, be prepared for the workload. Because this class covers two semesters of Chinese in one, there can be a lot of work. Don't let that discourage you from taking this course though! I genuinely felt that I was having fun doing Chinese homework every day. You won't regret it!","One of the best foreign language classes offered at Harvard. Huang laoshi, Zhu laoshi, and Xu laoshi are also three incredibly supportive educators who truly care about teaching the Chinese language to their students.","Take it if you have a lot of background in speaking and listening.","Such a great language class! Definitely take it. Not only did I learn Chinese as a language, I learned a lot about the culture. Most of the students are ABCs who went to Chinese school and didn't really care about Chinese back then. After taking the class, however, many of us have gained higher respect for our heritage and have grown to appreciate it much more. ChineseBX really tries to be a family and the teachers are so sweet. They truly care about the students. The workload is OK, if you follow the schedule they give you.","Be aware that it is a lot of work. Two semester's worth in one.","it is just the right amount of difficulty if you are already fluent in Chinese, but it definitely takes a lot of time since class is every day and there is homework every day as well.","This class is quite rewarding if you put in the effort. At times, it can get overwhelming, particularly if you fall behind on your characters. For that reason, make sure you stay on top of your assignment and constantly review your vocabulary. It is essential for success in this class. As for the environment, I thought it was wonderful. You get to go to Huang Laoshi's house for dinner at the end of the course!","Chinese Bx outside of the classroom is a rigorous way to learn a lot of Chinese characters, and quickly. However, the experience inside the classroom gets tiring pretty quickly, as it becomes the same routine over and over again, five times a week. Although there is some speaking practice, it's not nearly engaging enough. Reminds me of a typical Saturday Chinese school experience from childhood."]},"Fall '15":{"comments":["Prepare a lot of the midterms; they are very hard.","This is a great introduction to writing and reading Chinese for heritage speakers. The class is really fun, the instructors are wonderful, and at the end of the semester, you really feel like Bx has become a family. You look forward to class every day, and each class session is filled with laughter. The only downside was that some of the assignments and expectations for essays, projects, and tests weren't always clear, and it was difficult sometimes to tell what we needed to know and study.","Although this course is intended for those who can speak & understand Chinese but can't read or write, there are students who take this course who can read or write considerably more than others. From the beginning, you start out on a very uneven playing field. You will still gain what you want to gain from this class, but it can be frustrating if you have to work much more than your peers. Nevertheless, it's still a very rewarding course.","Huang Laoshi and Xu Laoshi are the best teachers! Really helpful and understanding of their students.","Loved this course!  Huang and Xu Laoshi are hilarious and awesome, and made the class seem like a small family, which is especially helpful to ease the transition to college (for freshmen).  This was definitely a class I enjoyed every day. The most important pre-requisite to taking this class I think is having the kind of \"heritage\" background where at least your family spoke to you in Mandarin.  It doesn't have to be complicated at all, but this is helpful to understanding what the teachers say in class--it is taught in mostly Mandarin.  You don't have to be good at speaking or reading Chinese, because you spend a lot of time learning that in the class.  And the workload actually has improved, I heard, from previous years.  Now, three assignments are due on MWF, and there's a dictation (character quiz) on Tuesdays, plus 3 tests and essays.  Usually, you learn about 50 new characters per week, most of which are fairly simple.  I would 100% recommend this class to anyone with a heritage background who really wants to improve their Chinese (I learned so much and can hold basic conversation now, write a few hundred characters, and read so much more Chinese).","It's an amazing class with wonderful teachers who really care about you and try to help you. However, a lot of material is covered in a short period of time, and sometimes material that is never covered in class shows up on tests.","Chinese Bx was not only a great course, but also a great experience. Class every day is something I look forward to, for the teachers are funny and caring, as are the students. It is far from easy, but you will learn a lot and improve a lot if you put the effort in.","If you are uncomfortable with the class for the first few lessons, probably best to take Chinese Ba instead because it'll only get harder. And it gets harder quickly.","I learned so much from this class, and Chinese Bx acted as a haven from some of the stresses of life. It may sound cheesy, but ultimately this class became like a family to me, and I would recommend it to anyone.","Let's be real: there's no better way to fulfill the language requirement.  if you went to Chinese school as a kid but forgot all that Chinese when middle school and high school rolled around, fear not - this class is full of other students like you. Huang laoshi is the most fun teacher I have ever had. She is so kind, never mean if you flounder and get an answer wrong, and has the most electric energy.  She's 60 something years old going on 25.  Xu laoshi is the kindest human being on the face of the Earth and she will make you more confident in your Chinese abilities in section.  Weekly homework is only due Monday, Wednesday, and Friday and takes about one hour per session, making it like a math class, but easier.  The class is like a family - you'll love your fellow zhongguoren.  All the tests and assignments are fair. Only two complaints - the classroom building (Vanserg) is a little far, so be prepared to get some exercise walking there every day. The pace of the class is also brisk - make sure you keep up on vocabulary, especially right after the first midterm, otherwise you're gonna have a hard time. All in all, take this class: I promise you won't regret it.","I felt like I learned so much Chinese during the course of one semester! The teachers (Huang Lao Shi and Xu Lao Shi) really are the reason why this class is so enjoyable and effective - they're relatable, funny, and do a good job of creating a great learning environment. Before I started this class, I was only sort of able to speak and was not able to read and write at all. By the end of this class, I was able to speak pretty fluently and able to write a 2000 character essay. It really is an accelerated course. But that being said, for this course in particular, what you get out of it is really proportional to what you put in. If you actually take the time to memorize characters and practice using them rather than just cramming before a test, you'd get much more out of this class than students who only do the latter. \r\n\r\nOne caveat to the course is that the materials aren't organized as well as they could have been. It's totally manageable but just a little bit of a hassle to try to locate everything.","Work consistently and keep up with the material. Do not take if you are not a heritage speaker.","Academically, this is a terrific foundational Chinese course, and it moves fairly quickly. There's around 50-60 new characters each week, homework every other day, and a dictation assessment every week. You'll learn a lot in this class. But this is one of the few classes I've taken that really makes an effort to build a community, and the professors are terrific at fostering a supportive and friendly environment. By virtue of enrolling students with a common background that meet and talk to each other every day, you get to know each other fairly well, and there was a terrific end of year party at Huang laoshi's house, which was sweet. It made class a lot of fun, and unlike anything I've taken here at Harvard.\r\n\r\nOh, and I think more than half the class gets an A- or higher, so even though it's some work, it's also not a class set out to trip you up. You do the work, you get the grade.","Great, understanding, effective teachers. Fun class -- easy to have fun and relate to classmates. Coursework system is effective.","Evidently, this course is designed for a specific niche of students. If you are a native Chinese speaker, but you do not know how to read or write Chinese characters, then I recommend this course as a review. It will improve your Chinese and perhaps spark interest in taking higher level Chinese courses.","The best introduction to Chinese class! I learned a ton and had so much fun doing it.  Stop putting off your dreams of learning Chinese and impress your family too!"]}},"mostRecentQ":{"overall":"4.50","workload":"5.50","difficulty":null,"recommendation":"4.50","enrollment":"31","response rate":"87.10","QCourseOverall":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"1","3s":"0","4s":"10","5s":"16"},"QDifficulty":{"number":"CHNSE Bx","course_id":"757","cat_num":"7066","1s":"0","2s":"3","3s":"16","4s":"11","5s":"2"},"QWorkload":{"number":"CHNSE BX","course_id":"757","cat_num":"120305","1s":"0","2s":"18","3s":"5","4s":"0","5s":"0"}},"success":true}