{"scores":{"Spring '12":{"course_score":{"overall":"4.29","workload":"1.29","difficulty":"2.43","recommendation":"4.43","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.50","workload":"1.25","difficulty":"2.00","recommendation":"4.75","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"3.88","workload":"1.00","difficulty":"1.75","recommendation":"4.25","enrollment":"11","response rate":"72.73","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"4.56","workload":"1.44","difficulty":"2.33","recommendation":"4.89","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfj","cat_num":"6361","course_id":"3910","year":"2010","term":"1","id":"6354afa90812480085558103b7ffa3be","first":"Jeffrey Michael","last":"Ellenbogen","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.78","AccessibleOutsideClass":"3.75","GeneratesEnthusiasm":"4.89","FacilitatesDiscussionEncouragesParticipation":"4.62","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '10":{"course_score":{"overall":"4.30","workload":"1.40","difficulty":"2.30","recommendation":"4.40","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfj","cat_num":"6361","course_id":"3910","year":"2009","term":"2","id":"6354afa90812480085558103b7ffa3be","first":"Jeffrey Michael","last":"Ellenbogen","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.12","AccessibleOutsideClass":"3.40","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.67","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Fall '09":{"course_score":{"overall":"4.40","workload":"1.80","difficulty":"2.30","recommendation":"4.20","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfj","cat_num":"6361","course_id":"3910","year":"2009","term":"1","id":"6354afa90812480085558103b7ffa3be","first":"Jeffrey Michael","last":"Ellenbogen","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"3.38","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"3.33","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '09":{"course_score":{"overall":"4.44","workload":"1.56","difficulty":"2.00","recommendation":"4.78","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Fall '08":{"course_score":{"overall":"4.17","workload":"1.50","difficulty":"2.00","recommendation":"4.50","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Spring '08":{"course_score":{"overall":"4.71","workload":"1.14","difficulty":"2.29","recommendation":"4.71","enrollment":"11","response rate":"63.64","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Spring '08":{"comments":["This class was fabulous.  The professors were charismatic, the material fascinating, and the class format engaging and challenging in a creative way!","What a wonderful course to fulfill a neurobio requirement.  Not at all dry  extremely interesting and also very relevant to everyone's life!","Take it if it's interesting but it's not that well structured. It'll be really easy but maybe not as satisfying because of that.","It is a really great way to fulfill a neurobiology elective requirement. Both Jess and Jeff are great and you really get to know your classmates and have a comfortable and intellectually rigorous environment after the full year!"]},"Fall '08":{"comments":["Great class, very fun","Professor Ellenbogen is a knowledgeable, laid-back expert in his field, so if you have any desire to learn about sleep, this is the class for you.","This is a wonderful class that gives you the opportunity to think critically about how science is conducted, how the scientific world exchanges and debates information, and how to successfully read a scientific article and critique the positive and negative aspects of the work.","The professors are incredible, and as long as you put a lot of effort into the discussion section, the fact that there are no other requirements makes this an easy class."]},"Spring '09":{"comments":["Interesting and nothing you'll lose sleep over.","Great professors. It's too bad Jess is leaving! The class is really a fun and easy way to get a neurobiology tutorial out of the way. Be prepared to think hard about the week's readings, though, because you'll be spending 90 minutes talking about 10 pages.","Great class! Very fun, great instructors, learn a lot, not stressful","If you think you might be interested in sleep, this is a great way to acquaint yourself with some of the cutting edge sleep research that has happened over the last decade.","This was definitely the best course I have had at Harvard. Nothing can beat the stimulating discussions we had every week! It is definitely a course that you look forward to every week. The readings are really fun and the time spent in discussion just flies by!"]},"Fall '09":{"comments":["It's an amazing course if you're interested in sleep.  The workload is very manageable and you learn a lot.","The course is not stressful and does open you to an area that is not immediately available in other courses. It is, however, more of a hands-off class that you can forget about too easily because it doesn't meet often.","This is an awesome course and you really get to talk about papers and have some fun without this class being too labor-intensive.","I only add \"with reservations\" because I've only had half of a yearlong course and can't properly judge the entire course yet.","This is one of the best classes I've taken at Harvard--the papers are interesting, and you learn a lot about critiquing journal articles in addition to learning about sleep.","This is a low-key and painless neuro tutorial to take. Discussions are very informal and the workload is small. The course can be a bit unstructured at times though, so be prepared."]},"Spring '10":{"comments":["Great class and really interesting.","discussion-based seminar with a very easy workload (reading one paper a week). however, the course is not organized very cohesively and I am not sure I learned much. probably also depends on the group of students you take it with.","Be prepared for a fair amount of disorganization.","great environment to be able to have thought-provoking discussions, also really helpful in terms of questioning and being critical of scientific work","Excellent foundation on sleep research.","It's a great discussion based seminar in which you'll get to really dissect research publications.","If you have an interest in learning more than you thought was possible about sleep, take this class. If you have a slight interest in the material and want a great teacher, take this class.","This class provides a very relaxed atmosphere and a wealth of knowledge about sleep.  Most importantly, you learn how to read and critique scientific papers."]},"Fall '10":{"comments":["This class is SUPER interesting if you've ever been curious about sleep, dreams, sleep disorders, or \"who says\" you have to get 8 hours a night.  Professor Ellenbogen is fantastic and really pushes you to develop your ideas and think deeper about everything.  The workload is very light, only one or two papers to read and discuss a week, but it gives you an opportunity to go in depth with the papers and get something more out of them than just understanding a summary.  So it's easy in terms of stress over the work but not in terms of thinking critically.  Awesome class. This is what college should be like.","This class is really fun and laid back, and you get a chance to customize it to your interests and can read papers on things that you are most curious about.","Discussion is fun and I am learning a lot about sleep"]},"Spring '11":{"comments":["The workload for this class is very light and the subject matter is very interesting.  Speak up more than you think you need to.  Although he never shows it, I think Dr. Ellenbogen has very high expectations.","interesting subject matter, no real structure in the course. quite disorganized. absolutely no feedback throughout the semester makes you wonder if you're failing or getting an A.","amazing class. jeff is the man. try and get him to take you to the sleep lab. the class can be a little frustrating if you crave structure, but if you don't then this is a fantastic class. i learned a lot about how to set up a study. the workload is also not a stretch at all.","Great forum for discussion, relaxed, not much reading"]},"Fall '11":{"comments":["I like this class because I get to learn about sleep in the neurobiological sense after years and years of being interested in sleep in the \"practical\" sense.","If this course is still taught at MGH, you'll have a chance to see the inner-workings of a sleep lab every week.  Best Neurobio coure I've taken.","This tutorial is easy and fun, the class is in a sleep lab at MGH (actually a hotel). Anyhow, Jeff is an interesting and passionate professor and if you're interested in the nuances of sleep, definitely take this class!","This is a really interesting tutorial.  You'll learn all about sleep and even get to look at some sleep data from patients.  Keep in mind that the tutorial is held at MGH, so the commute takes time.  Also, the class is less structured than some of the other tutorials, but it's nice because you learn a lot in a relaxed setting."]},"Spring '12":{"comments":["Honestly, I learned so much about sleep from this course, mainly because of Jeff's broad knowledge base as well as the contributions from other course members. Because we didn't have an overkill of readings, the discussion sections were pretty informational.","This tutorial might not be offered again next year, but it was great.  We learned a lot about sleep and sleep disorders, and the material was very interesting and relevant.  The small size of the tutorial also made it possible to discuss many cool topics.","This class helps to balance courses with a heavy workload.","This class is at MGH Sleep Lab, so you have to pay T fare to get there. Otherwise, I recommend this class to neurobio students interested in sleep. Definitely take this class, you will not regret it.","This class will challenge you to think creatively and critically about studies on sleep neurobiology.  Be prepared to read each paper several times before come to class so that you are adequately prepared for the sometimes heated class discussion.  Jeff is one of the coolest and most insightful professors I've had at Harvard... and he's one of the leading doctors in sleep neurobiology.  You don't want to pass up a chance to take this class.","I learned lots about sleep and the course was very enjoyable. However, I have no idea how I am being evaluated in this course and I feel any grade I receive will be completely arbitrary."]}},"mostRecentQ":{"overall":"4.29","workload":"1.29","difficulty":"2.43","recommendation":"4.43","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"0","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 95hfj","course_id":"3910","cat_num":"6361","1s":"5","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}