{"scores":{"Spring '17":{"course_score":{"overall":"4.10","workload":"4.00","difficulty":null,"recommendation":"4.20","enrollment":"41","response rate":"82.93","QCourseOverall":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"0","2s":"0","3s":"3","4s":"12","5s":"9"},"QDifficulty":{"number":"HEB 97","course_id":"2715","cat_num":"2205","1s":"0","2s":"1","3s":"21","4s":"4","5s":"0"},"QWorkload":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"4","2s":"19","3s":"1","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.20","workload":"3.80","difficulty":null,"recommendation":"4.50","enrollment":"26","response rate":"92.31","QCourseOverall":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"0","2s":"0","3s":"3","4s":"12","5s":"9"},"QDifficulty":{"number":"HEB 97","course_id":"2715","cat_num":"2205","1s":"0","2s":"1","3s":"21","4s":"4","5s":"0"},"QWorkload":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"4","2s":"19","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 97","cat_num":"122625","course_id":"2715","year":"2015","term":"2","id":"42c61e3756f6f9a5ae10c521d60bc7ab","first":" Katherine","last":"Zink","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.50"},{"number":"HEB 97","cat_num":"122625","course_id":"2715","year":"2015","term":"2","id":"be8b5c53f76fde5551b097564d802bec","first":" Amanda Swenson","last":"Lobell","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '15":{"course_score":{"overall":"4.00","workload":"4.00","difficulty":null,"recommendation":"4.10","enrollment":"44","response rate":"86.36","QCourseOverall":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"0","2s":"0","3s":"3","4s":"12","5s":"9"},"QDifficulty":{"number":"HEB 97","course_id":"2715","cat_num":"2205","1s":"0","2s":"1","3s":"21","4s":"4","5s":"0"},"QWorkload":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"4","2s":"19","3s":"1","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.00","workload":"2.20","difficulty":"3.10","recommendation":"4.00","enrollment":"33","response rate":"81.82","QCourseOverall":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"0","2s":"0","3s":"3","4s":"12","5s":"9"},"QDifficulty":{"number":"HEB 97","course_id":"2715","cat_num":"2205","1s":"0","2s":"1","3s":"21","4s":"4","5s":"0"},"QWorkload":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"4","2s":"19","3s":"1","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"3.11","workload":"3.17","difficulty":"3.70","recommendation":"3.07","enrollment":"52","response rate":"92.31","QCourseOverall":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"0","2s":"0","3s":"3","4s":"12","5s":"9"},"QDifficulty":{"number":"HEB 97","course_id":"2715","cat_num":"2205","1s":"0","2s":"1","3s":"21","4s":"4","5s":"0"},"QWorkload":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"4","2s":"19","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 97","cat_num":"2205","course_id":"2715","year":"2012","term":"2","id":"517763dd0fd2e6fd9a2fb9995263409a","first":" David","last":"Pilbeam","InstructorOverall":"2.81","EffectiveLecturesorPresentations":"3.75","AccessibleOutsideClass":"2.83","GeneratesEnthusiasm":"3.75","FacilitatesDiscussionEncouragesParticipation":"3.67","GivesUsefulFeedback":"3.67","ReturnsAssignmentsinTimelyFashion":"3.50"}]},"Spring '12":{"course_score":{"overall":"3.79","workload":"2.15","difficulty":"3.21","recommendation":"3.77","enrollment":"56","response rate":"96.43","QCourseOverall":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"0","2s":"0","3s":"3","4s":"12","5s":"9"},"QDifficulty":{"number":"HEB 97","course_id":"2715","cat_num":"2205","1s":"0","2s":"1","3s":"21","4s":"4","5s":"0"},"QWorkload":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"4","2s":"19","3s":"1","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"3.64","workload":"2.61","difficulty":"3.36","recommendation":"3.85","enrollment":"63","response rate":"88.89","QCourseOverall":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"0","2s":"0","3s":"3","4s":"12","5s":"9"},"QDifficulty":{"number":"HEB 97","course_id":"2715","cat_num":"2205","1s":"0","2s":"1","3s":"21","4s":"4","5s":"0"},"QWorkload":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"4","2s":"19","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '12":{"comments":["This class is not terribly difficult if you work hard on the writing assignments.  Section discussions vary from week to week in how interesting they are.  Some weeks the second hour felt really long, but others we had debates that held my attention the whole time.","If you do the assigned readings, the discussion is very interesting. Two hours usually went by pretty fast. The assignments require a fair amount of work but are fairly straight forward. The final paper can be on the topic of your choice, which is great. This class definitely confirmed my passion for HEB while allowing me to explore different avenues within HEB.","It is a lot of work, start your reading ahead of time","This tutorial was a real disappointment.  The readings were fascinating, but there was no real sense that the instructor and the students were partners in a shared learning experience.  All hypotheses were regarded as adversaries of other hypotheses, and all students were regarded as adversaries of the instructor in the grading process.  If you don't like working hard on your ideas only so that they can be slapped down by a grading rubric, you should look elsewhere.","It wasn't a bad course, but it doesn't really feel like a course I would willingly take if I did not need to.","An easy and enjoyable concentration requirement. It provides a very broad background of the starting points of evolutionary theory as well as different directions of the field. I was only disappointed that the course did not explore any one topic in-depth.","Do not come into this class expecting it will be easy. Especially, if you haven't taken Primate Social Behavior and you don't really care about apes. Because that is what you will learn about mostly. Gorillas, orangutans, and chimpanzees. Some of the readings are really interesting and awesome! But there are so many readings each week, it can be super difficult to sift through all of them. You definitely cannot read all the readings the night before. In all honesty, it really depends on who you get as a TF. I didn't know anyone else who had a different TF than mine, but she was an extremely hard, meticulous grader. ALWAYS MEET YOUR TF BEFORE PAPERS. Also, a good portion of your grade is speaking up in class. So even if you think you sound stupid, just say something. Essentially, this is an expos-on-steroids class. This is where your WRITING really matters above all else. No room for bs.","The class is mostly discussion based. Read everything assigned and make sure to contribute in class. Most of the things assigned are repeated from other HEB courses or are just plain interesting.","Fun and easy class to introduce HEB to anyone with or without a background in the field.","Good class (obviously if you're an HEB concentrator you have to take it).  Not as much writing as might be expected, though the final small research paper can be kind of stressful if you don't know what you're doing.  Really really small sections.","Take each assignment seriously, and do the readings ahead of time and take notes.","Get Brian as a TF, he is incredibly down to earth and chill.  Class was just a fun discussion about the readings, some interesting videos, and often natural discussion about things we found fascinating.  The whole course is really interesting and a great, not time consuming introduction to the concentration!","Even though it only meets once a week, be prepared for this class to take up a lot of time. Especially if you want a grade higher than a B -- which I assume everyone does.","Obviously this class is a requirement, and in terms of the content, the readings as well as the topics covered are very interesting (as they should be for all HEB concentrators). I think the class needs some further structuring, as the section and the assignments could be nebulous, which can be frustrating in terms of meeting the TFs' rather high expectations. The grading is going to be harder than you think, so be careful when you're doing your assignments and make sure to talk to your TF if you have any questions or concerns.","Take SLS-16 and Primate Social Behavior before this class and it will be easy.","This class provides a great overview of the entire field, at least in the direction that it's going at Harvard. Each week's individual theme gives just enough background to get a feel for whether or not you want to explore that area further and also leaves lots of room for intellectual curiosity. Since there's few definitive \"answers\" in HEB, this was a rare science course that really got you thinking, not just memorizing. Many questions just lead to more questions, but if you like the field, that's not a bad thing. I found myself very interested in learning more about several aspects of HEB research, more than we learned in class, and that's encouraging - now I know I will definitely enjoy exploring this department more over the next two years. The class has a lot of reading but it is definitely worth it to do it all, since it will be painfully obvious if you haven't read (or at least skimmed) - the classes are very small. Develop a good relationship with your Tf (or just hope for a good TF) and the class will be great.","The discussions are really great, the workload is manageable, and you come away from the course knowing\/learning so much more about the subject of evolution and the field in general.","There is a lot of reading for this course but it is all very interesting with a few dull ones mixed in.  The assignments aren't bad if you get a good TF.","make sure you keep up on the reading","Graded arbitrarily, discussions were not enlightening, and I can't say I have a sufficient (even basic) understanding of human evolution.","This course sets you up and gives you the necessary tools to be successful in the HEB concentration","Recommendation doesn't really matter...you gotta take it.","It was my favorite class this semester.","There are a lot of small assignments busy work assignments.","This course is a requirement for all sophomores contemplating concentrating in HEB. The topics are fascinating and the reading-load is not too heavy; however, the expectations your tutorial leaders will have for your overal knowledge of the field and writing seems to be pretty heavy. If you can try to take Primate Social Behavior because most of the topics you'll learn in the course will be discussed in early in tutorial and it'll help you participate more. Also, make sure you do a thorough reading of the articles. Although they aren't long make sure you need them inside out. For some reason my tutorial leader felt that we knew more than we did and whenever you said something  incorrectly her body language would make you feel awful about participating again.","Take an HEB class your freshman year or sophomore spring before you take this tutorial.","Really not a bad tutorial compared to other concentrations. Readings are mostly interesting (although a bit dry and long at times) and discussions were lively. Do the reading, talk in class and you'll be fine.","HEB is a great department, and this tutorial is a relatively pain free way into the field that really introduces you to a lot of relevant and interesting information. Be ready to work, though, because the work load is pretty significant."]},"Spring '13":{"comments":["GET STARTED ON READING NOW. MEET WITH TF ASAP.","The discussion environment could be intimidating at times and it can be difficult to get at exactly what they are looking for in the writing assignments. That being said, the course for what it was worth in regard to the amazing material you would cover was quite enriching. The TF really knows how to force you to critique ideas. The discussion environment could be a bit intimidating because a lot is expected out of you. The instructors will take the time to talk with you about papers figuring out how to link together the ideas. This course truly challenged me throughout the semester and I am probably a better student for it.","Start the readings early every week, and the assignments well before you think you need to!\r\nAlso, develop a good relationship with your TF early. Get a discussion group together outside of tutorial if you feel the need to.","This is a challenging tutorial and at times frustrating, but you'll leave feeling that you learned a lot about approaching work in this field. Be prepared to spend a lot of time on readings, ACBs, and research for writing assignments.","Not a fun class, but it's a requirement so you kind of just have have to grin and bear it.","A lot of reading. The course did not get me excited about being an HEB concentrator.","Take all paper comments very seriously.","Do the readings!  And do them well!  Definitely stay on top of your stuff--everything will not only be much easier, but also a lot more fun.","Try not to save all the readings for the day before as they are more time consuming than expected. Also Brian is awesome so definitely try to get him! He's a tough grader but such a great TF and always willing to go above and beyond to help you.","a lot of reading, cannot afford to do bad on any assignment","Start the readings and assignments as early as possible.","Great class. Definitely try to get Brian! He's the best.","Make sure you get Brian!","If you're at all interested in learning anything about Human Evolutionary Biology the material issued in this course is phenomenal. Unfortunately if you get Stephanie for your TF you may be dreading the section single week. I had Stephanie as my TF and I found her to be unhelpful in section and she created an intimidating atmosphere that I would not recommend putting any undergraduate in to. She was negative and unhelpful at many times over the year and, having confirmed these sentiments with others who took the course, my displeasure is certainly not an isolated experience.","Make sure to meet with your TF. Get to know him\/her and understand the way that they will evaluate the work that you do and the class participation!","If you're concentrating in HEB, you have to take this.  It takes up more time than any course I've ever taken.  It felt like it was 3 courses.  I pulled all-nighters every week for this course.  I learned a lot and improved in a lot of ways, but it certainly was not an enjoyable experience and definitely hurt my performance in other courses since it took up so much time.  Try to make the best of it and spread out your readings and writings if possible, but this obviously is not always an option since there is so much other work for other courses.","you have to take it...","You have to take it. It's a lot of work if you want a good grade and section can be hard. The TF's expect a lot out of you.","Please, evaluate why you want to be HEB. If it is anything short of an undying passion for this field, dont take this class. It's honestly not worth it.","good class but requires a very large amount of time for reading the materials","The readings are definitely tedious sometimes but the class time is really enjoyable. If you're really interested in HEB, it's kind of just 2 hours of talking about cool HEB things, and you get to tailor the discussion to your own interests. Definitely do the readings! Keep track of what is and is not a unique human trait the whole semester, because when you write the human uniqueness survey at the end it will be very handy to have those notes. One class you get to sort skulls, and that's really fun.","Not once have I learned how to effectively write for HEB in this class. I met with my TF about my papers, but I still cannot get above a 73. This should not happen because it is part of the class to teach me how to write. If I take the time to reach out to my TF and do all the readings and listen in class, I should be able to do the work successfully, but I cannot. \r\nHowever, this class does provide an excellent overview of the field of HEB, so it is useful for the concentration.","If you're HEB, you don't have a choice. If you're not, think carefully about how much you enjoy learning about the entire history of human evolutionary biology (ie. alot of apes\/ australopithecus material)","This class makes HEB seem way less interesting than it is. The amount of work you put in is not worth the return. Form a study group early so that you can actually understand the readings in depth.","pick your section leader wisely.","The class covers a lot of interesting topics and includes many great articles, but it offers only a brief survey of these topics and doesn't really get deep enough into any topic to leave you feeling like you have a better understanding. Each week you will feel like you learned something, but by the end of the semester, nothing too substantial will have stuck with you, which is frustrating and makes the class seem relatively unrewarding. Luckily, it will provide you with an understanding of the general framework of evolutionary biology, which will help you to get more out of the other, much better courses offered in the HEB department.","Do the readings and spend effort on the few writing assignments.","You have to take it, but I would not recommend it. Work hard to understand the readings.","I did not find this class to be very enjoyable. However, I've been told that this tutorial is not representative of HEB courses in general.","Do the readings and come prepared to section. Then it's not too bad! But definitely make a calendar or something to stay on top of assignments, or those can sneak up on you and end up taking a lot of time.","Discussion in section is what you make of it--it is better to come prepared.","The tutorial mixes science and storytelling in a very interesting way. Take this if you want to learn things that are fun to bring up in every day conversations.","It will help you discover whether or not the concentration excites you.","This class is a lot of work as far as the papers are concerned.  If you short on time, read all of the abstracts, then read the introductions and conclusions, and if you have time the methods and results.  \r\n\r\nParticipate!  The class dynamic can be really nice.  Also, don't worry about not understanding papers or content.  Papers are sometimes dense and confusing, which is not your fault!  It's the author's fault!  \r\n\r\nAlso, start readings early and take notes so you don't forget the content in section.","I see this class more as a means to an end than a good learning experience. The weekly assignments are repetitive, and the readings often repeat ideas that have been learned before. However, the class discussions were sometimes insightful.","I'd say that the course is really not bad if you do the readings and come prepared to talk during section. Also, if you really want to get something out the course, I would recommend that you spend a little extra time annotating and going back over the readings before coming to class so that you will be able to critically analyze the papers and form your own conclusions about certain hypotheses.","You have to take it. It is hard, but work through it."]},"Spring '14":{"comments":["The more you put in, the more you'll get out of it. I really enjoyed researching and writing the papers, and I loved actually reading On the Origin of Species. Sometimes two hours for a discussion section can seem long, and since it's relatively unstructured, it can start to feel dry, but the more engaged you are, the more you'll learn.","Students considering HEB should know that this course has been completely redone. I don't know what the course was like last year, but it was great this year! My favorite class this semester. You learn about a wide variety of topics that you can study more in HEB, improve your scientific writing considerably, and spend two hours a week discussing interesting theories with a few classmates and great instructor. In my opinion, this is exactly what a sophomore tutorial should be.","If you're an HEB concentrator, you have to take it. But if you've heard bad things about it, don't worry, because it was greatly improved this year! The readings are super interesting and a valuable foundation for HEB, and the TFs (I had Brenda) facilitate great discussion.","This course may not be what you expect. I thought the hard science component would be much stronger, but a third of the course was spent discussing monkeys rather than any biochemical pathways, molecular evolution, etc. The degree of vagueness required in HEB writing (you have to say \"might\" or \"may\" and never \"is\") was frustrating to me, as I felt the course asked for writing that was not literature analysis, but at the same time could not be written with usual scientific, dry certainty. This balance was difficult to find.","Students in HEB have to take this course, so this question is irrelevant","I liked some weeks better than others but overall the material was fairly interesting.","This is a great intro class - Sam was a great TF (and Brenda did a wonderful job the time she subbed for us). It gives a strong overview of HEB that is applicable across all domains, and is really interesting if you're motivated to do the readings. As a tutorial, you obviously have to be prepared to discuss and be on top of your game, but it is definitely worth it","I really learned a lot from this class and enjoyed it thoroughly. Almost all the readings were very interesting and the conversation in class was intellectually stimulating. The class really allows you to see the world through an evolutionary perspective, and this has thoroughly changed my worldview. I've come to learn how evolutionary theory applies to fields beyond the biological sciences, and could be seen to explain all of humankind's endeavors. How many other science classes give you this kind of perspective? \r\nThe assignments are of a reasonable length and the teachers are only too willing to help you craft a strong paper if you meet with them ahead of time. I would STRONGLY recommend doing this. \r\nOverall, one of the best courses I have taken at Harvard!","This class is a great introduction to the Human Evolutionary Biology, and is one that I highly recommend to those who want to understand the \"what\"s and \"why\"s of human behavior and evolution.","They definitely reformed the tutorial structure really well. The class atmosphere is fun, relaxed, and open to learning. Always turn in an outline before a writing assignment and meet with your TF so that both of you are on the same expectations of what is a good HEB essay (which is definitely different from a normal social sciences\/humanities paper!)","A great introductory class. Sometimes conversations about the readings are not as interesting but the readings themself are great. Definitely talk to the Brenda or Sam about the papers in person because they give really good advice and therefore you get better grades too!","This is a pretty good class overall.  Interesting material.  The class is much better this year compared to last year.  Papers are definitely time consuming if you want to do well.","HEB sophomore tutorial is actually interesting and fun. It will really help you improve your scientific writing, research skills, and understanding of scientific papers. The readings are interesting and manageable.","Readings are generally engaging and thought-provoking. Quizzes (due 9AM the day of section and usually posted on Sunday nights) on the readings are painless and an easy 5%. Assignments are not terrible, but I suggest sending outlines to your TF if you want a chance to get an A.","HEB concentrators have to take this, so anything I say here is somewhat moot point.  The TFs are really nice and the readings are interesting, but the essays were no fun at all.","Well, it's still required haha. But it's not that bad, and section becomes fun"]},"Spring '15":{"comments":["This course is a great introduction to evolutionary concepts. The writing assignments are graded pretty harshly but it gets better; they prefer a specific style of writing that you get better at.","This class is a great way to get a solid foundation in the field of evolutionary biology and practice reading review and experimental articles.","The course is well taught but the essays are graded harshly. It's a requirement for HEB concentrators so you have to take it anyway.","This class is an awesome introduction to HEB and the department.","This course is an awesome tutorial. The articles and essays are cohesive and build on one another. At the end of this course, I feel like I'm prepared enough to take any HEB course because I have at least a passing knowledge in most sub-genres of the field. I liked learning in this low stakes way because it really allowed me to tell what I'm most interested in. Sam is a really great TF! Regardless of who your TF is, though, make appointments to discuss your essays in advance. That's definitely helpful in guiding your essay and also in showing your dedication to the class.","It's a requirement for HEB, and your experience will vary depending on your TF.","Engage yourself in understanding the readings so that you can effectively participate in class.","This is a great introduction to the material. The discussion style setup allows for you to ask questions beyond the material, and the essays are fair ways to show your knowledge.","This is a great good overview of HEB and the readings are really interesting. This is definitely one of those classes though where the more you put in the more you'll get out. And meet with your TF before papers! Writing HEB papers is different from other kinds of papers.","most readings were pretty interesting and papers weren't too bad","Very enjoyable tutorial for HEB. Covers the basics in human evolution in an interesting and comfortable section each week. Really enjoyed this tutorial. Office hours are particularly helpful for papers. Go HEB!","Awesome class, learned a lot about Human Evolution. I know its required so all HEB students take this anyway, but I still want to say how great it is!","Just get through it.","HEB concentrators have to take this, so I can't recommend\/not recommend it. The weekly readings were not hard, just annoying. I would also highly recommend taking SLS16 at the same time, since you cover the same material in the same order. As a result, you'll get a really good understanding of the content","This class was a good overview of topics in human evolutionary biology and got more interesting, in my opinion at least, towards the end as we got more into sociality, cognition, etc. and had more freedom to explore what we were interested in, which also helped me clarify what my interests are. As for the format of the class, it's just two hours of discussion every week, which can get a bit repetitive. You're also with the same 8-9 people so each how much you enjoy the section depends a lot on the different personalities and rapport your section develops, but the small size is nice. Grading is based largely on four papers you write throughout the semester, each of which you can get good individualized feedback on; definitely send a draft to your TF before you turn in the final product. I felt like my scientific writing improved a decent amount because of this. Overall a solid class.","You have to take it if you're HEB so just hope you're lucky when it comes to essay grading. Papers are scientific papers and a bit different from expos essays. Mke sure to participate in class and do some sucking up","You have to take it for HEB, but I think it's one of the better required courses (so, so much better than LS1b, for example!) Do all of the readings before class, because it makes section so much better.","Class is totally manageable as long as you do the readings. Papers aren't terrible, just take your TF's advice and use it for subsequent papers.","Great class! Take advantage of the small size and really learn as much as posisible","Class isn't very interesting but reading material can be.","Take advantage of office hours and discussing paper outlines and topics with your TF. It's a good course that is all about breadth. Writing papers about topics you are interested in is highly recommended.","I liked it. Do the reading obviously or its going to be an awkward 2 hours. Start the papers earlier than you think you should. Understand that you don't have to write well, just cover all the main points.","Daniel is a sweet, patient, responsible TF; he makes sure to be available to all to explain everything that he can, from the most basic concepts in the field to interesting ideas in the frontier of HEB knowledge","Great class\/ tutorial that is interesting and fascinating. However, your experience is shaped entirely by which TF you get.","Since section size is so small, your experience in the class depends, a large part, on the dynamic of the people in your section and the way your TF fosters discussion. Interesting topics and writing assignments overall so it should be a good gauge of whether HEB is the right concentration for you.","Submit outlines to your TFs. Speak up in class because participation is big. Treat each paper and assignment as an exciting time to explore and learn more and you'll have more fun.","I loved this class! Essay prompts were super interesting, but a little difficult! Readings were good and interesting!"]},"Spring '16":{"comments":["Great class! Brenda is the best and it is a great introduction of HEB.","i am not a biological anthropology person, but it might be for other people","I think the course is important for HEB concentrators to get a gauge of what the major is all about. It covers good topics. However, how much weekly class is enjoyable depends on how lively the discussion is, and sometimes that depends on what kind of section you get and how prepared the TF is. It sometimes gets a little boring.","This class has been one of my favorite classes at Harvard.  The readings were interesting, the course was very manageable (the readings were short), and overall it was just plain fun!  My advice for future students would be to just do the reading, it's short and interesting, and when it comes to writing papers, be explicit, logical, and concise.  The instructors are very helpful, so if you start early you can ask for feedback on a draft.  I failed to do that on the first paper and suffered for it, but on all my subsequent papers I asked for help, got it, and got a good grade.","Definitely need to take and know the content of this course.  A good learning experience.","Obviously, you have to take this class if you want to concentrate in HEB. But, it really is a great experience. Take advantage of this opportunity to learn about the different topics related to HEB and find an area that interests you!","You have to take it to concentrate in HEB...","This class may seem intimidating, but it fosters a great environment to learn and get to know HEB as a field. The workload is extremely manageable, and assignment expectations are very clear. It's a required class for concentrators, but overall a great class anyway that one of my favorites thus far.","A fascinating class and great introduction to an amazing topic.","Good tutorial considering the horror stories I have heard about other concentrations","This class is an awesome introduction to HEB.","Love this tutorial. Relaxed feel that was great for conversation and engaging with the material","Get Amanda as your TF","Really laid back. Readings are awesome, especially as you go along. One of the best things about it is that it has something for everyone no matter what aspect of HEB you're interested by.","Gives you the full comprehensive rundown of HEB. Workload is readings and four papers throughout the semester.","This class is so much fun! You'll learn about different topics in HEB each week. The grading is very fair, make sure to talk to your section leader when brainstorming for the essay to make sure you're on the right track and it'll be great!!!"]},"Spring '17":{"comments":["Dr. Amanda Lobell is a wonderful tutor. The course is set up to help you learn HEB concepts (topics are clearly structured and readings are thoughtfully chosen) and succeed (ex. paper weights increase over course of the semester). The papers can be challenging, though -- don't put them aside until the last minute. Ask for advice on outlines and really take advantage of sections as a time to ask questions and talk to others who are just as passionate about concepts in human evolutionary biology!","This is an enjoyable course, and a great way to gain familiarity with the full spectrum of HEB. The weekly readings are manageable (especially if you start them early in the week) and the papers are straightforward and interesting to write. Your instructor will also be happy to provide feedback to you on your writing (as was my instructor, Bridget). Class meetings are something to look forward to, as it is interesting to discuss papers and various topics with your classmates and instructor.","On weeks I didn't have papers, I would only spend about 2 hours on readings and doing discussion questions. I found some of the papers challenging, and some of the articles difficult to read. The course was moderately difficult.\r\n\r\nYou have to take the course for an HEB requirement, and I don't think it is too bad. Two hours a week, where the two hour chunk can feel a little long. Your TF will make or break the experience. Amanda is absolutely amazing! I loved having her as a TF - she is a fun, interesting, incredible person who makes the conversation engaging and will always steer you in the right direction! She is also so accessible, will email you back right away and gives such good feedback! Writing a paper for each assignment (a total of four times) can be a little tedious and it'd be nice to do a final project in the end, but you get better at papers each time.","I hope you haven't already taken SLS16! This class seemed to be a condensed version of that.","Fantastic introduction to HEB. Really enjoyed discussing readings\/topics in evolution in small groups.","The writing grades are brutal","I really really enjoyed this course a lot. Daniel was an absolutely great section leader and I always enjoyed our discussion! He certainly knew how to lead a discussion very well without any awkward pauses, inform us of his knowledge on the topic, and also allowing us to contribute our opinions. He was absolutely amazing and the course overall was great because of how much I enjoyed my section discussions. I was highly encourage to to always be very involved in the discussion because it really allows you learn a lot from the course and makes the 2hrs go by so quickly!","This tutorial is a great introduction to HEB, and will definitely make you feel a part of the department.","you need to tell it to concentrate in HEB. I wouldn't take any major HEB classes before enrolling in this or else it will seem super repetitive.","This is an awesome tutorial. The amount of reading and writing assignments is very fair, and they actually contribute to you learning. The discussion format of this class is great because you can focus more on the topics\/papers you are interested in, and you can ask all of your questions to the preceptor without feeling like you are messing up the flow of the class.","reach out to your teaching staff!","Get Daniel as your tutorial leader -- he is awesome and so dedicated to all the students and such a kind person! Discussion was always lively and the topics are all super interesting! Great class and does not all feel like an unnecessary for HEB concentrators.","This course is a lightish one, but you won't really learn much new if you've taken or are in SLS 16.  This also isn't a great course to meet other people in the concentration because there's no real encouragement to interact.","This is super fun, so even though you have to take it, you can look forward to it.","Go in for a lot of help on papers","It's okay not to do well, HEB isn't an easy concentration.","A lovely tutorial! The readings were interesting and it is well-organized!","I absolutely loved this tutorial!  The readings they selected were short and interesting, the writing assignments left enough flexibility to choose a topic that interests you, and the teaching staff is incredible!","It is required for the HEB concentration, and requires some hard work, but it is also very enjoyable.","The tutorial is a great way to learn about all the basics of HEB and discuss anything that you have in mind. I enjoyed the course.","Do the readings and take effect and clear summary notes and everything else will be okay!","This class serves as a great way to learn about many of the topics you can study in HEB.  Also, I would recommend discussing your assignment topics with your TF in office hours to help make sure you are on the right track.","This class is great because you can have a lot of in-depth discussions in your small sections which helps you really understand the basics of HEB. But, if you've taken another intro HEB class like HEB 1280, then some of the topics and readings you go over will be redundant. Also, definitely take the time to talk with your section leader about your essays because it can be easy to make mistakes or not be thorough enough in your writing. Overall, its a good class and a good way to start off your work in HEB.","my favorite course of the semester. Bridget is an awesome section leader for this course. It covers a lot of cool topics."]}},"mostRecentQ":{"overall":"4.10","workload":"4.00","difficulty":null,"recommendation":"4.20","enrollment":"41","response rate":"82.93","QCourseOverall":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"0","2s":"0","3s":"3","4s":"12","5s":"9"},"QDifficulty":{"number":"HEB 97","course_id":"2715","cat_num":"2205","1s":"0","2s":"1","3s":"21","4s":"4","5s":"0"},"QWorkload":{"number":"HEB 97","course_id":"2715","cat_num":"122625","1s":"4","2s":"19","3s":"1","4s":"0","5s":"0"}},"success":true}