{"scores":{"Spring '17":{"course_score":{"overall":"3.70","workload":"5.20","difficulty":null,"recommendation":"3.90","enrollment":"33","response rate":"81.82","QCourseOverall":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"1","2s":"9","3s":"8","4s":"13","5s":"7"},"QDifficulty":{"number":"GHHP 99","course_id":"2148","cat_num":"2981","1s":"1","2s":"7","3s":"13","4s":"3","5s":"0"},"QWorkload":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"5","2s":"23","3s":"5","4s":"0","5s":"1"}},"instructor_scores":[{"number":"GHHP 99","cat_num":"123102","course_id":"2148","year":"2016","term":"2","id":"bbd786b149e2008191ae8eb37a3e82ba","first":" David","last":"Cutler","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.20","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '16":{"course_score":{"overall":"3.40","workload":"4.90","difficulty":null,"recommendation":"3.60","enrollment":"45","response rate":"84.44","QCourseOverall":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"1","2s":"9","3s":"8","4s":"13","5s":"7"},"QDifficulty":{"number":"GHHP 99","course_id":"2148","cat_num":"2981","1s":"1","2s":"7","3s":"13","4s":"3","5s":"0"},"QWorkload":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"5","2s":"23","3s":"5","4s":"0","5s":"1"}},"instructor_scores":[{"number":"GHHP 99","cat_num":"123102","course_id":"2148","year":"2015","term":"2","id":"bbd786b149e2008191ae8eb37a3e82ba","first":" David","last":"Cutler","InstructorOverall":"3.00","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"3.50","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '15":{"course_score":{"overall":"3.70","workload":"3.50","difficulty":null,"recommendation":"3.90","enrollment":"34","response rate":"76.47","QCourseOverall":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"1","2s":"9","3s":"8","4s":"13","5s":"7"},"QDifficulty":{"number":"GHHP 99","course_id":"2148","cat_num":"2981","1s":"1","2s":"7","3s":"13","4s":"3","5s":"0"},"QWorkload":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"5","2s":"23","3s":"5","4s":"0","5s":"1"}},"instructor_scores":[{"number":"GHHP 99","cat_num":"123102","course_id":"2148","year":"2014","term":"2","id":"bbd786b149e2008191ae8eb37a3e82ba","first":" David","last":"Cutler","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.40","GeneratesEnthusiasm":"3.90","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '14":{"course_score":{"overall":"3.40","workload":"1.80","difficulty":"2.80","recommendation":"3.60","enrollment":"30","response rate":"80.00","QCourseOverall":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"1","2s":"9","3s":"8","4s":"13","5s":"7"},"QDifficulty":{"number":"GHHP 99","course_id":"2148","cat_num":"2981","1s":"1","2s":"7","3s":"13","4s":"3","5s":"0"},"QWorkload":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"5","2s":"23","3s":"5","4s":"0","5s":"1"}},"instructor_scores":[{"number":"GHHP 99","cat_num":"2981","course_id":"2148","year":"2013","term":"2","id":"bbd786b149e2008191ae8eb37a3e82ba","first":" David","last":"Cutler","InstructorOverall":"2.90","EffectiveLecturesorPresentations":"3.10","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"3.50","FacilitatesDiscussionEncouragesParticipation":"3.30","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '13":{"course_score":{"overall":"2.74","workload":"2.15","difficulty":"3.08","recommendation":"2.87","enrollment":"46","response rate":"84.78","QCourseOverall":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"1","2s":"9","3s":"8","4s":"13","5s":"7"},"QDifficulty":{"number":"GHHP 99","course_id":"2148","cat_num":"2981","1s":"1","2s":"7","3s":"13","4s":"3","5s":"0"},"QWorkload":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"5","2s":"23","3s":"5","4s":"0","5s":"1"}},"instructor_scores":[{"number":"GHHP 99","cat_num":"2981","course_id":"2148","year":"2012","term":"2","id":"bbd786b149e2008191ae8eb37a3e82ba","first":" David","last":"Cutler","InstructorOverall":"2.82","EffectiveLecturesorPresentations":"2.82","AccessibleOutsideClass":"1.86","GeneratesEnthusiasm":"2.71","FacilitatesDiscussionEncouragesParticipation":"2.71","GivesUsefulFeedback":"2.50","ReturnsAssignmentsinTimelyFashion":"2.33"}]},"Spring '12":{"course_score":{"overall":"2.55","workload":"1.74","difficulty":"2.98","recommendation":"2.60","enrollment":"51","response rate":"84.31","QCourseOverall":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"1","2s":"9","3s":"8","4s":"13","5s":"7"},"QDifficulty":{"number":"GHHP 99","course_id":"2148","cat_num":"2981","1s":"1","2s":"7","3s":"13","4s":"3","5s":"0"},"QWorkload":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"5","2s":"23","3s":"5","4s":"0","5s":"1"}},"instructor_scores":[{"number":"GHHP 99","cat_num":"2981","course_id":"2148","year":"2011","term":"2","id":"bbd786b149e2008191ae8eb37a3e82ba","first":"David","last":"Cutler","InstructorOverall":"2.83","EffectiveLecturesorPresentations":"3.21","AccessibleOutsideClass":"2.50","GeneratesEnthusiasm":"3.44","FacilitatesDiscussionEncouragesParticipation":"3.43","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.60"}]},"Spring '11":{"course_score":{"overall":"3.58","workload":"2.37","difficulty":"3.15","recommendation":"3.78","enrollment":"32","response rate":"84.38","QCourseOverall":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"1","2s":"9","3s":"8","4s":"13","5s":"7"},"QDifficulty":{"number":"GHHP 99","course_id":"2148","cat_num":"2981","1s":"1","2s":"7","3s":"13","4s":"3","5s":"0"},"QWorkload":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"5","2s":"23","3s":"5","4s":"0","5s":"1"}}}},"comments":{"Spring '11":{"comments":["The course is well intentioned but falls flat.","It is very fulfilling to create your own research project and to see it through.","Although the course says David Cutler is the professor, he only guest lectures once. The remainder of the class is taught mostly by the TFs (who are awesome, yes, but not the advertised deal) and other guest lecturers.","Yes, it was a requirement, but it was far less painful than I thought. I was really pleased with the research I was able to do, and the teaching staff was great.","Have a topic in mind before beginning the semester","GHHP 99 was a great class and a great way to fulfill the GHHP secondary field research requirement. Whether you're bringing in research you did over the summer on a fellowship, or you want to start a new research project, you'll get a lot of great feedback from the great teaching team and a lot of support in bringing your project to completion.","This is a great way to fulfill the research requirement for GHHP99.","This course is a good way to fulfill the research component of the ghhp secondary. Though the research paper can be daunting, the lectures are interesting, and the research paper is definitely doable.","This course gives you enormous freedom to pursue your health policy interests.","This course prepares you well to write the final research paper but does a poor job in presenting both side of the health care bill.","To do well in this class you need to know what you're doing and not need much help. While you are presented with the most basic methods for research, you will end up having to figure out how to go about this paper on your own\/with little help. If you can, I would take an independent study with a professor that you like to fulfill this requirement instead of this class.","I think this class is a great prep class if you are interested in health policy, or if you have a project that you are really excited about pursuing.","This course is an opportunity to learn a lot about research- esp independent research- but it's very challenging for a beginner to research.","Come to the class with a strong idea of what you want to write about.","This class is an accessible, useful, applicable introduction to research methods in health policy.  It teaches you how to do qualitative and quantitative research, how to make a good poll and do a good interview, and how to write critically about issues in health policy.  The TFs are very committed to making the course a good experience, and I really enjoyed the course.  I learned a ton about how to conduct quality research and came away with an interesting project.  I definitely recommend taking the course- it's so much more than just fulfilling a GHHP requirement.","You need to stay on top of your project throughout the year, otherwise you'll be writing your entire paper and doing all your research\/data analysis at the end (painful!!)","Reach out to TFs a lot because there are not a lot of check ins during the semester with them. Make sure you are asking the questions necessary to best collect data AND present your data ahead of time."]},"Spring '12":{"comments":["Wouldn't recommend to take this class unless you have to satisfy the research requirement for GHHP secondary. Try not to procrastinate on the assignments; you'll regret it otherwise. The lectures are somewhat removed from the work you have to do on your own but try to be there. Take advantage of the office hours, and run your ideas by the TFs as often as possible.","You should know your project pretty well ahead of time, or the semester will be a bit of a nightmare. If you have the option to do something else like an independent study, do it. This project essentially asks you to do a mini-thesis in a semester, from finding a topic to writing a huge paper.","I will tell any GHHP secondary concentrator to ABSOLUTELY opt to do the independent study version of this GHHP research requirement instead of this class, its a complete waste of time.","This class was poorly organized, with very little support for what turned out to be a pretty difficult project. However, the sense of accomplishment you will get for being able to produce a research project that is, in essence, entirely your own work, may make it worth it.","Take it if you have to, but it would be preferable to find another way to fulfill the research requirement for the GHHP secondary.","if you're capable of self-guided and self-monitored work, it's not all that hard and it's fun to choose your own research topic","This is not a fun class.  Most of the lectures deal with intricate statistical methods that 90% of the class won't need or have already seen in statistics course.  The lectures did not prepare us for the paper-writing or researching except for the discussion given on how to write such a paper by a guest lecturer.  If you are able to fulfill this requirement by doing individual study, DO IT!  The lectures were a pain, but the TFs are nice, helpful, and always available.","the course is a requirement, but the lectures will not be particularly applicable to your project so unless the structure changes, you will have to figure it out on your own. talk to your tf often and ask your friends in the class to look over your research tools. also, seek out good research papers to model your work on because the course provides only a few examples.","the research part of achieving this course was worth it for the secondary requirement. you acquire good knowledge","While the course can seem tedious at times, the TF staff is great and they all really enjoy working with students.  Get to know your TF and you'll come out able to write a really good research paper.","Don't take it; the class is badly organized, and you will not learn anything.","Go in with some idea of what you want to do. The class is great at teaching you methods for research and making teaching fellows available to help you with the methods that you choose. It's not a brain-storming class and you won't always have someone holding your hand throughout the process.","Take the option to write a chapter for your thesis.","Low time commitment until the end of the semester. May be a very good course if you already have an idea of what you want to write about, but otherwise there is little guidance and you're pretty much on your own. Lectures are not very useful, but at least the class is only once a week!","This course is a bit disorganized but the TF's are great and try their best. Prof Cutler only lectures for one class, and the rest of the lectures are a hodge-podge of material that you may or may not know already, and may or may not need for your research project. It is an interesting capstone to the GHHP secondary field but the organization of the class could be improved.","Lectures are pretty useless, but it's cool to work on an independent project. Reach out to your TF for specific help with your project because lectures won't prepare you for the work you have to do on it--the best part of the class is working with your TF and on your own.","you have to take it for a GHHP secondary (without a relevant thesis or chapter in your thesis), otherwise I wouldn't recommend.","Although there isn't as much work in the beginning of the semester, most of it is pushed to the end where you are writing your paper. Come in with a topic or at least a general idea as it will make your life at lot easier. Start early as possible.","You have no choice if you are taking this class.  The paper is not bad as long as you plan it well.  i would recommmend setting deadlines with your tf.  That sounds like it sucks but you will be alot better off when May rolls around.","You have to take ownership of your research project because the course is not designed to do it for you.  And come into the course with an idea for your topic.  A background in statistics is somewhat necessary as qualitative papers are discouraged.","Do independent study with a professor or write a chapter of your thesis on global health instead","If you are a thesis writer, it's much less painful to just add a global health chapter.","Start your project early","It's a good way to fulfill the research requirement for the GHHP secondary field. However, if you're looking for a significant research experience, it might be more helpful to do an independent study with a professor or start your project a semester earlier.","1) Cutler is not the professor - in fact, he only speaks once. 2) For the GHHP secondary, this class (besides an independent study) is essentially the only way to fulfill the requirement. So take the fact as it is. 3) The final 30 page paper is basically a mini-thesis that did take a lot of time near the end of the semester, so be sure to pace yourself. FINAL WORD: As long as you pick a topic that you're truly interested in, you'll really gain something from this class!!!!!!!","A lot of the lecture material is information you've probably already learned. It is kind of a check-box class to complete the final requirement for the GHHP secondary. The TFs are awesome and give good feedback, so don't wait until the end to do your project!","Don't do it unless there's just one research project you passionately want to do. It's not worth the secondary to be this annoyed.","Don't do it. Well, maybe do it if you have a really specific research idea that you're excited about. Otherwise, find a faculty member with whom you can do research. Or don't get a secondary in GHHP -that's just fine. It's a miserable course with irrelevant lectures taught by inflexible TFs that aren't understanding of competing interests. Such as honors theses. The research proposal was due one day before many of us turned in our theses. That didn't work out so well -and no extensions were granted (or they were, just not for me?). Don't take this course.","If you really want a secondary, go for it, but this class has little structure and lectures are so useless that it becomes a pain. It's not difficult to produce a final product, particularly if you set reasonable deadlines for having a data set\/ having all collected data you need but ultimately the unstructured nature of this class is frustrating.","The lectures are unnecessary to attend since all of the material is posted online. Make sure you have your data sets FAR IN ADVANCE and don't leave it all until the end."]},"Spring '13":{"comments":["This course is good if you have to fulfill that GHHP requirement and do not want to do an independent study (which may require lots of your own initiative), but be warned that if you are also writing a thesis\/recruiting, the deadlines are harsh and often inflexible.","this is a requirement for GHHP if you're not writing a thesis, so you basically have to take it- I think it was useful that they revamped the sections and overall I liked the class- but the sections were unnecessary long, they could definitely cut them down.","There is a very good chance that you will be heavily re-writing much of the final paper's components even past their initial due dates. Editing is a given, but adjustments in research topics are very likely (and very impacting on your overall workload).","Just stay on top of all the drafts and writing your final paper will be easy","If you're a senior thesis writer, DO NOT TAKE THIS COURSE. It's so much easier if you take the other option instead of taking this poorly managed course that's super strict about deadlines.","Make sure to think about your topic early and work on this project throughout the entire semester. It will be a shitshow if you guys leave it till the end. So many things can go wrong that you wan't to already have written a significant amount of it to save you time.","This class was so rewarding. I looked forward to section every week and I'm really proud of the paper I produced at the end. You will do significant research work and produce an almost thesis-level paper at the end. Be prepared to start early and devote a good amount of time to writing, data analysis, and editing.","This class isn't difficult, perse, but it's painful, especially if you really don't care about your research topic and you are just doing the class to get the secondary.","Do an independent study instead! This is pretty much useless!","The class is easy, and will not be a major burden your senior spring. If you're worried about your other classes (e.g. a thesis, or that last class in your concentration to hopefully boost your GPA) then this class ain't half bad. If you hope to get something meaningful out of it, go ahead and give up that delusion.","Unless you have to take it for the secondary, dont.  And even then, don't.","Make sure that you're pursuing a topic you truly are passionate about. It can be your own version of a thesis. I had the opportunity to work with someone from the school of public health who said that our collaboration can be published.","It was a decent class and is good if you want to conduct research with guidance and get a secondary.","Don't take this course. There are less painful ways to fulfill the requirement, and you won't have to deal with horrible TF's, painful assignments, and poorly structured course. I read the Q comments from last year and I thought: \"Maybe I can do this; I have survived pretty bad courses.\" But I was wrong. Learn from me; avoid this and do independent study, especially if you are also writing a thesis.","Don't take this class if you're doing a thesis (unless they are more flexible with their deadlines). Seriously, just write an extra chapter to your thesis.","Start work early!","If you can write the thesis chapter, do it. This course lacks structure and is very stressful. If you have to take this course, brush up on statistics and think ahead on what topic you might choose for your project.","This course was okay - I really liked the section format of the course and my section leader was great.  However there is not that much support to conduct your independent research.  You need to be prepared to work independently, and likely without an advisor that knows anything about your field.","If you can write a section of your thesis about an issue in global health, I would definitely recommend doing that.  I would only recommend this class if you know exactly (or more or less) what you want to research.  The TFs will help you with technical issues, such as methodology and data analysis, but the bulk of your paper is up to you.  The grading is pretty tough, so while there's not a lot of work except for the paper, it's definitely not an easy A class.","Time intensive, but totally worth it! You get to choose your own project and research a topic that you want to learn more about. This is not the kind of research that I original thought it would be though, the typical \"research paper\" where you have an argument and support it with background research. This is more like a scientific research paper and the literature review is about a third of your paper. Come prepared with a topic that you want to research. The sooner you start, the better!","The section component of the class resolved many of the problems with GHHP 99 in the past. It will help keep you on track. Writing my final draft was not difficult because of all the tailored help from section and my peer partner.","They try to make the process painless, but if you're not up for conducting a research experiment and writing 20-30 pages on it, don't do it."]},"Spring '14":{"comments":["unless you're a GHHP secondary and not writing a thesis, i probably wouldn't take this class. that said, you just work on one paper the whole semester, so it's pretty easy to spread out and make non-stressful","Great class, not stressful unlike some past rumors. Great way to explore topics that interest you.","This class is low maintenance throughout the semester but it is best not to put off the last bit of the paper till right before it is due.","If you want to get that GHHP secondary field, this course is one of those necessary evils that you need to overcome. It's really not too bad. The assignments are a pain in the butt, but not difficult, and they all lead up to the 20-30 page paper that you'll be turning in at the end of the semester anyway. But that being said, if you could just add an extra chapter to your thesis, definitely do that rather than taking this class. The sections (2 hours per week) were frankly a big waste of time.","The class is focused entirely on your paper- take advantage of this and get your work done on time.","This class is really nice. Just keep your paper in mind for the whole semester to make it easier on yourself. And don't leave things to the last minute!","Paula was exceptional! Your TF makes a huge difference. Choosing a topic is the most difficult part of the class. Otherwise, though, it was not an intimidating course, and the work is laid out in such a way that by reading period you already have some 16 pages written!! Don't stress about taking this class -- it's reputation for being difficult and not well organized was much more exaggerated.","This class is a waste of time. Do the independent study instead. The lectures in this course are a waste of time, although having the assignment deadlines helps you write your paper over the course of semester rather than the last minute. It was unfortunately a painful class though :(","The class was a pretty painless way to fulfill the secondary requirement. I had a lot of support from the TF and my classmates were helpful as well. I really enjoyed doing research and am proud of my final product.","Don't take this it's so annoying. Find another way to fulfill the research requirement","Think about a potential topic before the semester begins because you won't have a lot of time to make up your mind once class starts. Spend enough time on the assignments as they're due during the semester because they'll help you a lot when it's time to submit a final draft.","I'm not sure why people have not liked this course in the past. I loved this course and writing the paper (I also had an awesome TF). That being said, I think this course is highly dependent on who your TF is and whether you already have a topic that you are interested in. If you can really relate to your TF and find a good topic in advance of the course, you'll have a great time writing the paper. The structure is pretty good, just make sure that you take the deadlines for all of the individual components seriously so when you're writing the final paper, you're not rushed.","This course provides a foundational understanding of how to formulate a working research question and how to answer that question, skills that every college student should learn during their academic career. Personally, I would say this course is most helpful for those who have not conducted much research and especially for freshman and sophomore students, even though this course often has a reputation of being taken by seniors. Coursework is manageable, and the support of a teaching fellow in a small section is very helpful.","While the teaching fellows have only the best intentions, the course fails to be more than a feebly-unified program of independent studies with no real direction or guiding focus. If you need to take it, take it, but be prepared for a very self-guided experience","I considered this course to be an assisted independent study. We only met each week for the time needed to go through that week's powerpoint and we're often out in less than two hours. The TFs are very approachable to help every step of the research, which is very helpful!","necessary and not terribly painful, but try and make sure you're on top of things throughout the semester"]},"Spring '15":{"comments":["This class is definitely more of an annoyance than anything, in that it seems like kind of an unnecessary hurdle you need to get through to get a GHHP secondary. However, it really is only one 20-page paper for basically the entire semester, and if you're not like me and an enormous procrastinator, by the end of the semester you have a significant portion of it already done. Plus, if you didn't write a thesis (which is probably the only reason you're taking this) it's a much less stressful way to write a research paper on a topic of your choice.","Only should take this course to cover the research requirement for GHHP.","This course is a good option for fulfilling the research requirement, but you need to make sure you have a good topic that you are confident about in order to do well. If you have a topic that you already have researched before, then it will be helpful in the long run.","Well-organized course that made writing the paper a breeze. Doesn't take as much time as you think it would as long as you stay on track with the deadlines.","This course is pretty chill. You only have to write up to your results during the semester. I finished the last bits of my paper (results, appendices, discussion) during Reading Period. The class is also graded pretty lightly or at least my section leader (Shaniece) graded lightly. I like being able to engage with a topic in a deep way,  but I found  the paper itself to be a little anti-climatic. This is probably because I wrote similar types of research papers in high school, but overall it was a chill course that's not a pain to take if you're trying to get a GHHP secondary and didn't write a thesis.","It's a pretty chill class. The assignments all help to make up part of the final paper, so that by the end of the semester when you have to finish up writing your paper, you only need to write up 5-10 pages.","This class is really boring. Really bad, and its so sad they make this a requirement because it is incredibly useless. If you can, plan ahead and see if you can fulfill the secondary another way, like independent one semester project.\r\n\r\nIf you do take this class, it is very easy!!! You will do little to no work on most weeks. The final paper is long, but you have checkpoints throughout the semester so that by the time you actually go to write your paper, it is about 50-60% done. Don't expect to enjoy the class though. I picked a topic I really liked, but lecture itself was so dumb.  A necessary evil, but not hard.","This course is a fine way to complete the research component for the GHHP secondary field. Though they make you choose and stick with a topic a bit too quickly, the assignments throughout the course breakdown the components of your final paper, which makes the workload not too bad and forces you to complete a little bit at a time (which is helpful).","I really enjoyed how open-ended this class is. It gives you time to explore a global health topic you are interested in! The usefulness of the sections really depends on your TF","Don't leave the paper for the last minute.","Great course! Excellent way to fulfill the research component of the GHHP secondary! Just make sure that you are focused and organized in order to have sufficient time to complete your research.","Take this if you need to fulfill it for your Global Health Research Requirement","Pretty low commitment as long as you keep up with the deadlines. A little more guidance would be helpful. Don't take this if you're writing a thesis","Keep up with the work and really pinpoint the exact question you want to answer with your research.","If you have to do your global health research credit, this class is honestly the way to do it. While assignments can be painful, you will thank yourself during reading period when you already have least 10 pages of your 20 page paper. The feedback by the TFs is actually really great. There are only like 4 times during the semester when things get real and you have to write a significant amount. Take it from someone who absolutely hates writing and is the slowest writer on the planet: this class really wasn't that bad.","Let's you do research on a topic completely of your choosing. You only right one paper the whole semester so it is very manageable","This is a great second semester senior year class. Most of the other students are seniors, and everyone just kind of gets it. It's mainly focused on one paper, which actually proved to be quite fun and instructive to research. I learned a lot about policy and can definitely have informed discussions about it based on research, politics, etc. If you have to take this secondary for GHHP, it does help to begin brainstorming a topic as soon as you can."]},"Spring '16":{"comments":["I was honestly dreading having to fulfill the GHHP requirement this way, but this course was honestly not that bad. The sections are useful and geared towards a specific element of your paper each week. Make sure to choose a topic that you really care about, perhaps even some original research, because otherwise it would be hard to stay interested in the project all semester long. The number of topics that you can explore was a lot larger than I had originally imagined, and the TFs were quite willing to work with you to find something that really interested you.","If you have a topic you have already done some research on in previous classes, it makes the class a bit less stressful","This class is horrible in mostly every way. The structure of the syllabus does not make any sense (you're expected to turn in 10 page papers throughout the semester before you've even done your research\/learned what the outline of your paper should look like), the assignments are graded arbitrarily, and the class time is spent learning material you need to learn in high school.","This course is a great way to fufill the GHHP research requirement. As long as 1) write about a topic you are interested in and 2) stay on top of all the deadlines this class will be painless. I actually somewhat enjoyed in (and I hate school)","take it because you need to","Even though this course was \"required\" for GHHP, I really got a lot out of it and can walk away from college feeling like I was exposed to the research process.","This course is great because it allows you to choose a health topic that you're really interested in and you can spend an entire semester researching it. It also provides close guidance how to tackle a 25-page paper if you've never written one before because it breaks it down into different components and explains how to write each part. Sometimes the sections are boring and it's easy to place the class on the back burner because it's really only one big assignment the entire semester, but it's really rewarding at the end if you put the work in to research and writing during the semester too.","This course was a great course, enjoyed our weekly meetings and found the last lecture with Professor Cutler to be extremely interesting.","GHHP 99 is a wonderful opportunity to do research on something that inspires you; however, you must put in a lot of time, stay on schedule, and ask for help. I am very happy that I took the course because I really enjoy doing research and having the agency to choose my own topic related to health\/healthcare was exciting. The time that it demands is due to the fact that unlike in other courses where you write research papers based on the curricula you have been learning throughout the term you are writing about something that the course does not teach you about. The curricula or topic of your paper is determined by you and taught to yourself by you. \r\n\r\nThe course is taught in sections only for two hours a week with the exception of two lectures from Professor Cutler (who is very accomplished!). My TF, Ashley, was great and very helpful. Definitely meet one-on-one with your TF often and email any questions.","What a great class! You get to research a topic you're personally invested in and you do it in a laid back environment. Everyone is a senior and interested in health policy which makes for a great vibe -- actually enjoyed going class every week!","Definitely not too difficult! Just keep up with the paper throughout the semester so it is a smooth\/easy ending.","Obviously everyone in this class is there for the GHHP research requirement. While it was great to have the chance to focus on a topic for a semester but the course was poorly designed and didn't really do anything to enhance our understanding of Global Health and Health Policy beyond the other courses we have taken already.","If you can fulfill the secondary requirement another way, I would probably recommend that over this class. The class felt pretty disorganized because most of the assignments were geared towards research papers even though everybody in my section except one person was doing a policy memo instead. We also basically stopped working on our papers the entire second half of the semester. It would've made sense to keep incrementally working on it as had been done in the beginning. Finally, grades definitely seemed a bit harsh. My TF told me that I was in the upper quartile in terms of grades in the class, yet I'm pretty sure I'm sitting at around an A-. So it looks like very few students will actually get an A. But there is very little work many of the weeks, the one upside to this class.","Just TAKE IT!! Oh my gosh, this was probably one of the most rewarding classes I have taken at Harvard. The GHHP courses have generally been my very favorite ones here. I wish this were a concentration or something. JUST TAKE THIS CLASS!","GHHP 99 was the last course I took for my GHHP secondary. While I was happy with the end product, I must admit that I didn't see the point too often with the weekly section. A lot of the time, the powerpoint slides wouldn't be 100% relevant to what the majority of the people in my section were doing (policy papers) which made it difficult to stay focused. Also, just as a heads up, there can be a LOT of variability in teaching quality and feedback depending on your TF. My TF was pretty solid with giving feedback and being responsive so I was pretty pleased overall, but I know that wasn't everyone's experience.","Take this class as early as you can. It is very good practice for how to write a long research paper well.\r\n\r\nTHIS course is what Expos tries to be. I wish I had this class freshman year, or every year. I learned how to write better, how to research better, and how to plan writing a paper better. Highly recommend this course, and I think it's format should be used to inform structuring of Expos courses. Working on one paper throughout a semester, rather than three short ones, helps you hone your research and ideas as well as incorporate feedback into the editing process to make your writing better. THIS is how college students should be taught how to write.","A way to structure your semester so that you can do a 20pg paper with less stress. But still rather tedious of a class and not much to learn.","This class is unavoidable for secondary concentrators that are not writing a thesis, so take it if you must. But, it would be helpful if you prepare your topic far in advance and really think it through, because half of the class spent the first half of the semester struggling with the topic. So, even though you are writing bits and pieces of your essay as you go, if you haven't yet shaped your topic perfectly, your early writing is not that useful. Definitely the most stressful class of my senior spring.","It might be more worthwhile to work with a professor on a specific global health topic you want to research. This class isn't a bad substitute, as it allows you to check-in with someone with knowledge in global health research and policy recommendations, but the \"lecture\" style of the section is a bit long.","Great class, especially if you have a research topic you're interested in exploring. It's almost all on your on time, so if you're good at managing your time and not procrastinating, this class will be a breeze for you.","It is what you make it, but I enjoyed it overall.","This course is a great way to learn more and think critically about a particular questions in global health. Paper topics are completely flexible, and Michaela was an awesome TF!","Having the deadlines made the paper much more manageable, but I would try to 91r instead if you can.","GHHP 99 was a painfree and kind of fun way to fulfill the GHHP secondary requirement.  Get Mendeley, it helps so much!! Also make sure to take advantage of your TF and ask lots of questions and get guidance from them.  The TF\"s are an AMAZING resource.","I took this course because I had to for my secondary, but did not enjoy it at all. I did not write a thesis because I do not enjoy research that much, and after writing the paper this term, I still do not like research that much. I wish there was a course, not a research course that could be offered as a requirement for the secondary.","If could do an extra thesis chapter for the GHHP research requirement, I would recommend doing that instead of taking this class. There was very little support or guidance from the teaching staff in developing the final research paper. Class time was not well-spent and lectures were rarely helpful in developing your project."]},"Spring '17":{"comments":["Decent amount of work but it's very spaced out, manageable, and worth it if you're genuinely interested in your topic.","I took this course to fulfill my research requirement for the GHHP secondary, and I really enjoyed it. If you come in with a few topic ideas, you'll get a nice head start.","Try to be in Adrian's section! He is an amazing TF.","I liked this class because I liked my research topic and I was assigned to a great tf.","It was great to explore something I am personally interested in","Continually work on your paper instead of working on it in bursts.","I really enjoyed this course! I went into the semester a little bit nervous because I had initially intended to do an independent study research project with a professor but that fell through. I'm so glad this option worked out for me! Cassie (if you have the option to get her) is an excellent TF and really made me feel like I was getting a lot from the class. She also had tons of insights about her experience in med school, grad school, etc. which meant she also had excellent feedback on all of our proposals. When you select your topic, make sure you pick something you're interested in, because you will be learning A LOT about that topic (and if you like the topic, the research will be way more fun).","The class is as easy or as hard as you want it to be. Throughout the semester, each week you will write a section of what will ultimately come together to be your final paper. If you put a lot of work on the front end, the class is very easy. Make sure you do a lot of research on your topic before beginning to make sure that it hasn't been done, that there's enough information on it, and that it has a clear question. The section component of the class was great. Michaela is an EXTRAORDINARY TF and made the 2-hour sections very constructive and useful. This class is a good way to finish the research component of the GHHP secondary while exploring a topic that you are interested in.","Take this because you have to! It really isn't that bad, even the time that is wasted it's only 2 hours a week.","This class is a good way to write a research paper. Overall, it is not too stressful because you work on the paper throughout the whole semester, and you have the help of your TF, as well as the feedback of your peers. It's also fun and cool to see what topics people investigate, which are always very unique. Overall, a pretty enjoyable experience if you have to write a paper.","I really liked this course. My TF was great, I had the opportunity to work intensely on a research topic I really cared about."]}},"mostRecentQ":{"overall":"3.70","workload":"5.20","difficulty":null,"recommendation":"3.90","enrollment":"33","response rate":"81.82","QCourseOverall":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"1","2s":"9","3s":"8","4s":"13","5s":"7"},"QDifficulty":{"number":"GHHP 99","course_id":"2148","cat_num":"2981","1s":"1","2s":"7","3s":"13","4s":"3","5s":"0"},"QWorkload":{"number":"GHHP 99","course_id":"2148","cat_num":"123102","1s":"5","2s":"23","3s":"5","4s":"0","5s":"1"}},"success":true}