{"scores":{"Spring '17":{"course_score":{"overall":"3.50","workload":"4.30","difficulty":null,"recommendation":"3.40","enrollment":"25","response rate":"72.00","QCourseOverall":{"number":"ECON 1050","course_id":"13760","cat_num":"123893","1s":"3","2s":"10","3s":"22","4s":"14","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ECON 1050","course_id":"13760","cat_num":"123893","1s":"8","2s":"35","3s":"5","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"3.20","workload":"4.10","difficulty":null,"recommendation":"3.20","enrollment":"84","response rate":"69.05","QCourseOverall":{"number":"ECON 1050","course_id":"13760","cat_num":"123893","1s":"3","2s":"10","3s":"22","4s":"14","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ECON 1050","course_id":"13760","cat_num":"123893","1s":"8","2s":"35","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1050","cat_num":"123893","course_id":"13760","year":"2015","term":"2","id":"7c48a4b16ebe7e548f71647a02b40eb2","first":" Robert","last":"Neugeboren","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"3.60"}]}},"comments":{"Spring '16":{"comments":["Overall the course is good, but section and lecture are two totally different animals","This is a great intro to game theory and is a fun and low-stress class. Neugeboren is really friendly and helpful, and the lectures are enjoyable and informative. Section and problem sets are straightforward, though there is little to link section to lecture, which can be a little frustrating at times. Overall a great Econ course.","While it sounds interesting, this course barley teaches you anything past basic common sense. If you're thinking of being a game theory scholar, then you should probably take it, otherwise take something else more rewarding.","This is the worst class I have ever taken. Lectures were uninspiring and you will learn more about game theory in 3 lectures in another related class than in this class. This is not a difficult class. You just don't learn much. Maybe if you have absolutely no background in Econ, then you might benefit. But if you are an Ec major, don't waste your Harvard education on this. If you are looking to take a cupcake class, there are plenty classes that are both enjoyable and easy.","The lectures are boring.","Lectures can get dry sometimes, but I didn't find it too hard to sit through all of them. It saves you from a lot of studying down the road, and it's not extremely difficult. Rajiv's sections are essential. This is a heavily pset-based class, and will seem really repetitive until the tournament arrive. That's probably the best part of the class, but I'm biased since I was part of the team that won it. Collude!","Wait for the real game theory course to come back.  This was is not really good","Great! Learn a lot from sections.","Not a walk in the park--problem sets are very tedious, might not be worth the time--take a different econ elective (coming from someone interested in game theory)","Good class not great. Section and lecture were very disconnected - learned a lot of theory in lecture and then actual applications\/how to do problem sets in section. You could get by without going to lecture whereas you NEED to go to section or watch section videos to be able to do the assignments. Exams were fair if you studied. Rajiv (TF) is quite nit-picking re: grading.","This class is extremely interesting, but the poor instruction takes away from a lot of the amazing concepts that are explored in this class. Professor Neugeboren manages to turn 90 minutes of lecture into about 20 minutes of substance, and the remainder of the class will end up being largely review or redundancy. Similarly, Rajiv's section can be condensed by twofold and be a lot more focused. If you want an easy economics elective that you won't have to do much in, then take this - but if you are legitimately interested in game theory and are expecting a strong understanding when coming out of this class, avoid Ec 1050.","highly recommend","Interesting course to learn about game theory and its applications.","Probably my favorite Econ course, one of the most straight-forward Ec electives you can take.  Really interesting topics and applications.  You can do really well in the class by going to section (mandatory attendance) and investing some time in the problem sets.  Lecture and readings aren't necessary (but interesting if you like game theory).  Exams are based almost entirely on section and problem sets.  No surprises, very straight-forward.","Rajiv was so focused on notation and his method of solving problems that the problem sets and sections were brutal to get through. I would take Ec 1052 if you can handle he math or the gov version of this class because they focus on the much more interesting theory and are less nitpicky.","Game theory is an incredibly fascinating topic. Take this course before you graduate, you won't regret it","Quite a gentle introduction to game theory.  Great course materials.","AVOID LIKE THE PLAGUE! Waste of a class - Way too basic. This course took a semester to cover a month's worth of material. Needs more content. Also, lecture and section are completely unrelated so there's no reason to go to lecture. Watch section videos at double speed and you can knock out the pset in no time. Lecture feels irrelevant and tedious. Don't waste your life on this. You can watch 3 youtube videos on game theory and learn just as much.","If you want to learn about game theory - take another class (I'd probably suggest a mathier version even.) This class is poorly taught and counterintuitively organized. Lectures are basically useless and section is disproportionately important, and it felt like it had been poorly adapted from its original extension school format. Even though you spend 3 hours in lecture every week, you get very little out of it and the whole course is instead run by Rajiv, the section leader. There is too much emphasis on specific notation and rote problem solving rather than actual conceptual understanding of the content. Even though there are only 4 problem sets over the course of the semester, they are individually very time-consuming and do not help reinforce the material very much. I had such high expectations for this course going into it because the topic sounded so interesting and applicable, but the course did a poor job of living up to those expectations.","This class teaches you a way of thinning that you are unlikely to acquire from anything other course and the lecturer that you learn from is excellent.","Do not take it. Ever.","not the most difficult course, but not a very inspiring one either. the teaching staff are not particularly gifted teachers.","The grading is ridiculous but the class is super interesting.  If you do not mind putting in a little extra effort so that you can make sure your  psets are perfect then take this class","This class was great because it gave an insight into both how to solve game theory problems and the history of game theory in the nation.","This is a good class, especially pass\/fail. Psets are only assigned every other week and can be challenging but usually are very straightforward, and exams are the same as long as you put a few hours into studying. The topics are interesting and useful in a variety of applications. This is definitely one of the most painless economics electives.","Frankly, this course did not really live up to my expectations. I found the material extremely interesting and learned a fair amount, if not as much as I perhaps could have. However, lectures and sections are almost like different classes, and I have serious problems with the way Rajiv (the TF, who runs sections) does things. If you are not too bothered by a healthy dose of pedantry, but without real mathematical rigor, you may feel differently, but otherwise, approach the course with some caution.","It's a shame to Harvard to have this be the only game theory class in the Economics department. While you do learn basic game theory material, the course is not run well. Lectures and section have nothing to do with each other and examinations are done through section material only and then they throw a lot of stuff from lecture slides onto the final even though most of it isn't taught well during lecture.","It is very interesting especially for those that like to think in a mathematical way.","This course is poorly run. You end up memorizing more than understanding what is going on. No need to do ANY of the readings. Lecture is a joke and Rajiv, the TF, acts as if the professor is subordinate to him. Psets are graded arbitrarily. I would NOT recommend this course. I wish this course connected the real world to game theory more.","If you need an ec elective take this!! Rajiv is a great section leader who really teaches you the material in a very instructive way, assignments are straightforward, only 4 psets during the semester + midterm + final","Of all classes I've taken, this is the one that is most simultaneously fascinating and terribly taught. While Professor Neugeboren's lectures are interesting, the structure of the course gives students practically no incentive to engage with him, engendering an environment of disinterest. Almost all of the grading in the class is handled by the TF, Rajiv, who seems to know very little about running a course. His grading and class policies are strict yet seemingly arbitrary and make the class, which could be very effective at teaching rich material, more about learning what random things he expects. Section is very detached from lecture, and lecture is completely irrelevant to almost everything you're graded on, until the final exam, at which point you're expected to recall discussion topics from the first unit you were never assessed on. This is the first time they've taught the class, so I'm hopeful they can improve it for future years, but I have serious reservations about the way this class is run despite being deeply captivated by game theory.","Unless they change the structure of the course, I wouldn't really recommend taking it. There's a huge disconnect between lecture and section, and there's essentially no incentive to go to lecture. Grading is really fickle also; if you're not ok with a lot of grading coming down to syntax, then you will be very frustrated in this course. Professor Neugeboren and Rajiv are pretty great though, and they are very approachable.","Lecture is great! Psets and section are annoying.","I hope the class will improve in the next years","Half of the course material(lecture and the many assigned readings) isn't tested or on psets, which can be very annoying as you're told they would appear. Take it for the interesting info, but study to the test if anything.","Moved at a snail's pace. Not a good class.","This class felt disjointed and off.  It also wasn't really clear what the ultimate learning objectives were."]},"Spring '17":{"comments":["While the course had some interesting elements, the organization was truly lacking. There were constantly mistakes in the exams, p-sets, lecture and section material that detracted from the learning and frustrated the students. I would not recommend.","it's not a difficult class. esp if you know anything about game theory. Towards the end it's kind of tedious and gets more difficult, but it's one of the easier Ec electives in my opinion.","There are likely more interesting electives to take in economics but if you have no game theory background then consider this class.","If you're looking for an easier econ class, take this. You only get four assignments, and at one point I think we had a whole month between assignments. I think if anything the class could use more assignments to give us more practice with the material.","This is a pretty easy class. There are only 4 psets, which was super nice, a midterm, and a final. None of the material is that complex. I never did the readings and was able to keep up just fine","This class covers fascinating material but is not well structured. Lectures and sections are repetitive and the slides and psets are difficult to understand and don't clearly connect to the subject matter. That said, Rob is a good guy and Mauricio was a great TF, they just haven't nailed down the execution part of the course which could very easily change by the time you take it.","\"Game theory without too much math? Sounds great to me.\"- my thoughts before taking this class. My thoughts after this class- \"Wow, never mind.\"","This is a relatively fun game theory-oriented econ course. The workload isn't bad at all-there are only four psets.","The content was very interesting. The games we actually played were also fun. This year there were Piazza office hours instead of in person ones - I don't think that helped. Additionally, I feel like the material in the psets did not always reflect what we learned in class.","Much of the subject material is worked through economic examples which can be perhaps a bit bothersome for people outside of the field."]}},"mostRecentQ":{"overall":"3.50","workload":"4.30","difficulty":null,"recommendation":"3.40","enrollment":"25","response rate":"72.00","QCourseOverall":{"number":"ECON 1050","course_id":"13760","cat_num":"123893","1s":"3","2s":"10","3s":"22","4s":"14","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ECON 1050","course_id":"13760","cat_num":"123893","1s":"8","2s":"35","3s":"5","4s":"0","5s":"0"}},"success":true}