{"scores":{"Spring '15":{"course_score":{"overall":"3.90","workload":"17.50","difficulty":null,"recommendation":"4.40","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"0","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"2","3s":"5","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.50","workload":"8.10","difficulty":null,"recommendation":"4.40","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"0","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"2","3s":"5","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.10","workload":"2.30","difficulty":"3.30","recommendation":"4.40","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"0","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"2","3s":"5","4s":"0","5s":"0"}}}},"comments":{"Fall '13":{"comments":["If you're doing a thesis, Yao's great."]},"Fall '14":{"comments":["Take advantage of this course as much as possible! Your section leader is there to help you.","If you're doing an AM\/Ec thesis get into 985. I got denied at first and wiggled my way in, it's super helpful at keeping you on track. Stata psets are a complete waste of time and energy but TFs are really helpful when your advisor just bounces for a month!","If you are an economics or applied math economics student interesting in thesis writing, this class is a must-take. coming into the semester, I underestimated how much time it takes to do research. this class has helped guide me by making sure I'm making progress every week and helping me set periodic deadlines for myself, which is what you need. also having yao as an instructor has been extremely helpful. he's super quick getting back to you with advice, so if you're interested in financial economics, try to get into his section!","Writing a thesis will rank among the most engaging intellectual experiences at Harvard.","It is time consuming, especially the STATA tutorial if you haven't done it already. It is best to go hard organizationally early on so later in the semester you aren't crunched for time.","The thesis seminar is required if you want to write an Ec thesis. However, I can only speak for Yao, who was not the most organised or most helpful section leader."]},"Spring '15":{"comments":["You my boy Yao. You my boy","Absolutely must-take for thesis writers, both Econ and Applied Math\/Econ. Provides useful guidance throughout the thesis writing process and helps you set a timeline. Your advisor will be a very helpful resource throughout the journey.","For all that seniors may whine about writing a thesis whilst in the middle of the process, I think we all would agree in hindsight that it was an extremely valuable experience, one that goes beyond course experience and into life experience.","Ec 985 is a requirement if you decide to write a thesis in Econ, but beware that the degree to which you enjoy the seminar is highly dependent on both your TF (mine wasn't very good) and on your fellow group of students (in my group, people didn't really care about each other's progress.)","Writing a thesis is the capstone to your academic career as an undergraduate and, in my view, should be mandatory. That the thesis is optional should not distract you from writing one."]}},"mostRecentQ":{"overall":"3.90","workload":"17.50","difficulty":null,"recommendation":"4.40","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"1","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"0","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"ECON 985k","course_id":"946","cat_num":"0871","1s":"0","2s":"2","3s":"5","4s":"0","5s":"0"}},"success":true}