{"scores":{"Spring '17":{"course_score":{"overall":"4.50","workload":"18.00","difficulty":null,"recommendation":"4.50","enrollment":"3","response rate":"66.67","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.90","workload":"5.80","difficulty":null,"recommendation":"4.80","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Spring '15":{"course_score":{"overall":"5.00","workload":"11.70","difficulty":null,"recommendation":"4.50","enrollment":"8","response rate":"50.00","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.40","workload":"9.00","difficulty":null,"recommendation":"4.30","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.50","workload":"3.70","difficulty":"3.30","recommendation":"4.30","enrollment":"9","response rate":"66.67","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"5.00","workload":"2.70","difficulty":"3.30","recommendation":"5.00","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.33","workload":"3.44","difficulty":"3.67","recommendation":"4.44","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.29","workload":"2.57","difficulty":"3.00","recommendation":"4.29","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"4.29","workload":"2.57","difficulty":"3.14","recommendation":"4.57","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.71","workload":"2.43","difficulty":"3.71","recommendation":"4.71","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"5.00","workload":"3.00","difficulty":"3.50","recommendation":"5.00","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"4.88","workload":"2.50","difficulty":"3.25","recommendation":"4.88","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Fall '10":{"comments":["It's a great class. Very small and you'll be surprised at how much French you learn in such short time.","This is the absolute best on-campus course for learning French quickly.","It's a great class, one the best I've taken at Harvard. If you want to learn a lot of French really quickly this is the class for you.","amazing experience, you learn french and can read a newspaper at the end of it with little problem","Make sure you have the time to commit to studying, and seek out opportunities to practice speaking. It is a great way to learn the language quickly and make new friends! I loved it!","This class requires a certain amount of dedication, but it is worth the effort."]},"Spring '11":{"comments":["This is an absolutely wonderful course! Mathias is a wonderful teacher and his enthusiasm for French culture is very evident. He makes French come to life through Parisian slang, literature and poetry, the arts, etc. You will also be surprised by how much you learn. I started off with absolutely no exposure to French and I am now conversational and able to read basic newspaper articles.","This is an excellent course and you will definitely learn a lot of French!"]},"Fall '11":{"comments":["Don't underestimate the workload. It's marked as two credits and treat it as such--it's doable to as a fourth class (but really meaning you have five) but if you have the ability to do it as a third only, take it. You learn as much as you can devote time and energy to learning.","It's a lot of class time, but you will learn more French than you thought you ever could in a semester -- and it's super fun!","It is a non-stop commitment, but you should never stress out about the course. If you want to learn the basics of the language quickly, this class is perfect for you.","This is a truly a phenomenal class! Rafael is a wonderful teacher, and he takes great care in making sure students understand the material that has to be quickly learned. I realized that it is incredibly useful to already be proficient in another ROMANCE language because grasping things such as imperfect vs. simple past, reflexive verbs, subjunctive, etc. is not necessarily easy if you are coming from a different language background (Mandarin, etc.). By the end of this course, I was honestly shocked by how much French I had learned! Take this course!","I would recommend it to students who do not already have too much on their plate.  This class requires a consistent attention to your work and is not a responsibility to be taken lightly.","If you have the time and stamina to do this class, it is well worth it."]},"Spring '12":{"comments":["If you're interested in learning French, I highly recommend this class. It is very well taught and structured, and you will really immerse yourself in the language. Big thumbs up!","The class time and work load may seem daunting, but you get in a rhythm and class becomes very entertaining as well as instructional. You come out of this class with a vast knowledge of French, an amount unimaginable before you begin the course.","Intensive languages are the way to go if you want to get familiarity with the basics of a language fast. I went from no French whatsoever to holding a reasonably fluent basic conversation by the end of the course, and I can usually get the gist of French quotations that appear in my reading now. Rafael was a very patient, understanding, fun instructor, and the immeuble storyline was fun if you got into it. Only word of warning is that you have to bring a bit of creativity to the class to write the compositions, which can sometimes be a little burdensome when you have to come up with something interesting every week. Also, the grading can be a little nitpicky, so you might have to be a little neurotic if you care about your grade, though it gets easier as the class goes on and you learn more. If you don't mind about the grade or are willing to be a little neurotic, this class will give you a good foundation in French really fast.","It is quite a bit of work that you have to be willing to do but I really enjoyed it. The small class size and regular meetings allows for a lot of learning to take place and for you to get to know your tf and classmates really well","you need to know what you want out of the course and should ask questions about it."]},"Fall '12":{"comments":["Take this class only if you are serious about continuing your French education. Don't take it on a whim or to get an elementary knowledge of French, because you won't have the dedication to pull yourself out of bed every day (and sit through the two-hour sessions two days a week). \r\n\r\nIf learning French is part of a larger goal for you (concentration, fluency, etc), then you will learn more than you thought possible in such a short time.\r\n\r\nA lot of the pieces of this class, like the Google+ exercise and workbook activities, feel like busy work, even though they're part of the big picture of practicing language skills. If you're not interested in putting up with those pieces, then you should reconsider taking the class.","If you are interested in making rapid progress in learning French for the first time, you have no other choice. The course can be frustrating because it is lacking in organization. Also, you don't always feel as if though there is a helpful purpose to every assignment. If you really really want to learn French, it's better to do this class than have the same material covered in two terms.","Outcomes are directly tied to effort put in.","The more you put into it, the more you will get out of it"]},"Spring '13":{"comments":["the course takes seriously your need to gain familiarity quickly, while making room for the concerns that naturally arise from a concentrated training regimen.","This is a really awesome course if you're prepared to put in the effort.  There are a lot of resources at your disposal.  I came away learning much more than I expected and I'm excited about continuing to learn French.","it's aight.","This was my favorite class of the semester--while it was a bit stressful, I really enjoyed it. Try to do homework and read the textbook pages on the days you're supposed to...you'll get more out of in-class time if you do. And take advantage of office hours: I learned the most to improve individually (pronunciation, my own individual grammar problems, etc) there. Morgane was a fantastic teacher and will be much missed!","This course is definitely an intro language course (some rote work, class every day and during reading period, etc.), but it's a lot of fun! I thought the pace was quick enough to be interesting but slow enough that I rarely got lost. The class activities were enjoyable and I felt comfortable even as I was making mistakes. The quality of the course seems to depend a lot on the professor, so be sure you're going to like spending 7+ hours a week with him or her!","Take this class if you want to learn French fast. Don't worry, it works.","Very time demanding, but extremely rewarding."]},"Fall '13":{"comments":["You'll learn more French in one semester than you thought possible","French ACD is a very manageable workload. For the amount of time you'd put into the regular beginners, you might as well take the intensive and learn twice as much. Having started with zero french experience, I could carry on a strong conversation by the end of the semseter, and the classes were enjoyable. Flora also always has very precise and helpful answers to any questions you might have.","It's truly wonderful at teaching you the essentials of the French language. All the students my year were very impressed with the progress they had made by the end. You will attain something close to conversational knowledge of French (albeit it with grammatical mistakes and limited vocabulary). It was also a very enjoyable course with less work than expected (courseload equivalent of 1.5 courses rather than 2). You do have to spend a significant amount of time outside of class to really see improvement (would recommend Romance language tutoring for conversation practice). Be warned however, that while it is very easy to get an A- in the class (if you put in the basic time required), it is very difficult to get an A. (True perfectionism required here and probably an additional 8 hours a week).","Acd is a great way to start French! It is a bit fast, but definitely worth it!"]},"Spring '14":{"comments":["If you want to learn French fast, this is the way to do it.","as long as you have the time to devote to this class, you'll fidn it extremely rewarding. this means time OUTSIDE of class and not just the 7 hours of class each week.","be prepared to work hard and every day","This class is a pretty good way to learn French fairly quickly. Flora is a great instructor, who is always willing to answer questions, and clearly spent a lot of time on course materials. French Acd is very innovative for a language class, which is both its biggest strength and weakness. The course materials were often customised for the class, and drew a lot upon many aspects of culture, both old and contemporary, while still teaching us the necessary vocab. The downside was probably clearest in the Google+ assignments: they often felt tedious and unhelpful (writing posts often involved looking up very specific words on Word Reference that you would soon forget afterwards). Also, it wasn't always clear in class when we were meant to be ourselves or our characters, which got a bit confusing, so a more consistent use of the characters would have been better. Though I would perhaps have appreciated a few more conventional grammar drills, and though it can be very time-consuming, the class is still pretty good.","If you want to learn as much French as quickly as possible, this is the way to go. Flora was a charming, patient, and cheerful instructor, and having her in the classroom, along with other students who are passionate about learning another language (which you may not get in a non-accelerated course), made the seven hours of classroom instruction a week quite tolerable. It's a fair bit of work, and there are some aspects of the course that could be improved, but if you try hard you'll walk away with a very strong foundation. Know that the more you put into it (especially outside of class), the more you'll get out of it."]},"Fall '14":{"comments":["Fantastic. I know that with this course I feel confident applying to summer internships everywhere from Geneva to Paris to Dakar, Senegal! This is only the beginning of my French learning, but I am excited and amazed at how much I learned in just one semester. Take this course if you want a fantastic language-learning environment and if you want to fall in love with French.","This course is so great! Honestly it rarely felt like work because it was so much fun, and the class really bonds as a little community because you meet so much. Come into the course knowing that it takes a lot of time, and requires consistent effort - you can't cram at the end, it has to be consistent. So be sure to balance your schedule accordingly - but I can't recommend it enough! And Remi is wonderful.","This was one of the best classes I've taken during my time at Harvard. It was challenging, and I learned so much, but I have also never laughed more in the classroom!","prepare to rely on yourself to seek out opportunities to speak in French and to make sure to understand the grammar","Go the extra mile for this course, it will be rewarding.","Great way to learn a really large amount of French in a really short amount of time. The format can be really fun if you let yourself get into it. It does require some creativity though. Be willing to put the time into it though. I'd think twice about taking this class with another high workload course.","I think the course is excellent in that if does teach you a fair amount of French, but I think you must have the time and motivation in order to follow through."]},"Spring '15":{"comments":["This course is a lot of work, but it's a lot of fun and the pay-off is incredible:  you really will make more progress with the language than you ever would have thought possible.  I'd highly, highly recommend taking it if you really want to learn French (it's definitely one of my top experiences at Harvard); just make sure you have the time for it.","Expect to spend some time on this class and expect to learn a lot! Your progress will astonish people.","GREAT CLASS and you get very quickly adjusted to speaking only in French. KEEP ON TOP of your verbs and your vocab, however, because the class moves very quickly. In general, practice, practice, practice! I would recommend watching French films (both with and without subtitles) and other forms of media to practice listening comprehension (especially because this part may be the hardest for French due to the omission of all the consonants while speaking :P ). Also DEFINITELY take advantage of the tutoring center for help on revising compositions\/practicing speaking! It's free and very convenient (1 Bow St) -- what's not to love?"]},"Spring '16":{"comments":["This class is pretty fast paced but manageable. I found our in-class activities to be very engaging. I got the sense that some of my classmates found going to this class every single weekday of the semester to be a bit of a drag (so perhaps you will too), but I didn't mind -- I really enjoyed showing up at 10am every day, largely because Soraya is such a joy to be around! Do be aware that the class meets during reading period, so don't plan any trips then.","This is a great class if you want to learn French. I came in knowing Spanish so much of the grammar and vocabulary exercises were surprisingly easy.","For this class, you should be ready to immerse yourself in French and spend a lot of time speaking, listening, writing and reading in the language.  The pace was perfect for someone who is very interested in languages.","It's a large time commitment but you retain a lot of it!","This course will be a wonderful learning experience for those who want to know more about French culture and society and to learn the French language. Be prepared to make a commitment - the class is intense."]},"Spring '17":{"comments":["The lecturer does not really care how much you don't know and how far you have come to know the language. He wants to see you on par with the other students so that you may feel comfortable and competent. So work! work! work!"]}},"mostRecentQ":{"overall":"4.50","workload":"18.00","difficulty":null,"recommendation":"4.50","enrollment":"3","response rate":"66.67","QCourseOverall":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"0","2s":"0","3s":"0","4s":"1","5s":"7"},"QDifficulty":{"number":"FRENCH Acd","course_id":"4376","cat_num":"8780","1s":"0","2s":"0","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH ACD","course_id":"4376","cat_num":"124332","1s":"1","2s":"4","3s":"3","4s":"0","5s":"0"}},"success":true}