{"scores":{"Spring '15":{"course_score":{"overall":"4.80","workload":"2.00","difficulty":null,"recommendation":"5.00","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 101HFB","cat_num":"124904","course_id":"3909","year":"2014","term":"2","id":"42cb5553aa25302bbe073241a0efad44","first":" Simon Barak","last":"Caine","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Fall '14":{"course_score":{"overall":"5.00","workload":"2.00","difficulty":null,"recommendation":"5.00","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.70","workload":"1.20","difficulty":"2.30","recommendation":"4.90","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.80","workload":"1.10","difficulty":"2.20","recommendation":"4.90","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.54","workload":"1.15","difficulty":"1.92","recommendation":"4.85","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"4.50","workload":"1.20","difficulty":"1.90","recommendation":"4.50","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.10","workload":"1.00","difficulty":"2.00","recommendation":"4.40","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfh","cat_num":"2579","course_id":"3909","year":"2011","term":"1","id":"202d8c48b23dc38f395b4a072d8cf530","first":"Ryan Wesley","last":"Draft","InstructorOverall":"4.67","EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '11":{"course_score":{"overall":"4.00","workload":"1.75","difficulty":"3.33","recommendation":"3.75","enrollment":"5","response rate":"80.00","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfh","cat_num":"2579","course_id":"3909","year":"2010","term":"2","id":"366de648a3301215857a514679cf7874","first":"Tamily","last":"Weissman","InstructorOverall":"3.75","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Fall '10":{"course_score":{"overall":"4.33","workload":"1.33","difficulty":"3.00","recommendation":"4.67","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Spring '10":{"course_score":{"overall":"4.00","workload":"1.78","difficulty":"2.89","recommendation":"4.44","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfh","cat_num":"2579","course_id":"3909","year":"2009","term":"2","id":"622709c527ae97432097c0be2362f30c","first":"Antoniu Laurentiu","last":"Fantana","InstructorOverall":"4.12","EffectiveLecturesorPresentations":"4.62","AccessibleOutsideClass":"4.38","GeneratesEnthusiasm":"4.62","FacilitatesDiscussionEncouragesParticipation":"4.17","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.33"}]},"Fall '09":{"course_score":{"overall":"3.86","workload":"1.86","difficulty":"3.00","recommendation":"4.43","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"NEUROBIO 95hfh","cat_num":"2579","course_id":"3909","year":"2009","term":"1","id":"366de648a3301215857a514679cf7874","first":"Tamily","last":"Weissman","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '09":{"course_score":{"overall":"4.29","workload":"1.86","difficulty":"2.71","recommendation":"4.43","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Fall '08":{"course_score":{"overall":"4.50","workload":"2.00","difficulty":"3.75","recommendation":"4.50","enrollment":"7","response rate":"57.14","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '08":{"comments":["As a neurobiology concentrator, I love this tutorial and the material in it","Very difficult but worth it for the material and for Tony."]},"Spring '09":{"comments":["My understanding is that this class is still growing and changing, so I think that many of my concerns with it will be resolved in future years. I would encourage students to shop it and see if things look improved, and talk to people who have taken the class.","This ia a good class though you may learn a lot more about bird song than you ever thought possible!","If you've never really thought about birdsong and how it relates to human language, this is a great course that throws you in the midst of both without being overwhelming.","this class is awesome!  at first I wasn't sure why birdsong was important enough to have it's own tutorial, but after the first meeting I was really interested in the topic."]},"Fall '09":{"comments":["You might be able to get away with a moderate amount of work. But to really get the most out of this course, I suggest you do your best, because it makes a difference."]},"Spring '10":{"comments":["This is a class that will teach a great deal about bird song, but, perhaps even more importantly, it will also teach you how to approach reading scientific papers.","I believe this class is really interesting and the reading is very well selected.","this class is amazing. tony is very dedicated to teaching and he'll help you learn how to critically analyze studies (which comes in handy way beyond the subject of birdsong). the small class size tutorial format also allows for great discussion.","This course is a great choice for your Neuro tutorial. It isn't one of the most popular ones, but if you are interested in language and communication, birdsong is an amazing model to study. Tony is great - he'll talk with you about birds, physics, research, anything. The nice thing about this class is that it is all year which allows you to have something carry over into the second semester. Also, if you take 4.5 classes one semester, you can have a lighter load the other semester with 3.5 classes. I learned how to research paper really quickly; you read 2-3 papers a week and write a short figure description for each class which is a very light workload. Course highlights: guest lecture with Irene Pepperberg and field trip to Martha's Vineyard in May!"]},"Fall '10":{"comments":["Good for those interested in bird song research and neuroscience. Light workload.","I really enjoyed the material so far in this course, and the professor is awesome and does a great job of trying to get to know the students well and gear the class towards their interests. He is very understanding and very helpful to each of the student's concerns."]},"Spring '11":{"comments":["light workload. material gets repetitive at the end.","Make sure to do the readings, or else the discussion will not be interesting or fun. It's a really interesting subject material though!","I loved the course, the concentration on learning how to study papers, the small class size, and the year-long aspect of it. Nonetheless it makes it very tough to balance other classes when you are forced to have this count as a fifth class one semester, especially since a lot of the work for the course falls on one semester of the class. Be aware of that when planning your year. Also be proactive in asking for guidance; the course is great in asking feedback but many of the assignments are very open."]},"Fall '11":{"comments":["Thus far this tutorial has been an exciting and participatory introduction into dopamine's role in psychiatric disorders.","very easy, no work outside of class, but you will probably get more out of it if you put in more outside of class than just doing nothing. otherwise you can leave feeling jipped, unless you were counting on it as an easy, fifth class.","The professor is very engaging and flexible to the desires of the class. Discussions are the most interesting.","Barak is super chill, and the workload isn't very heavy.\r\nThere is a lot to learn, but how much you get out of it depends on how much you participate in discussions.","barack is awesome and I love the stuff we learn on schizophrenia and Parkinson's and dopamine..","Barak is the man, the material is interesting, and the workload is very manageable.","This class is quite easy and a really engaging and in depth look at the different illnesses that are associated with dopamine (Parkison's, Schizophrenia, etc). Dr. Caine is very knowledgeable and an engaging professor to get to know.","It's good. Not earth shatteringly interesting, but a solid choice with very minimal work."]},"Spring '12":{"comments":["You just read papers and discuss! no assignments, no work, none at all!","Excellent survey of the big findings in dopamine-related fields, as well as the experimental methods of behavioral neuroscience.","Do the readings with care, challenge and ask questions in class, and you will get a lot out of the course","This is very much a class that you can benefit from if you put in the work to be engaged. Since there are no quizzes and assignments, it can be easy to slack off and take the course for granted. However, since you can get a lot out of the articles and active discussions in the tutorial, it is highly recommended that you do the work and learn a valuable skillset from the class.","Be open with Barak about what you guys want from your tutorial because he will tailor it that way. The course is better when there is more even discussion, so encourage your peers to participate actively.","This course is a really awesome tutorial, and you should definitely consider it if Professor Caine decides to do it again next year.  The workload is very manageable and Professor Caine is really understanding about working around work for other courses.  You learn to read publications with a skeptical eye (not all results are created equal) and how to present them to others.  Dopamine is also super interesting.","Barak is super chill.  How much you ultimately end up getting out of it depends on how much you put in."]},"Fall '12":{"comments":["Chillest class ever. EVER.","This a great class and I would recommend it to all neurobio confentrators as a way to understand neuro on a systems\/transmitter level that we really don't get from any other class we are required to take.","The course is awesome because it's very interesting and not very time consuming. Professor Caine is a great lecturer and so knowledgable about the subject matter. I would definitely recommend this class for both neuro and non-neuro concentrators.","This is a fabulous class--interesting but not too much work.","Great material and Barak is an excellent lecturer! Exactly what a tutorial class should be!","This is a fantastic course. The material is interesting; more improtantly, Barak Caine makes the entire course a pleasure to be in."]},"Fall '13":{"comments":["Dopamine with Dr. Caine is one of the best classes I've taken. I look forward to taking it next semester as well. It's low workload and low-pressure, but you'll definitely learn a lot. Dr. Caine also ranks homeworks, so if you really want to compete with the rest of the class, you can try for the top spot.","This course is amazing!!!! I look forward to it every week. Barak is such a great teacher and so much fun. If you are interested in a career in neurology or in research, take this class!!!","Barak is incredible. He's hilarious and really into the subject matter he teaches. It is awesome to interact with him in such a small class environment.","I consider myself very lucky to be in Barak's tutorial on dopamine. I look forward to class every Monday as I know I will learn something new and fascinating!","Professor Caine is a great, dynamic instructor. Definitely one to be remembered. The time you spend on outside work for this class is minimal, but you learn so much during class.","Take this class, Barak is amazing and you will come away from his lectures remembering his stories","This is the sort of course one should take every semester - personal, well structured, in depth, but very manageable.","You will learn so much about the brain and finally feel like you're in a real neuro class."]},"Spring '14":{"comments":["Dopamine was my favorite class this semester! I looked forward to it every week.  Barak is such a great professor, and the course material is really fun.  By the end of the year, you feel like you really learned something.","Take this class if it's still offered. Low workload but at the same time I learned more than I've learned in a lot of classes. The class has a great professor, great sections, great material, and great assignments. Definitely one of my favorite classes I've ever taken.","Great, straight-forward class taught by a very enthusiastic, comical, and unforgettable professor. Minimal outside work but you definitely learn a lot from Barak's outstanding lectures. One of the best classes I've ever taken.","This is hands down the best neuro tutorial there is!!!! Barak is hilarious, extremely knowledgeable, and makes every week really fun and interesting. The content is fascinating, and you'll come out of it feeling like you've learned a lot. You can tell that Barak cares a lot about his students and he creates a relaxed environment that feels more like a discussion each day than a lecture. I highly recommend this class to any neuro concentrator!!!","This course is fantastic! It's low workload, but you learn a ton, and all the lectures are interesting. Because there's not exams, there's no pressure to write every single thing down, but I wanted to because I wanted to remember this stuff! Barak is a quirky and hilarious guy with a lot of weird, but also relevant stories about the course material, and he's really accessible outside of class if you want to get to know him. Overall, it's a fantastic seminar course, and I learned more neurobiology in this course than any other course at Harvard thus far.","If you're interested in partaking in a neurobiology seminar, I would strongly recommend this one. This has been one of my favorite courses at Harvard; Barak is a phenomenal professor who will keep your attention for the full 90 minutes."]},"Fall '14":{"comments":["This is the biggest gem I have ever taken, while also being one of the classes I have most enjoyed, and a class where I have learned a lot. First semester, we had two homeworks that each took around 30 minutes. Barak's lectures are dynamic, exciting, and interactive, and you come to realize how much you can learn without killing yourself outside of class. Best class ever.","This is an amazing course. Barak is a great lecturer who always keeps the class engaged. Although there is not as much week to week work as compared to other classes, I feel like I've learned so much more in this class by just paying attention and note taking than I have in many other classes I've taken. I recommend this class to those interested in pharmacodynamics, pharmacokinetics, Parkinson's and learning about brain pathways.","This is easily the most engaging, interesting, and fun course I have taken at Harvard. If you somehow manage to lottery in, you would be an idiot not to enroll.","Take this course! Barack is awesome! Workload is modest and doable. Too bad this course won't be offered next year.","This is an awesome tutorial so far! It's not incredibly difficult but covers difficult material. I would definitely say I learned a lot.","Already one of the best classes I have taken at Harvard and it's only been 1\/2 the course.","Having taught students and undergone extensive teaching training as an undergrad, I know how difficult teaching can be. I think Barak possesses natural teaching ability and charisma. I was always enthusiastic to attend his class, especially since I wouldn't have to worry about turning in exhausting assignments. I'd walk in every Monday, sit back, and learn something interesting that I'd use in my other courses and blow my professors away. I also had a memorable conversation with him outside of class, which revealed to me how much of a chill and approachable guy he is. It's obvious why my friends from other Neuro tutorials were envious that they didn't get into Dopamine."]},"Spring '15":{"comments":["This course will probably not be offered again, but if you can take a course with Barak, do it. \r\n\r\nHe believes that if you come to class well rested and ready to engage with the material, there's no reason to have substantial work outside of class, which is awesome. There were few assignments, but I felt like I learned a lot by doing them and really enjoyed putting in the time. \r\n\r\nIt's also worth mentioning (and I can't say this about many classes) that every Monday after this class, I walked out feeling so psyched about what I'd just learned, and eager to tell my neuro friends who weren't lucky enough to get into this class all about it.","This class was such a great experience. In addition to learning about dopamine and its role in parkinsons\/schizophrenia\/drug addiction, you also get a good intro to pharmacology and a few other topics. Barak communicates extremely effectively and you learn a ton in class--however, the homework was kept to a bare minimum. This made the class even more enjoyable, and really made all the students focus and be engaged in our lectures.","Barak is an amazing lecturer. He is so knowledgable about the subject matter and makes the classroom an environment where you feel comfortable asking questions. I think this class is ideal in that it is extremely interesting, but not overwhelming in terms of stress.","This is a great class that delves into basic circuitry, basic pharmacology and more! Very low workload and you get what you put in.","Was this the best biology class I took at Harvard? Yes. Am I planning on getting a career in biology? No. Do I regret taking this class? How could I ever. Barak changed my perspective on biology. You will be utterly entertained ad intrigued by each week's subject matter. You will cry when class is cancelled because of a storm etc. You will laugh and stay focused simply because the material is fascinating. Highly recommended to everyone, especially those feeling like classic neurobiology courses like MCB 80 and OEB 57 are boring but still want to find their passion in neuro. Great use of a year of my life.","This is a great class. I learned a lot but I didn't feel overworked or overstressed. I definitely recommend taking it.","The professor is SO interesting!! Not only is he an excellent lecturer who goes at the right speed, but you will also find that he is a very personable person. You will never regret taking this course. One warning: because he is so chill, how much you understand and retain in this course depends mostly on the effort you put in to review your notes after classes.","Barak is a great professor. He is flexible and honest about his teaching style with his students. When I first met him during the junior neurobio tutorial fair, I thought he was just exaggerating his class, like the rest of the tutorial leaders. But Barak was for real! If you're lucky to lottery into any class he's teaching, you're set to learn a lot with minimal time commitments outside of the classroom. If this class has a high difficulty rating (I gave it a 3), it's because you're learning some complex and interesting neurobio mechanisms. Nonetheless, Barak is very clear in his teaching and one of the best professors I've had at Harvard."]}},"mostRecentQ":{"overall":"4.80","workload":"2.00","difficulty":null,"recommendation":"5.00","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"0","3s":"0","4s":"0","5s":"10"},"QDifficulty":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"0","2s":"6","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"NEUROBIO 101hfb","course_id":"3909","cat_num":"2579","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}