{"scores":{"Spring '17":{"course_score":{"overall":"4.30","workload":"5.60","difficulty":null,"recommendation":"4.20","enrollment":"32","response rate":"84.38","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.30","workload":"5.80","difficulty":null,"recommendation":"4.10","enrollment":"32","response rate":"71.88","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Spring '15":{"course_score":{"overall":"4.10","workload":"4.80","difficulty":null,"recommendation":"4.00","enrollment":"27","response rate":"85.19","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.60","workload":"7.00","difficulty":null,"recommendation":"4.40","enrollment":"6","response rate":"83.33","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.00","workload":"2.40","difficulty":"2.90","recommendation":"4.00","enrollment":"48","response rate":"56.25","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"3.50","workload":"2.00","difficulty":"2.80","recommendation":"3.50","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"3.87","workload":"2.47","difficulty":"3.13","recommendation":"3.86","enrollment":"47","response rate":"80.85","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.00","workload":"2.00","difficulty":"2.71","recommendation":"4.14","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"3.92","workload":"2.44","difficulty":"2.82","recommendation":"3.84","enrollment":"56","response rate":"92.86","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.17","workload":"2.67","difficulty":"3.33","recommendation":"3.83","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"3.90","workload":"2.44","difficulty":"3.05","recommendation":"3.83","enrollment":"51","response rate":"82.35","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"4.08","workload":"2.92","difficulty":"3.25","recommendation":"4.25","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Spring '10":{"course_score":{"overall":"3.83","workload":"2.29","difficulty":"3.30","recommendation":"3.98","enrollment":"45","response rate":"91.11","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Fall '09":{"course_score":{"overall":"4.18","workload":"2.18","difficulty":"2.91","recommendation":"4.18","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Spring '09":{"course_score":{"overall":"4.04","workload":"2.41","difficulty":"3.00","recommendation":"4.41","enrollment":"53","response rate":"88.68","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}},"Fall '08":{"course_score":{"overall":"4.33","workload":"2.67","difficulty":"2.33","recommendation":"4.50","enrollment":"8","response rate":"75.00","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}}}},"comments":{"Fall '08":{"comments":["This is a good class to take if you need to acquire a solid grasp of Italian in a short period of time (i.e. one semester).","You will get to learn a lot, the small class size is ideal to learn and create a relationship with the professor and other students","This class is very fair but a lot of fun. You will definitely see improvement in your speaking and writing,","If you have taken two or more years of Italian in high school, it may be unnecessary to enroll in this class although the course's description advises this course for those who have taken about two to three years of high school Italian. I would recomment heading straight to Intermediate Italian, because this course is almost entirely review.","If you take this course in the Fall, you are likely to have a smaller class size, which is amazing.","The instructor was extremely helpful and kind.  I have never felt so confident about speaking Italian as I do now."]},"Spring '09":{"comments":["You have to get a good instructor.","Although it's a beginning course, it requires a lot of time and is very difficult.","extremely enjoyable","Stay on top of the material. The grammar and vocabulary are a lot to remember, but if you learn them throughout the course of the semester, it is much easier.","This class is a great introduction to the best language!","This is a great course if you need to fulfill a foreign language requirement. It is fun and conducted in a highly organized way. I greatly enjoyed taking Italian Ab I feel that it definitely deepened my understanding of the language and Italian culture.","I always looked forward to coming to this class. I thought it was great.","The second semester of Italian is much harder than the first. The grammar becomes more complicated and there's a lot of it to cover. Unless you've already taken another Romance language, it's going to be pretty difficult to remember all of it.","Excellent way to start learning the language","This class offers a fun way to learn Italian with small class sizes and interesting activities. It's not just reading a book.","the Tf was great and made learning Italian not only enjoyable but also easy","La lingua italiana e molto bella! Studiatela!","The Italian department's a lot of fun.  There's a lot due every week though, so while it's not a hard class, it's a time consuming class.","Compared to other languages, Italian definitely isn't too tough, particularly because weekly homework is minimal and there is no final. Your experience will greatly depend on your TF, but if you're lucky enough to get a good one, then class will be fun and pretty laid back.","It's not a whole lot of work and not that difficult to do well in.","This is not an easy intro class.  Be ready to work but it is rewarding.","This class is what you make of it; I generally enjoy language classes a lot, so I didn't have much of a problem with some of this class's idiosyncrasies; however, some others may feel differently.  As with most beginning language classes, one must enter with an open mind and the willingness to accept and learn from failure in order to get the most out of this class.","It is a beautiful language, the homework is manageable, and you really will learn quite a bit of Italian just in one year.","It is an excellent course that thoroughly teaches the Italian language and culture.  You will learn an intensive amount of material.  It was definitely worth taking and I would highly recommend it.","The material is interesting and it is a great language to learn","It is alot of fun.","The Italian A series has to be the best designed foreign language intro at Harvard. Meets three days a week and has very manageable exam schedule. Well taught.","This course provides a wonderful opportunity to acquire Italian language skills as well as a knowledge of Italian history and culture. The course is a great addition to freshman year, when it is helpful to work with others in a small group setting. The TF's are enthusiastic, attentive and helpful, providing support and guidance with care and friendliness. Assignments are constructive to learning. You will need to put effort in learning grammar and memorizing vocabulary, but watching your language skills grow is incredibly rewarding. Italian is a beautiful language--it can expose you to a fantastic culture!","The content of the class is worth exploring, but the way in which it is taught makes it a bit boring and awkward.","Italian AA is really fun and easy, but Italian AB requires actual work from you and you should be willing to put in the time for it.","if you want to learn italian - you will in this class","Great introduction to a language, not very intimidating, but fun and exciting.","Italian is a wonderful language, especially if you've taken Spanish because you can see the similarities. All of the TFs are enthusiastic and want you to learn about the language and culture of Italy.","This class is very fun and you make a lot of progress","Very fun and easygoing atmosphere, exciting to learn a new language.","Figure out at the beginning how you will organize all the detail.  Even though there wasn't a huge emphasis on knowing vocabulary for the tests, vocabulary (especially verbs) is obviously essential to speaking\/understanding a language, so figuring out how to keep track of and drill vocabulary as you go along would help.","I would tell future students that this course  allows one to learn a beautiful language and have fun simultaneously."]},"Spring '10":{"comments":["It's a lot of fun, not too much work, and feels like a high school class in that the class size is small and there's little weekly assignments (unlike most college courses, which have a few heavily-weighted papers or tests). Great experience overall!","A Warning: Italian Aa was a lot of fun and pretty easy. Italian Ab is still fun, but it much more difficult! It is ALL about verb conjugation! Make sure you take the time to really learn each verb tense as you go along, as they tend to build on each other towards the end. And, cramming a bunch of verbs into your head at the end of a semester is not much fun...and not a good way to learn a language!","Boring and impossible to succeed in","Italian AB is great experience that will prepare you to travel to Italy and speak with confidence. It is a fast paced and engaging course","The Italian department has somehow managed to create a course that is not terribly difficult and yet at the same time results in near fluency in the language for a large portion of its students.  This class requires a very small investment of time for quite large dividends of proficiency with the language.","This is a great class and you definitely come out feeling confident in Italian.","Italian is super fun and challenging. It's a beautiful language and the class is well-taught and engaging. Highly recommended!","You will learn a lot of Italian in a short amount of time. However, sometimes you may get bogged down in all the little assignments that add up to your grade. If you appreciate this variety of assignments, great. However, for some it can be a bit stress-inducing and too overwhelming. You will always be busy with several shorter assignments for Italian during the week.","While your experience will depend on the TF, this class is interesting, not too difficult, and will amaze you with the amount you learn in only a semester.","Watch the movie, even though it is six hours long and difficult to find the entire thing online.","There is a lot of work in this course but that is what is required to learn to speak a foreign language well, and that is what this course will do for you. I definitely recommend this course if what you want to do is learn Italian in a dynamic, multifaceted learning environment.","Good class, but be prepared to do some busy work.","This class is fairly enjoyable. It moves very quickly, so it is critical that you keep up with all the tenses that you learn and study them outside of class.","Stay on top of the weekly assignments, and study grammar most of all each day.","It's great but will definitely require a little more effort than AA","Very quick pace. College level language is much faster than high school level language.","Make sure you are prepared with basic Italian (present tense, past tense at the very least). This course starts midway through the textbook and is cumulative so you are out of luck if you don't know the  material from the first six chapters. Also, this course is fast paced and requires you to really do the grammar exercise online...trust me. DO THEM! They will help come midterm time (which was easily my most difficult midterm all year).","This course was extremely effective in teaching the students the foundational grammar of Italian.","You'll live through the take home quizzes and quia assignments. As time-consuming and frustrating as they may be, the final grade is divided up into so many components, that as long as you try your hardest, you will be fine.","Italian is a fun language, but there is more work in this class than you probably expect.","If you have to take a language, Italian is a good one to take","Not that time intensive, but midterm and final exams you MUST but in a ton of extra work for (unlike most other language courses).","1. Fun and interesting material. 2. Stacy is a great professor - knowledgeable and friendly, but also especially great at teaching new Italian speakers. I often visited her in the Tutoring Center for additional speaking practice. My Italian is much improved after this semester.","This class is amazing but to do well you must be willing to spend a lot of time navigating the complicated grammar. It is far more difficult than Italian Aa, but it is worth it."]},"Fall '10":{"comments":["Really time-consuming, exams are tough. If you want to learn a lot of Italian go for it, but know what you're signing up for.","This class was good and I learned a lot. I do feel like you end up learning a lot of the grammar on your own time.","It's a great class. It's fun, challenging, but not too difficult. You have work every day, and a quiz or an essay every week so you MUST stay on top of things! I thoroughly enjoyed it and I learned a great deal.","Make sure to take 1a before this, even if you speak Italian at home or took it high school! (you'll need it for all the grammar assignments and irregular verb conjugations)","It's a great class, and Adam's a great teacher. It's fun and very casual.","I would say that it is somewhat of a hard language class, even though it's a beginner class. There is a lot of grammar that is covered, but if you are dedicated to the language and want to put some time in, the class can be rewarding.","Learning Italian is incredibly enjoyable and rewarding, particularly if you irrationally love the language, which seems to be pretty common. On the other hand, there were a few people in my section who rarely showed any interest in learning or speaking, maybe because of the morning meeting time, i don't know. I sometimes wished there was a more lively setting for learning the language-- Italiano Ab should move outside the classroom! (if possible)","You have to stay on top of your work. Just 20 minutes per day going over the tenses will help a lot. Even if you  don't spend that much time on the QUIA just knowing the rules will be helpful.","This was an awesome class. Not too difficult and time-consuming. Review a bit everyday and you will do great.","An excellent course if you'd like something laid back - plus Italian is super easy since so many words are similar to English."]},"Spring '11":{"comments":["The course is going to be very much more work intensive than Italian Aa, but is probably a necessary step in building a basis for Italian. highly recommended if you're planning to take more italian in the future, but maybe a little work intensive if you're just looking to fulfill a language requirement.","This is a really fun class and teaches you not only the language but also about the culture.","You have to work hard, but if you do it pays off.","If you have a \"knack\" for learning languages and\/or are an analytical, concrete thinker, then I recommend the course wholeheartedly. There are many resources for students-the RLL free tutoring is excellent, and the peer tutors that are available are also very helpful.\r\n    BUT...If you are NOT bilingual or apt to learning languages, PROCEED WITH CAUTION. It is difficult, and fast-paced, with a steady flow of intense work, every week. This class was the hardest class I took the entire year, and that is saying a lot. Also, the class is NOT constructed with creative, abstract thinkers in mind. I would recommend taking a language requirement in something very, very different from English such as Korean, Latin, or Swahili where the pace and teaching methods are completely different.","This class is very fun, and you should definitely take it if you are truly interested in learning italian. HOWEVER, the grammar you will learn in Ab is much more complex and hard to understand than the grammar from Aa. The course overall is more difficult than Ab and will require more time from you. That being said, I still thoroughly enjoyed the course and have finished it with a feeling that I now have a solid groundwork in the Italian language.","This class is accompanied by a lot of unnecessary work.  Italian is a beautiful language and I encourage anyone to learn it, but I am not a fan of the amount of work.","Take swahili if you're just trying to fulfill the requirement.","Italian is an amazing language to learn. It follows an incredibly rich culture and history. You will bond so much with your class, and thoroughly enjoy using your brain in a completely different way than your other classes.","It's a wonderful break from the rest of your classes! Studying Italian is rewarding, challenging, and beautiful...Take Italian Ab!","If you want to learn Italian quickly and well, take this course. If you're looking for an easy language requirement, don't.","It is a lot of work to keep up with and moves at a much faster pace than italian Aa.","this is like taking a  PSET class.","This course is a fabulous continuation of Italian Aa. Although it is grammar intensive, learning Italian is quite an enriching experience. The course is nicely integrated with cultural insights, which allow the students to make connections to life in Italy.","There may be a lot of assignments, but I always enjoyed doing them and going to class. It was really fun.","Exponentially more difficult than Aa, but rewarding","If you want to learn Italian, it is a great class. Be prepared to put in work on a daily basis","Good class","A fun class that really teaches you a lot of Italian! This years TFs were great."]},"Fall '11":{"comments":["Really forces you to learn Italian, but the busy work is a drag.","Only take it if necessary.","There is going to be work consistently every week so be prepared for the time commitment"]},"Spring '12":{"comments":["This class was difficult but it gives you what you want out of a foreign language course! I learned a lot of Italian.","Italian is a wonderful language and the class does a great job of helping you learn it and enjoy it. I was able to get a great TF, but I have heard others are not as good.","Patrizia is the best TF ever! Seriously, she made my section this semester so much better than Aa was last semester; she makes it fun and actually encourages people to talk, which was great. This class definitely has a lot of work\/assignments, way more than you could ever do and still do everything for all your other classes, but it sort of works out because none of it is really worth a huge percentage of your grade. You definitely learn a lot of Italian in a very short period of time, which was really cool.","Italian Ab is a great course to take to continue your study of the Italian language! The classes are small and always fun and interesting!","Daily preparation is necessary.","The Italian program was great! I learned a lot and had fun doing so.","Be prepared for a difficult, but fun class!","Fun and, generally, not stressful.","Take it if you are really interested in Italian and willing to work to learn it. Do not take if you are not willing to put in the work and are simply looking to fill in a language requirement.","This class was much more work than expected. If you're excited about Italian, however, it's a wonderful course to take.","It is graded toughly and is a bit difficult, so if you don't like foreign languages don't take it as an elective","This class is definitely harder than Aa. If you really do love Italian take this class, but  keep in mind there is a lot more work involved--you have to do everything you did in Aa in addition to the extra work of Ab.","This course was really hard, for no reason.","I never expected that after just two semesters of Italian I'd feel so proficient at writing and reading. You'll probably still need more practice speaking after Ab, but you do learn SO much in this class.","This class is harder than Italian Aa, in that there's a lot of grammar and there's a lot more work. I think you come out of it much better at Italian, but it can be very frustrating at times. Take this class if you know you want a citation in Italian, or if you're passionate about learning the language.","There is a lot of daily work and studying you have to do. Don't take just to fill the language requirement, be really interested in learning italian, otherwise you'll do a lot of work for a requirement.","This is a good class, but definitely not as effective or helpful as Italian aa. Maybe it was my TF, but I felt like I taught myself virtually all of the material this semester. Class time was spent doing totally different things, NOT going over grammer or vocab.","Your TF can make or break your experience. Try to create a good relationship with one.","This class is tons of fun and you really will learn Italian.","Similar to other great language classes I've taken at Harvard - take it!","An great & fast immersion to all that is Italian.","Compared to Italian Aa, there's a lot more busy work. Make sure you have a good section, because the instructor can really save the course.","This class depends on a lot on your TF, but the material is generally straight forward and much like any other introductory language course.","The course is not extremely difficult, but it requires that you keep up in the book.","This is a fun language class. It is similar to English, so it is not as difficult as other languages. The TFs are great, but there is a lot of busy work.","Its a fun class and not too heavy","Take something else","Great for continuing to learn to speak Italian.  Also, an easy class.","Make sure you have Sarah!","Interesting course material, but a ton more work than other language classes at the same level.","I really enjoyed Italian Ab!  It's like Aa, except with more interesting culture and a cool Italian movie to watch.  Pick your TF carefully - they will determine how much you enjoy the course.  Chris is a great TF - really helpful in class, accessible outside of class, really focused on making sure we understand the material.","If your looking for an easy language (which I was) I do not think this is it. Some TFs are easy, but this section was hard.","It's a fun class, but if you're just going for a language requirement you might be better off with just Spanish or something. Italian is a lot of work, but if you put in the effort it's very rewarding. I would recommend it if you're interested in learning about the Italian language and culture.","This is one of the most relaxed language departments, it makes fulfilling your language requirement as fun and painless as possible.","Italian is a beautiful language and the class will do wonders in getting you comfortable speaking the language.","You will certainly learn Italian better than you will on your own or through any other program. However, beware of the time you dedicate to it. If you have no time, you will suffer. Also, the grading is rough, so don't take this class if you're looking for an easy A. Take it only if you really love Italian and want to learn the language.","Italian is a beautiful language, but this class is a lot of work. it's fun though, and make sure you're with a TA you like. the teacher can change your entire experience with Italian","If you have always wanted to speak Italian, take this class! Then, go to Italia and practice."]},"Fall '12":{"comments":["The class was great in the beginning, and very easy. It soon became much more difficult, and the work was tedious and unhelpful. However the section on La Meglio Gioventu (the movie) was interesting. Its a great movie.","TAKE IT. TAKE IT WITH CHRIS. HE'S AWESOME, YOU'LL LEARN MORE, AND HAVE FUN.","This class definitely made me more confident in my Italian abilities.  It wasn't very stressful or time-consuming but I learned a lot, and Chris really cared about us all learning.","Relaxed class that makes learning the language pleasant.","ITALIAN AB IS SO FUN! Take it. It's not too difficult, and will allow you to refine your Italian skills. Keep in mind that this is a beginning language, though, and will require some tedious busy work.","Just be prepared to speak a lot and have to participate because it is likely to be a very small class size."]},"Spring '13":{"comments":["Take it upon yourself to incorporate studying this material daily as to not fall behind.","This course is very time consuming - you won't get much out of it unless you are prepared to devote a lot of time and attention to it.  It's immersive and a very well-taught course, but a ton of effort needs to come from your end and if you feel like you won't have enough time\/energy to continuously prep for this class you might want to save it for another semester.","It's so much fun! Great language!","This is a good class to take to fulfill your language requirement. The sections are very small so you will have plenty of in class opportunities to practice the language.","It's hard","The writing, reading, listening, and speaking practice in this class provide a fitting continuation to Italian Aa.  The workload is manageable as long as you keep up with regular reading and lab manual work in preparation for the weekly take-home quizzes.  Be aware that these quizzes will take up a significant portion of your weekend, and that you will also need to watch a six-hour telefilm outside of class. There are also a good amount of concluding activities during Reading Period.  Overall, though, Italian Ab is a culturally enriching experience.  Although the work can seem monotonous at times, the proficiency you emerge with is well worth it.","Good class, especially if you get the right TF. Good option to fulfill the language requirement.","Challenging, but one of the better taught languages","This is a great course for learning Italian but it really depends on your section leader and your own dedication how much you are going to get out of it. If you really want to learn the language but your section leader is not doing much in class, you can still learn a lot by practicing with your book and the online materials. However, if you are not interested in learning Italian and are just trying to fulfill a course requirement, Spanish might be easier.","This is a good course if you are interested in learning Italian. Your experience and how much you learn really depends on your teaching fellow.","Italian is a very beautiful language! The teachers are encouraging and although some of the tenses can be complicated, you get a great foundation in Italian after taking this class and Italian Aa.","This class, while it shouldn't, feels like it depends on what TF you have.  Shop around for a good one during shopping period.","This class was a huge disappointment, but I feel like it depends on the TF. Last semester, for Italian Aa, I had a wonderful TF and I learned so much. My language ability at the end of one semester of Italian was better than my ability now, after a second semester. It's hard for me to say what exactly was learned in this class: I know what the goals were in terms of grammar structures, etc., but I do not feel like I actually mastered them because section was completely pointless. There should be some oversight in the department to guarantee TFs actually teach (and not just for the one section with the head of the department sits in on the class).","As a grad student doing thesis, this elective course took more time than I expected.","I would feel much more comfortable holding a conversation with someone in Italian now after taking this course. It covers the major tenses in the language.","Italian Ab is the core italian grammar class. it can get intense but you learn alot","It is good but not great.  The Tfs range in their style, effectiveness, and difficulty and you never meet the course head.","This course is a lot of work for a moderate amount of knowledge. But if you want to learn how to speak Italian, it is necessary to put in the time. So it'll be rough, but you'll get something out of it.","It is not easy by any means of the imagination but Nicholas is amazing as a teacher and he makes you want to learn. Aa was a walk in the park compared to this but I feel as though I could get by in Italy now so the class has fulfilled its requirements.","you are immersed in italian with students just as committed as you, and a professor who wants you to do your best!","While your experience will absolutely depend on the TF you get, definitely consider taking this course. The language, itself, is a pleasure to learn, and the friends you make through the course are fantastic. As long as you are willing to put in the work to be able to communicate effectively, this will be the highlight of your semester.","Keep up with the work and review the chapters before they are covered in class as to be more familiar with the material in a general sense.","While the homework sheets can feel like busy work, if they are done every night then they're not too overwhelming. The class is definitely a fun way to fulfill the language requirement because Italian culture is so interesting. It's also great that class doesn't meet on Fridays.","Approach it like any other language course, and don't fall behind on grammar as it moves quite quickly","It's a fun course and the work in the course isn't necessarily hard, but it's time consuming.","There is more busy work than Italian Aa, but it is a good followup to Italian Ab.","Fun and good class","Some of the assignments, like the take-home quizzes, do not allow you to use dictionaries or online translators. This may seem silly or unfair, but working without these resources will really force you to become craftier in your usage of the language.","This class is a great continuation of Italian Aa. Even if you struggled with Italian Aa, continue with Ab. You learn so much is this semester of the course."]},"Fall '13":{"comments":["A well-organized course. Ceceilia is a very knowledgable and approachable, fun instructor. The assignments and in-class work are interesting and relevant. The pace is good, not too fast but allows us to take time to understand new concepts and begin using them effectively. My favorite part of the class was the movie we watched and discussed. This class successfully incorporates culture into building upon the basics of Italian language."]},"Spring '14":{"comments":["Be careful about the workload, it is a lot more than it initially seems and often comes sporadically.","The class moves too fast.  There is too much information in too short of a time span.  Also make sure you get a good TF","This is a great course for learning Italian. I learned so much about taking this course and this was only my second Italian class ever. The combination of speaking while also looking at real world examples was quite interesting.","Walking out of Italian Ab, a student is fully equipped with the skills necessary to speak with fluency in Italian.","I loved this class and eagerly recommend it to everyone! It was fun, helpful, and interesting. The readings, the assignments, the movie that we watched, and the daily conversations in class added up to make my experience in this class simply amazing.","Ab is a lot harder than Aa; there are a ton of verb tenses to learn in a short amount of time. Its less fun and more intensive work","A great class. I got a lot more confident in Italian after this. Speaking is highly encouraged and the workload is not so bad.","The course is much more verb-dense than Italian Aa. You will be conjugating a great deal, with a plethora of tenses to keep straight. You will walk away feeling like you can communicate your thoughts better, though. As far as enjoyment\/quality of learning, it unfortunately depends a great deal on the TF. He or she can make or break your experience.","Italian is a fantastic language and is a lot of fun to learn.  This course did a great job introducing me to the language, though it went, in my opinion beyond the scope of an \"intro\" course.  If you are prepared to learn many many verb tenses, go for it and have fun with Italian.  Also, note that your experience in the class will vary greatly based on your TF.  If at all possible, avoid getting Adam as your TF and you will be much happier.","languages take a lot more effort than you would expect. be willing to put in the time and effort into the course.","I've learned more with one year of Italian than I did with three years of another language in high school. I would highly recommend this course to anyone with an interest in speaking Italian.","There seemed to be significantly more work than Italian Aa, but by the end of the course, I was significantly more comfortable communicating than in Aa. Definitely worth the effort.","Marco Aresu was a phenomenal section leader. The class does not require a lot of work, but a little work has to be done just about every day in order to keep up.","This class can be a lot of fun, and with the small classes and good TF's, I really enjoyed section. The work is pretty manageable, but sometimes there can be a lot of small assignments at once. The pace can be fast at times, so it's good to always be on track with the material.","The class itself is fine. To the extent that you can, find a TF whose teaching method works best with you - it can make all the difference.","Italian is a fun language to learn","Italian is great. This class is quite a bit of constant work doing activities and such but it is definitely worth it if you want to learn Italian. Also as far as language requirements go this is a very fun way to fulfill it!","Italian Ab wasn't quite as satisfying Aa, but you get out of it what you put in. You can certainly leave the class with a good grasp of Italian if you put in the work. Soroor was a helpful and kind TF."]},"Fall '14":{"comments":["Julianne is a phenomenal TF who is somewhat intense but will really make you want to work to understand Italian. This course is incredibly grammar-heavy but will teach you a lot in a short amount of time.","You should be interested in learning Italian because the course covers a lot of material. Julianne was an excellent TF!","The class was taught very well.","Italian Ab teaches essential grammar portions of the language following and expanding upon that taught in Aa but also furthers the cultural connection of the language.  There is more interaction with different forms of media (songs, movies, etc) and culture (fashion, arts, industry, etc) that make the language more applicable to use in a richer context.  The course requires a lot of time to fully grasp the language, but it teaches a lot of material and, in my opinion, really advances your ability to speak and understand the language beyond a basic level.","The class is something of a grind, as most language classes are, as it meets every day and has almost nightly assignments. However, if you put the work in in class, it will be a very rewarding semester."]},"Spring '15":{"comments":["Experience is probably strongly dependent on the TF, but it is a solid way to fulfill the language requirement. Decent amount of busy work","a lot about you experience in the class depends on your instructor","Best class I have taken at Harvard","Great class!  Lots of fun, and a great way to get the language requirement out of the way.","Ceil, my italian teacher, was great! She was a wonderful teacher and I would recommend her to anyone looking to take the class in the future. I would however say that there is quite a bit of things that could be improved in this class (nothing having to do with the instructor though). The QUIA is a real headache, and pretty much a waste of time. Also, the quizes and what not could be better constructed. Over all though, a great way to learn italian or fufill the lang requirement.","I would recommend this course only if the student is super passionate about learning Italian because you're expected to do much of this learning on your own. As a language requirement--there are easier languages that you can take. However, if you do put some effort in, the grading for the course is very fair.","I'd imagine that this class is highly dependent on the TF that you get. Mine was excellent and I really enjoyed it. QUIA is a pain. Also, the class might take more time than you think. There's class four times a week and online homework almost every night in addition to regular assignments.","If you haven't taken italian I wouldn't recommend it","Italian Ab is a really fun continuation of the language, where you actually have the opportunity to watch some great Italian films, read Italian literature, and get really immersed in the beautiful culture of Italy. It inspired me to spend part of my time at Harvard in Italy, and also continue to learn the language to get a citation in Italian. You'll get a lot of this class (in terms of language fluency) if you spend time outside of class daily to do the assignments, listen to Italian music, watch Italian films, etc. Overall, a really fun and great class!","Italian Ab is a great class. It flows naturally after Aa, and really furthers your knowledge of Italian to the point where you could have a conversation in Italian (if you practice). Gianfranco makes the sections interesting and lively, which kept students engaged and interested. I loved watching La Meglio Gioventu as well!","Fun class if you get a good teacher. Going to class 4 days a week is tough but class itself is enjoyable. Pretty easy class overall.","This is a very good course. Italian Ab is fun, rewarding, and practical. Ceil was an excellent TF. Some of the assignments were tedious, but overall the course was good. Many students seem to dislike the online exercises, though they do help learn. There were lots of assignments due toward the end of the semester, and there is a sustained work load for this course.","This class requires you to have a very strong understanding of the materials taught in Italian Aa; without that strong grasp, you may find this class very difficult and overwhelming at times. Other than that, Italian is a beautiful language, and learning it can be fun and intriguing.","Good class to balance out your course load. There is homework almost every night but most of the time it doesn't take too long. It was fun and far more practical than the other classes I took this semester.","This class was very dynamic and I really learned a lot, but it was difficult, and did take a lot of time.  Personally I don't have an aptitude for languages, and so I struggled a bit, but if you do, I'm sure you would really enjoy this course.","This class is so much fun and so useful! It provides a great base for italian language and you really feel like you've learned by the end of the semester. The TFs are so fun and engaging, and although it is work, the finals are not nearly as difficult as some of the other language classes."]},"Spring '16":{"comments":["Italian AB was a great course! I would strongly recommend it to anyone who has taken Italian AA; it's a great way to solidify everything you learned in AA while also exploring new material. However, it is also good to know that Italian AB focuses much more on grammar, so it is consequently a more writing-heavy course than AA. I loved watching La Meglio GioventÃ¹ and creating a presentation based on the film, and the vocabulary units were very helpful and interesting.","This is a great class for those that not only want to learn the italian language but also immerse themselves in italian culture via readings, movies, and engaging discussions.","I would remind them that it's a requirement to take Italian Aa before Italian Ab, but it's a great course for anyone hoping to work, study, or conduct research in Italy sometime in the future.","There are more assignments in ITAL AB than in ITAL AA. We watch movies, read parts of books, read news articles, and do small presentations.","It takes more time than you think it will. Some of the grammar is a bit tricky and will require more effort.","If you want to learn to speak Italian, the program at Harvard is very good at provided a through foundation in the first year while also allowing students the ability to hold normal, full conversations","I would take this course if you were set on taking a language course here during term time. Personally, I kind of wish that I did an intro language abroad over the summer. But I'm generally happy with these classes.","I can't imagine a more rewarding language program that isn't fully immersive.","Do the HWK!","This is a fun, engaging class with an excellent textbook that provides a great introduction to the study of Italian, and the culture of Italy. But enroll because of legitimate enthusiasm for the language, as this will be matched by the instructors. Do not take it to simply fulfill a language requirement!","This course will teach you a lot about the Italian culture and open your eyes to many different things."]},"Spring '17":{"comments":["Italian is an awesome and beautiful language to learn. I would definitely recommend this course if you are looking to learn a different language, even if just to fulfill the language requirement.","Italian is a fun language to learn and is taught well here. Italian 11 is significantly harder than Italian 10, so be prepared for that. But overall, this was a really fun and pretty painless way to fulfill my language requirement. The teachers are all great and really nice, the class includes as much Italian culture as it can, and you'll learn a lot of grammar and conversational phrases. The class is mostly comprised of people fulfilling their language requirement, so it can be frustrating at times to have people in class who just don't care enough, but the teachers are good at getting the energy up in the class. I'm very happy with my choice to take Italian!","It is a great way to form a foundation in the language.","its great take it.","I'm so glad I decided to take italian 10 and 11. Italian 11 has more work than the first semester, so be prepared for longer writing assignments and more frequent quizzes. Make sure to look at the syllabus ahead of time because it's easy to get caught up in the day-to-day homework assignments and be surprise when a movie-watching assignment, group research project, or quiz pops up.","You have to be very intrinsically motivated to learn this language. This class is a lot of work, significantly more than the average class, especially since you spend much more time in class (4 days a week) than usual. However if you are considering studying abroad you will feel much more confident in going if you study the language first!","If you keep up with your work and put in time studying what you're supposed to, the class is very manageable and you will do well.","Great introductory language class. Not too much work and interesting -- our TF did a great job at keeping the class engaged and interested in the material.","This course made learning a language fun and interesting.  I am not very good but I was able to participate in class and learn a lot over the course of the year.","It is difficult but fun","It is very useful and after taking this class you will know italian. In the meantime, getting to that end point is very hard and there is daily work that is necessary to really understand the language.","Take this class if you have any interest in learning Italian, both instructors (Giorgia and Corrado) are great","In terms of committing grammar to knowledge, that is the student's responsibility entirely. By the end of the course there was still a range of skill levels and that is indicative about a student's personal commitment to learning the language."]}},"mostRecentQ":{"overall":"4.30","workload":"5.60","difficulty":null,"recommendation":"4.20","enrollment":"32","response rate":"84.38","QCourseOverall":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"0","2s":"0","3s":"5","4s":"7","5s":"11"},"QDifficulty":{"number":"ITAL Ab","course_id":"4416","cat_num":"7029","1s":"1","2s":"4","3s":"18","4s":"4","5s":"0"},"QWorkload":{"number":"ITAL AB","course_id":"4416","cat_num":"125061","1s":"1","2s":"12","3s":"7","4s":"0","5s":"0"}},"success":true}