{"scores":{"Fall '12":{"course_score":{"overall":"4.27","workload":"2.82","difficulty":"3.36","recommendation":"3.91","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"MODMIDEAST 162","course_id":"3849","cat_num":"5643","1s":"0","2s":"0","3s":"2","4s":"4","5s":"5"},"QDifficulty":{"number":"MODMIDEAST 162","course_id":"3849","cat_num":"5643","1s":"0","2s":"1","3s":"5","4s":"5","5s":"0"},"QWorkload":{"number":"MODMIDEAST 162","course_id":"3849","cat_num":"5643","1s":"1","2s":"2","3s":"7","4s":"0","5s":"1"}}}},"comments":{"Fall '12":{"comments":["On the first day Professor Wood told us that hard work will pay off in this course. This is mostly true, except for the final which seemed out of the normal character of the course. While a ton of work, (If you read all of the documents given you, it is at a minimum 100-200 pages per week, often exceeding 200 pages. I didn't actually count but I insisted on printing each reading, and by the end of the semester I had printed off over 1300 pages off papercut, the majority of which were from this course.)I felt that I possessed an excellent understanding of the origins of Modern Middle Eastern history, especially when it comes to intellectual movements. Overall, if a student wants to understand contemporary Middle Eastern History, I'd highly recommend this course. If you're just looking for an interesting elective, this is it, but I'm not sure if its worth the time commitment.","This class is a great basis in Arab thought and early modern Arab history. Professor Wood really cares about making you a better student, and is super helpful.","It's a great overview of the early modern period in the Middle East, with a focus on primary sources and Egypt, in particular. Wood is really smart and gives engaging lectures. Plenty of reading, but assignments aren't too hard.","This course was extremely disorganized.  It is an interesting time period that I feel like I did not truly get to learn about due to the rambling nature of the lectures. We did not get through the syllabus and it was more focused on learning how to study history rather than about the history itself, which is not what I wanted.","Professor Wood is very passionate about his subject, and you'll be wowed by his very well organized lectures.  I'm really impressed by his willingness to provide us a nuanced and refreshingly complex panorama of the Middle East.  I will never forget his last lecture; it was by far one of the most intellectually sophisticated talks about the current situation of the Middle Eastern studies.  I wish he could return back response papers more promptly, but this is a minor issue.  Overall, an excellent course!"]}},"mostRecentQ":{"overall":"4.27","workload":"2.82","difficulty":"3.36","recommendation":"3.91","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"MODMIDEAST 162","course_id":"3849","cat_num":"5643","1s":"0","2s":"0","3s":"2","4s":"4","5s":"5"},"QDifficulty":{"number":"MODMIDEAST 162","course_id":"3849","cat_num":"5643","1s":"0","2s":"1","3s":"5","4s":"5","5s":"0"},"QWorkload":{"number":"MODMIDEAST 162","course_id":"3849","cat_num":"5643","1s":"1","2s":"2","3s":"7","4s":"0","5s":"1"}},"success":true}