{"scores":{"Fall '12":{"course_score":{"overall":"4.50","workload":"1.70","difficulty":"3.00","recommendation":"4.50","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"0","3s":"1","4s":"3","5s":"6"},"QDifficulty":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"1","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"3","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 38l","cat_num":"4870","course_id":"1850","year":"2012","term":"1","id":"be40fc65558edcbe74530e3919deb3d5","first":"Joanna","last":"Nizynska","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.83","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.17"}]},"Fall '11":{"course_score":{"overall":"4.55","workload":"1.82","difficulty":"3.00","recommendation":"4.27","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"0","3s":"1","4s":"3","5s":"6"},"QDifficulty":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"1","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"3","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 38l","cat_num":"4870","course_id":"1850","year":"2011","term":"1","id":"be40fc65558edcbe74530e3919deb3d5","first":"Joanna","last":"Nizynska","InstructorOverall":"4.45","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.45","GeneratesEnthusiasm":"4.55","FacilitatesDiscussionEncouragesParticipation":"4.73","GivesUsefulFeedback":"3.18","ReturnsAssignmentsinTimelyFashion":"4.25"}]},"Spring '11":{"course_score":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":null,"response rate":null,"QCourseOverall":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"0","3s":"1","4s":"3","5s":"6"},"QDifficulty":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"1","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"3","2s":"7","3s":"0","4s":"0","5s":"0"}}},"Fall '09":{"course_score":{"overall":"4.67","workload":"2.00","difficulty":"3.00","recommendation":"4.67","enrollment":"3","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"0","3s":"1","4s":"3","5s":"6"},"QDifficulty":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"1","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"3","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 38l","cat_num":"4870","course_id":"1850","year":"2009","term":"1","id":"be40fc65558edcbe74530e3919deb3d5","first":"Joanna","last":"Nizynska","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.33","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"3.67","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '08":{"course_score":{"overall":"4.50","workload":"2.00","difficulty":"3.50","recommendation":"4.50","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"0","3s":"1","4s":"3","5s":"6"},"QDifficulty":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"1","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"3","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 38l","cat_num":"4870","course_id":"1850","year":"2008","term":"1","id":"be40fc65558edcbe74530e3919deb3d5","first":"Joanna","last":"Nizynska","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.75"}]}},"comments":{"Fall '08":{"comments":["This class is an excellent introduction to a broad variety of literary and cultural theories.  More importantly, it teaches you how to read and think critically and discuss and write about topics with depth and subtlety.  If you take this class, you should be prepared to be frustrated or confused by some of the readings and discussions, but Professor Nizynska was always very willing to take as much time as necessary to help students understand.","It was by far my favorite course of the semester.  You will not only expand areas of your already-existent thinking, but you will likely be made aware of areas of academic study that you never really realized existed.","This was a wonderful class which effected my thinking deeply.  I would encourage anyone who wants to step outside their comfort zone and see culture in a new way to take this class."]},"Fall '09":{"comments":["If you enjoy literary analysis, then definitely enroll in this seminar. It provided great information and tools necessary to better understand Literary Theory.","Though I didn't know what to expect coming in, this course far exceeded my expectations. Literary Theory, a vaguely defined  field, is endlessly complex and interesting. It touches upon more broad things than just books and it is all at once literary and philosophical and sociological and anthropological and really anything you want to think about. I found this open-mindedness refreshing and very engaging."]},"Fall '11":{"comments":["It was an amazing way to spend an elective. It definitely is the one class at Harvard that changed the way I think and read. Introduces you to a considerable number of concepts and ideas that are useful and fun to know.\r\nNevertheless, I would recommend you take this class only if you are interested in Literature, Linguistics and Philosophy. And also, in average it is more time-consuming that you would\/expect a Freshman Seminar to be. If you take it though, it will be worth it. Just be prepared to read a lot, write without putting boundaries to your imagination, discuss ideas in a way you have never done it before and write a huge final paper and review. So take notes all semester.","This course helped me learn to struggle with documents on my own, without relying on a professor's explanation until after I had developed my own ideas.","The texts can sometimes be difficult to understand, but the weekly responses are easy to complete in a short amount of time and the discussions and time spent with Prof. Nizynka are well worth the effort.  One thing to watch out for -- the 12-page final.","It'll challenge your ways of thinking, and your ways of thinking about thinking.  The readings can be dense, and for a while in the course, you may feel like you aren't getting anywhere.  But at the end, when you have that \"ah ha!\" moment, it is so worth it.  I feel like I got more out of this class than any of my other classes.","This is a great freshman seminar. The workload is extremely manageable and I enjoyed going to class each week.","Great class. Challenging to your thinking, but manageable workload.","Professor Nizynska is a patient and knowledgeable guide through the sometimes confusing world of literary theory: if you really embrace theory, it will change the way you think in exciting ways.","This class is one of mental acrobatics, so be prepared for this mental workout. The first month or so of the class you have to trust that where your studies are leading you will be made clear in time. Eventually you hit that one class and see the foundations you've been building and realize that you have actually been building a toolkit for creating intertextuality.","The readings are tough because literary theory is just a hard subject. I wish I could have gotten personal feedback on my responses just to see what my progress is. However, the seminar meetings themselves are great."]},"Fall '12":{"comments":["When reading texts, do not despair if you misread it. As Professor Nizynska told me, it is all part of the process. Different people read differently, as it should be. The class is very enjoyable, and not too bad in terms of reading and writing, only one final paper that is 10-12 pages long and a one page response to the reading every week. I highly recommend this seminar.","It changes not only the way you read books, but also watch movies, listen to music etc. No background knowledge of Literary Theory is needed, I had none, and still really enjoyed the class.","the seminar format in general is great, and I know most of my classmates really enjoyed this particular seminar. this class really takes you deep into literary theory - but if that's not your thing (as I realized was the case for myself), spending 2 straight hours\/week discussing intimate and often times confusing details of a text can be a bit challenging. you don't need a background in literary theory or linguistics - Professor Nizynska will work with you and teach you all you need to know. BUT you definitely need a passion for learning this kind of material if you want to stay engaged and interested throughout the semester. if you have that passion, you will really enjoy this class. there IS a final 10-12 page paper, but I personally had a great time writing mine because it's on a topic of your choice.","If you are interested in literary theory, this is a great class. If not, probably don't take it. Be warned: the subtitle of \"how to read like a college professor\" is misleading.","Gets intensive, especially in the discussion and thought, but if you enjoy looking at things from different perspectives and discussing, this is the class for you","If you're at all interested in literature or theory, TAKE THIS COURSE. Professor Nizynska is amazing in so many ways. She's extremely thoughtful and insightful when it comes to applying theory to all sorts of cultural practices\/ideas (which brings concreteness to what is studied), and she really cares about her students. She was always urging us to to slow down and give our minds space to think, which was a really refreshing perspective and voice to have. Plus the material\/reading is amazing; you'll get it as much out of it as you want, since you can obviously skim by without doing much and by writing weak responses each week. But if you put in the time and engage during class, you'll become a much much stronger thinker and reader with an added bonus of a strong theoretical base for future classes.","If you are considering a freshman seminar for your fall semester, look no further than this seminar. I had a wonderful experience and learned so much more than I could have ever imagine first coming into the class.","This class is an excellent opportunity for a personal intellectual journey without pressure or competition. If you are at all interested in literary theory or humanities in general, I would highly recommend this class because it truly helps you think in a whole new way. It also touches on many different fields and is really interdisciplinary, so I would recommend it to anyone. In addition, Professor Nizynska is extremely intellectually inspiring, and she really improved my freshman experience. This is top-notch freshman seminar.","Apply for this seminar!  This course was absolutely amazing.  It taught me new ways to think and actually challenged me mentally.  It makes you question the things you may think are self-evident.  I was genuinely sad the last time the class met.  I felt like I got to know the other members of my seminar really well, and they also contributed to my new understandings of..everything.  I don't feel like I will ever read a book the same way after taking this seminar.  Apply!","The course is more work than your typical freshman seminar, but it also is more rewarding! Take it if you want to understand the theory that you encounter when you read other works, or if you are interested in pursuing the humanities at all."]}},"mostRecentQ":{"overall":"4.50","workload":"1.70","difficulty":"3.00","recommendation":"4.50","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"0","3s":"1","4s":"3","5s":"6"},"QDifficulty":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"0","2s":"1","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"FRSEMR 38l","course_id":"1850","cat_num":"4870","1s":"3","2s":"7","3s":"0","4s":"0","5s":"0"}},"success":true}