{"scores":{"Spring '16":{"course_score":{"overall":"3.40","workload":"3.40","difficulty":null,"recommendation":"3.60","enrollment":"493","response rate":"79.11","QCourseOverall":{"number":"GOV 1359","course_id":"2227","cat_num":"125228","1s":"22","2s":"64","3s":"117","4s":"119","5s":"65"},"QDifficulty":{"number":"GOV 1359","course_id":"2227","cat_num":"0913","1s":"12","2s":"85","3s":"161","4s":"17","5s":"0"},"QWorkload":{"number":"GOV 1359","course_id":"2227","cat_num":"125228","1s":"129","2s":"193","3s":"15","4s":"3","5s":"1"}},"instructor_scores":[{"number":"GOV 1359","cat_num":"125228","course_id":"2227","year":"2015","term":"2","id":"7834ade059fdf2a12938aa02e53064db","first":" Carlos E.","last":"Diaz Rosillo","InstructorOverall":"3.30","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"3.40","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"3.60"}]},"Fall '12":{"course_score":{"overall":"3.64","workload":"1.74","difficulty":"2.67","recommendation":"3.85","enrollment":"299","response rate":"92.31","QCourseOverall":{"number":"GOV 1359","course_id":"2227","cat_num":"125228","1s":"22","2s":"64","3s":"117","4s":"119","5s":"65"},"QDifficulty":{"number":"GOV 1359","course_id":"2227","cat_num":"0913","1s":"12","2s":"85","3s":"161","4s":"17","5s":"0"},"QWorkload":{"number":"GOV 1359","course_id":"2227","cat_num":"125228","1s":"129","2s":"193","3s":"15","4s":"3","5s":"1"}},"instructor_scores":[{"number":"GOV 1359","cat_num":"0913","course_id":"2227","year":"2012","term":"1","id":"7834ade059fdf2a12938aa02e53064db","first":"Carlos E.","last":"Diaz Rosillo","InstructorOverall":"3.61","EffectiveLecturesorPresentations":"3.64","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.02","FacilitatesDiscussionEncouragesParticipation":"4.09","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"3.72"}]},"Fall '08":{"course_score":{"overall":"3.96","workload":"1.73","difficulty":"2.66","recommendation":"4.04","enrollment":"256","response rate":"65.23","QCourseOverall":{"number":"GOV 1359","course_id":"2227","cat_num":"125228","1s":"22","2s":"64","3s":"117","4s":"119","5s":"65"},"QDifficulty":{"number":"GOV 1359","course_id":"2227","cat_num":"0913","1s":"12","2s":"85","3s":"161","4s":"17","5s":"0"},"QWorkload":{"number":"GOV 1359","course_id":"2227","cat_num":"125228","1s":"129","2s":"193","3s":"15","4s":"3","5s":"1"}}}},"comments":{"Fall '08":{"comments":["Awesome class.","The Road to the White House is a wonderful class! Professor Diaz's enthusiasm for the material was astounding.","it is not as interesting as you think it will be","Very interesting subject that is vital to our nation's government. The workload was easy but I feel like I learned a lot.","There was little solid content to the lectures. The Professor was also un-engaging. But the essay topics were interesting.","One of my favorite classes ever!!","Stupid class with nothing to gain. Carlos is a terrible professor, though Ed was a good section leader.","Great way to learn about the road to the white house.","great choice","This class is an easy way to learn about US Gov, and a great way to fill up a gov requirement. I'd tell them to enroll especially if it is an election year.","great professor, interesting class for a non gov major","For the highly politically engaged, most lectures will be boring.","enjoy, but watch out for grading!","Take this course if you want a fun and interesting elective.","While it may seem like a class that will be an easy A, papers and exams will be graded somewhat toughly, so you will have to do the excessive, dull, repetitive readings eventually.","TAKE THIS COURSE - especially on an election year.  You learn SO MUCH.  I knew N-O-T-H-I-N-G about government, politics, elections, etc. and now I can answer any question intelligently.  It really makes you think about our systems and you get to hear amazing guest speakers.","Professor Diaz is an amazing professor.  But I would question whether the course could really be taught in a non-election year.  Further, there are many people in the course with a huge head start in there knowledge of the electoral system, and the course does little to ensure that better grades are not given to the political junkies.","Road to the White House is an excellent class for students who are interested in US Presidential politics and who want to become better consumers of presidential elections.  However, I would not recommend this class to students who already posess an in-depth knowledge on this subject, as some of the material might seem a little repetitive and tedious.","It is great before the election, afterwards it is not as great","It is a fun way to learn about US elections. I would highly recommend taking it in an election year (even during midterm elections) because it is a good way to keep up with the developments.","Do the readings- they aren't hard and they are very interesting","Great to take in an election year.","Awesome professor, extremely engaging and interactive lectures, very fun and interesting material: a different kind of class where you still learn a lot.","i would reccomend taking it during an election year--it was a great way to follow the election","The best thing about this class was how relevant it was and how you learned theories behind why candidates and politicians act a certain way. Those theories are always alive, but because the election doesn't happen every year (and every election may not be as exciting as the 2008 election), this class may be less exciting, but still fun as a post-election evaluation.","the course seemed like nothing more than an excuse for professor diaz to try to meet important political figures, his lectures just power points, obvious conservative bias, he let people do a forum instead of write the first paper which unfairly advantaged students with connections","it's awesome","A fun way to follow a current election.","The mix of media, lecture, and guest speakers in this class made it really exciting.","while it appears easy because lectures are a joke, the reading and workload is actually very heavy while the essays are graded pretty harshly.","The course got a little dry as time went on (after the election).","This class helped me to understand what I was reading in the news.","Go for it; Carlos and the subject matter are fantastic.  Any kinks with expectations and grading are almost certainly worked out by now.","It was very exciting and enlightening to take this course during a Presidential election year, but I worry that it would lose its main source of energy if it is not during an election year.","This course is strictly about the campaign aspect of White House politics. While it involves discussing interesting and relevant information (given the fact that the 2008 presidential campaign was occuring at the very time this class was being taught), if your passion lies in the realm of government policy, this class does not deal with such information. Be prepared to be surrounded by many intense, political minded students, all of whom are greatly opinionated, should you take this course.","Better off taking the American Presidency -- Better lectures and this class can be summed up in one week.","You should already have experience in politics and an understanding of what goes on. If you don't read the newspaper regularly, do not take the course.","interesting and fun","unless you could get aaron byrd as your proffessor","Some basic material if you have knowledge of US gov't, but some new material as well. Class very full--too full--in election year. Paper topics were too broad and harshly graded.","\"The Road to the White House\" is an exciting course that gives students a front-row-seat to the journey that is the Presidential campaign.","Definitely take if it's an election year!","The course is overall disappointing.  If you have studied American government or campaigns at all, there is really not much you can learn from it.  The paper assignments were too broad and ambiguous.","I cannot say that this class will be as exciting in a non election year, but the timing of the class in fall od 2008 was fantastic.","It may be different in the future because this was the election year","Although it was fun to take during the campaign season, the class lost its charm after November 4th.  The theory got in the way of a once engaging course.","Enjoy the multimedia!","Great preparation for interviews - it gets you reading WSJ and keeping up to date on current affairs.","Although a lot of the course seems discussion-based, the exams and papers require having done the reading and attending lectures","awesome different and exciting class","Damn painless if you're into politics.","TAKE THIS COUSRE!!! ITS UNBELIEVABLE AND SHOULD NOT BE MISSED","Carlos presents the Presidential campaign and transition process in a very unique and interesting way.  He actually really really cares about the students as well- his invitations to office hours are completely sincere and he really enjoys engaging students both in the material and on the course as a whole.  He chose good reading and good assignments that made y ou think but were not too much to handle.  Also, the TF staff reflected all of the good things that Carlos set up in the class- they engage you as a student, they care about your feedback, and they do what they can to make learning the info. fun!","Carlos Diaz is fantastic and I learned so much without realizing it - I made an informed decision when I voted in the 2008 presidential election.","It's easy but you don't learn much and it's surprisingly graded pretty harshly.","Pretty easy class that is great to take in an election year to keep\/stay engaged in whats going on.","If you know the basics of elections or government, this class will be very easy for you. These people may not want to take it if you are looking for a class that will challenge them and teach them new things or ways to thing. For all others, it is a very good introduction to an important subject.","it's a great class to keep up on current events and the media aspects of campaigns (ie: debate moments, gaffes, etc); really helpful to take in a presidential election year!","This class was very enjoyable, and a great introduction to U.S. elections and campaigns. Taking the course was much more exciting and interesting because it was being taught during the 2008 election.","This class would be a very good introduction to the executive branch of government in our country but is almost futile for learning anything more advanced. On the other hand, if you would like to take a class that is not very demanding from week to week...","Interesting class, will give you a context to frame your thinking about Presidential campaigns for the rest of your life.","It was a great class!","I would recommend this course during an election year.  Otherwise, I'm not sure I would recommend it.","Excellent course to understand american politics, especially the presidency.","This was an incredibly timely course and I will remember what I learned because it was taught so well and was so relevant to my life.  I would recommend it whole-heartedly.  Diaz is also a great lecturer.","Fun, but the fun wears thin after the first few weeks as the course develops and one realizes one hasn't really learned all that much.","Very interesting, it is what you make of it. Do the reading and learn or do not and you will not, though you may still figure out a way to get high marks.","take it.","brillint insight into how campaign insiders think.","This was not the worst but certainly the most disappointing course I took at harvard. The incredible opportunity to teach a course on elections during a historic election was squandered entirely and professor Diaz was an endearing but unable instructor.","It is very fun and engaging at first but gets dull, redundant about halfway through","While the class had high points, there was a lot of redundancy in lectures and there's a lot of requirements outside of class like watching the debates and documentaries together.  It adds up to a lot of time.","For those of us who are not politically inclined, this class was a great overview on the political system, specifically the electoral system, in the US.","It's a really fun multi-media experience that sends you head-first into the world of campaigns and elections.  It's great!","This is a class that you will enjoy going to!","Learn a great deal about the history of the United States selection of presidents, extremely intersting material","This class is really exciting! The professor does a great job exploring the electoral system, and guest lecturers add even more flare to the course.","This was a fantastic course!","I felt it was very difficult to know what was expected on the papers and exams. If you do not know anything about American presidential elections, this may be a good class for you, but I felt that I did not learn much that I didn't already know."]},"Spring '16":{"comments":["Definitely learned a lot of relevant stuff but the lectures were a little slow and the grading was obscure.","This course contains interesting material and is quite engaging. However, the approach to testing and grading in order to get an agreeable distribution in such a large class was worth not taking this class alone.","Interesting subject matter and fun to take in an election year, but the lectures were very dry and felt a lot of the time like just a recitation of the powerpoint being projected. Went through slides really quickly. But it's not a difficult class.","It's easy and fun to talk about the election but didn't really open my eyes to anything.","If you are interested in learning about the basics of American politics, I recommend you to not take this class, for the majority of the students are already well-versed in the topic. Don't expect the lectures to go into the minute details, and do expect to do a lot of self-studying.","The readings are essential to the midterm and final but, not emphasized throughout the year. Otherwise a great class! Be warned, the ad project takes a lot of time and you should start early!","This is too easy of a class if you have any background in the American electoral system, and I would not recommend it if you do have a strong background in American politics. However, if you want to learn about the electoral system and you don't know much or anything at all about it, then this is the course for you as it will give you a good survey of the theories, issues, and events in the historic and present day American campaign process.","Solid Government class to take, especially since it isn't offered every year. Prof. Diaz is able to make the class appealing to everyone and really cares about his students. But beware - sections are a very weak part of the course. Grades seemed to be given out arbitrarily.","Before stating the obvious, there is some interesting material that this course covers, but there is not enough of it to make it a full semester's worth. They have interesting guest speakers and from time to time there are entertaining moments. \r\n\r\nBut honestly, when the vast majority of the class takes it as a filler, light class, it's hard to get a whole lot out of the section component of the course. Not that taking it as a filler, light class is bad, that's what I did, but rather, if you were interested in a tougher class that covered more material in more depth, I would stay away from the course. Otherwise, it's worth taking to fill in for a course that still generates some interesting thoughts without asking too much of you! Recommend!","This class is easy and fun, but Carlos Diaz is a bit of an egomaniac who takes pride in preventing students from getting As. With a good TF, you should be fine, but if you get a bad one I would switch out.","Really disorganized, materials\/expectations not consistent","Keep up with election-related news and the class will feel easier and be much more exciting.","You only get one chance to take this class as a College student. Do it!","Don't take this class. It's not a gem. Everything about it is boring and exams require you to memorize hundreds of useless ID's. Find a better class for a \"gem\" and just google \"American political process\" if you want a summary of all you'll learn in this class.","Decent class but at a very introductory level. If you don't do the readings, you'll learn as much as you would've just following the news\/whatever you learning in AP Gov.","Great way to keep up with the election. But can be boring at times.","This is a great class to take, especially during an election cycle. The material and lectures are always interesting. But be warned that it's difficult to get an A - the TF's can be harsh graders and will make or break the class depending on who you get.","Do not take. It isn't it worth it even considering how easy it is.","the lectures are very long and can be difficult to sit through, especially at night. good overview of the election process and considerations made by candidates","This is a great class. You will enjoy lectures. You will learn a lot. You will have fun. There are not many chances to take a class like this, so do it! You won't regret it. The workload is not difficult. There's nothing to lose.","If you are interested in the Presidential election, this is a course you want to take. Try to stay updated with readings so you do not have to spend hours memorizing information at the end of the semester.","Interesting topic matter and pretty do-able work load, but two hour lectures can get a bit dry.","Incredible class. Super interesting especially when you don't know about politics. I learned A LOT and enjoyed it.","If you're interested in government and elections, you'll enjoy this course. If you're already familiar with politics, though, you might find some aspects repetitive.","Only meeting once a week is awesome, but beyond that there are very few incentives to take this class. The material is generally boring and something you would have already learned in high school. There is a huge discrepancy between TFs and what they expect on assignments. Some TFs expect you to know which reading and author every point you make comes from, while other TFs don't even mention it or care at all. This class should have been a gem, but just became more of a hassle.","To get the most out of this course, you are expected to read 100+ pages per week, which is a lot of an elective that does not count for anything. The lectures get very boring and repetitive after the first two, and you'll soon find yourself sitting there watching netflix or watching someone else play slenderman and other such computer games 3 rows ahead of you.","Good for students who lack a basic understanding of the U.S. primary and general election system.","This is an awesome course. Lectures were the highlight of my week, and unlike a lot of large classes, lecture attendance was excellent. Because Prof. Diaz was so engaging, everybody wanted to be there. In particular, he did a great job of tying the academic literature to the ongoing campaign. Two big takeaways: 1) Prof. Diaz is the rare kind of course head who can command a 2-hour lecture every week + is open to meeting students outside of class. 2) This course brings you way beyond the political talk shows and media coverage of campaigns. Definitely take it.","It is low work load and interesting when you would like to know about the election process.","This class isn't a throw-away, super easy class. Pay attention in lecture, particularly to guest speakers (who are super interesting and should be listened to anyway).","There was no better way to force myself to finally get caught up with political goings-ons, being a generally uninformed person. (I did hear from a friend that the content is very similar to AP Gov, which I personally never took). The content is manageable, especially if you have a good TF. There are the typical issues related to such a huge class (less class participation\/intimacy, not knowing who exactly graded some assignments). Not all assignments were enjoyable but overall an easy and relevant class.","This course is extremely informative and you will become a better citizen and a more informed voter because of it. This class is not hard and if you put in the time you will do well. Having a good tf for this course really changes the experience of it so make sure your tf is really fostering discussion. All this being said, if you already know the ins and out of the American presidential election system you time would probably be better spent elsewhere","The grading in this course is ridiculous and not reflective of what you've learned, but rather who your TF is and your ability to remember random facts from readings.","This class covers material most American Harvard students already know. It takes a very superficial angle at a lot of things, without doing any of them well. Very easy","Great class. Take it if you can.","Great class to take during an election year!","If you're at all interested in learning about elections with the current election as a case study, consider this class. Just know that, I'm guessing because the class is only offered every four years, the course feels a little discombobulated. Some lectures feel like something to kill time. There's also a bit of a conservative skew, so don't take this if you don't want to listen to members of the Romney campaign every week.","This was a fun class to take given the excitement of this election, but was often bored in lecture and didn't feel very inspired to keep up with the readings.","Lectures = hot mess, Diaz had no control over the kids, most people were just doing hw for another class or online shopping, watching ads for 30 min in lecture (really?!)\r\n\r\nSection = just a bunch of opinionated politically charged kids, discussions almost always went no where","Its a very interesting subject and the guest speakers are great, but the lectures in general are not very interesting. The professor spends a lot of time proposing questions to the class without getting into the analysis.","Excellent and enlightening course - helps to bring everything you see glimpses of in a campaign into clearer focus!","Incredible class to take during an election year.  Not hard, and Bob White is the absolute MAN.  So much good discussion had in class.","This class is incredible in that you learn so much about US government and campaigning, in addition to being constantly informed about the election currently taking place. Truly a course worth taking if you are looking for a class that just makes you a better member of society.","This class was about twice the size as expected, which must have been hard for the teaching staff. Honestly, though, the course swung back and forth between covering broad theoretical ideas and very specific aspects of the election, so we didn't cover either very fully.","Great class that is only offered once every 4 years. To the next generation of Harvard students: TAKE THIS CLASS!! You'll learn so much about the upcoming election and campaigns.","If you know about American politics and campaign history, and need an easy class, take this. But if you're taking it hoping to learn a lot about American politics or presidential campaigns, you will probably be frustrated by the disorganized format.","Awesome course for understanding the innerworkings of a highly televised election.","It's a really easy but also interesting elective. Lectures were actually really fun. I was engaged for the entire 2 hours and I feel like I know a lot more about how politics works in the US.","To take this class because not only is the content interesting, but the course material is extremely applicable to current events.","This class is pretty painless and a lot of it is interesting. It is really cool to keep up with the election year and look at it from an academic perspective, although you will question a lot of what you learn.","Fun","Great course to take for anyone interested in the electoral process. No background knowledge is required, but the more time you put into simply paying attention to what is going on in real time, the more you'll get out of lecture and section especially.","Take this course if you want a truly vapid academic experience. There was little substance, and it often felt as though the professor really didn't care about the subject matter. It was much too large, and for someone with previous experience in political science, it was extremely low-level.","Take it if you're interested in politics. If not, maybe skip it.","I would especially recommend to someone who is interested in politics but does not really understand the electoral process.","This class was so interesting because you learned a ton about electoral politics and how campaigns really work. There is also exposure to people who are famous in the political world and that is pretty amazing. Definitely impressed my friends with how up-to-date I am on my politics, and I also became knowledgable about past campaigns.","This course is a waste of your time. You will spend most of the time in this class memorizing useless terms and information. You would get more out of reading one NYT article every day. Only take this if you're looking for an easy joke class that you won't get anything out of.","do not take this course unless you already are strong in politics","It does not make much sense that it is offered every four years because it focuses almost completely on the generic electoral process and its history and very little on the current election.","This class is interesting but hard to get a lot out of","I liked the class a lot. The course had a lot of fun moments, interesting assignments, cool videos. It only comes around once every four years, so at your time at Harvard, you will only get one chance to take it. I don't think you will be disappointed.","It is a great class that is really interesting and crucial for current debates around elections","Interesting material, with good lectures. Grading is not standardized across TF's, which is very frustrating.","It was very disorganized, repetitive, and unnecessarily cumbersome. If Prof. Diaz made the material more digestible and less foreboding, it could have been one of my favorite classes at Harvard.","It is an interesting class","It's a good class to take if you are interested in learning more about the election process.  I found it helpful because I had no previous knowledge of the subject and little interest in politics.  It could definitely be better run and engaging, but the material does end up being useful.","You have to be interested in government and the election process","I would highly recommend not taking this class. It will draw you in because the topic seems fairly interesting. But at the end of the day, you're going to deal with a class that has no structure and largely involves making stuff up. It is unbelievably frustrating to go into a class and coming it out of having learned almost nothing. Most of the people in charge don't really know what they're talking about. This class has made me realize that studying government is a pseudoscience.","It was a really cool class to take in the context of the election.","You learn a lot \r\nbut may not be as easy as you think","exciting class, but may end up doing a lot of unnecessary papers instead of having meaningful discussions. lectures are exciting b\/c of the topic, but the professor may not always do the best job of presenting material in well-organized fashion","Don't go to lecture, just chill","Really interesting lectures, but there's a lot of material not really covered in class that you will be asked to remember for exams.","Great class to talk about the current election.","Helps if the election cycle is as interesting as 2016!","Be careful with this class, it's not as interesting as it seems and quite repetitive. Also the grading is horribly subjective depending on your tf and never normalized.","While it could definitely be taught better, this is a course you have to take when its offered.  Really cool topic, interesting section discussions, and engaging guest lectures.","The first half of the course is valuable, but it seemed that we were killing time in the second half.","Take this course. Even if you are international, like me, you will get SO much out of it. You will leave with knowledge that you will keep with you for the rest of your life.","This was an interesting class with great assignments and amazing guest lectures.","A very informative class with engaging lectures. Not very difficult, section was unnecessary though.","This class was great and I totally recommend it! Not too hard, workload isn't too bad. Make sure you go to lecture though, because recordings are not available to undergrads. Also don't worry toooooo much about readings - just get the jist. I learned so much from this class, and it's not just knowledge that I'll forget next week - it's applicable to the real world and important for every citizen to know.","Great course. No background necessary, just be interested in politics and you'll be golden. Assignments are fun, exams are fair. Only offered every 4 years so take it now!","Interesting, but a bit basic. Also, not really an easy course when it comes to grading.","This is a really fun and interesting class to take if you are pursuing Gov or just want to be more informed and up to date with our nation's current political system.","diaz didn't seem to give a shit after the first few lectures","The grading is ridiculous for such easy concepts. Read the news instead of taking this course.","The course seems very easy, but that is because there is an enormous aspect of theory in the class which is required to be completed through readings because it is not discussed in lecture or section.","The guest speakers are awesome and it's a great way to learn more about current events. It's not as easy as you may think, though, expect to put in work on the 2 papers, video, and exams. But if you do they will be rewarding. Also he says the readings are light but really there is a lot","Getting to study the presidential election during this year's cycle has been pretty cool. Definitely encouraged me to engage a bit more. Gained a solid historic background. The class in general trended in the wrong direction throughout the semester. Increasingly less organized and relevant. Felt like we ran out of things to talk about. Super low workload.","The course seems like it's going to be a lot better than it ends up being, and the TFs are a complete crapshoot. Some are excellent, some are awful. And some grade ridiculously hard especially considering the type of course this is. Felt pretty unfair overall.","This class covers come interesting material, but the workload is not light. Readings each week are long and sometimes hard to get through. The lectures are hit or miss as far as how interesting they are, and grading depends heavily on who your TF is.","I don't think this class is worth your time... maybe as a fifth class or something, but I really didn't learn all that much for the professor, which was a real bummer.  Bob White was interesting and I enjoyed discussions in section, but I didn't actually learn that much that I couldn't have with 3 hours and the internet.","Go learn how to become the President","Use the course as motivation to follow the election closely. Choose two or three publications that cover the election comprehensively (or subscribe to briefings\/newsletters), and commit to an hour of reading election news each morning before class. Understanding the major developments and candidates of the current election is the most useful tool you can use in answering the essays on the midterm and final.","This class was terrible.  For section I had an hour a week of awkward silence, and didn't want to be section kid who just answered all of my TFs stupid questions, like \"Who here -10 second pause- reads -10 more seconds- ya?\"  In class we spent an hour every class looking at the same polls on Real Clear Politics pretending that we were learning new information.","Read.","take it during an election year!","This is an interesting class, but if you are interested in politics and already knowledgeable about the electoral process it can be a bit tedious and repetitive.","The course - at first glance - seems like a breeze as well as interesting and engaging but its administration is bad enough to change your mind quickly.","Starts fascinating but goes somewhat downhill.","Really enjoyable class if you are interested in government","This class turned out to be a HUGE disappointment. I was so excited to take this class at the start of the semester--I thought there could not be a better way to learn about the election. Sure, lectures were interesting. But the enjoyment of lecture was completely overshadowed by the frustration that was grading in this course. I have heard people talk about subjective grading, but I have never had such a nit-picky, trivial grading experience in my life. The collaboration policy in this class is bizarre: basically not allowed. It totally takes away from the learning experience. The quality of TFs also varies widely.","Assignments are sometimes confusing, and lectures can sometimes drag on, but the guest speakers were amazing and the readings were very interesting","The lectures are really scatterbrained and unprepared. Professor could cover everything in one hour.","If you're looking for an easy gov class and willing to forgo learning very much, this is the class for you.","It definittely helps you keep up to date with the election, but it not the best taught class. I felt like i learnt most of the material when studying for the midterm and final and not throughout the class.","At the beginning, I thought I would really enjoy the course. The first few lectures were incredibly engaging and providing new and interesting information. But as the course went on, it got very repetitive and it felt like we were no longer learning. Though I didn't really mind the two-hour lectures at 7pm on a Monday as much as I thought it would! Professor Diaz made the time go by quite fast. The analysis of the current election cycle in lecture was definitely much-appreciated. The guests in lecture were incredible and gave us exclusive information from the Romney 2012 campaign, which was truly fascinating. The assignments weren't too difficult but required a lot of work. Readings were also pretty unnecessary, as long as you pay attention in lecture and section. Overall a pretty easy course that will really make you think about the current election.","If you really enjoy politics, you'll find this course remedial but possibly interesting. If you don't know anything about American politics, you'll probably get a lot out of this course. If you're the average American who finds politics somewhat interesting, this class will be far too long and repetitive--pick up the newspaper once a week and you'll learn just as much.","It was fun and really insightful for someone who once found government and politics intimidating. Made me interested in a gov secondary. Way too much work though.","Interesting class, especially the discussions on the current election, but pretty disorganized, especially as the semester went on. The guest speakers would often talk for way too long (in my opinion) and without any slides, so it was really hard to tell what the most important (and testable) takeaways were.","This is an awesome class, you learn a lot and have tons of fun doing it. The assignments are interesting and creative, but count for a lot of your grade so make sure you put in work!","SUPER interesting especially if you don't know anything about the election","It's really interesting but make sure you do the readings!","Don't take this class. Lecture is a farce and the assignments are graded incredibly hard. The tests were obscenely easy but I think my paper was tossed down a staircase and didn't fly far enough so was given a bad grade.","Make sure you have a good TF.","Its a lot of fun but also a descent amount of reading if you choose to do it. Im so glad i took it -- i really learned a lot about the election process. This class gives you a good life skill - critical thinking of elections around you.","This course provides great insight into the science of political campaigns and elections. It is only offered in presidential election years, so I strongly recommend you make the space in your schedule to take it when it is offered. The analysis provided of the current election makes this class that much more interesting.","Road to the White House was a very interesting course that exposed me to important theories in political science surrounding the presidential election. The readings were sometimes a lot and rather dense. Your TF can make or break the class as well.","This course is a cool concept but it is not executed well. It is likely because of the extreemly large class sizes.","If you love American politics then this course is definitely for you. You will learn a lot of the sublets about politics and gain some data but it is more the process and facts underpinning it that you will benefit from.","I think this is an awesome class to take, more so because the people are very knowledgeable and you can learn a lot from them! To be honest, two hours was a lot for me to sit through, but I think I learned a lot that I didn't know before about our political systems.","This is a great class, definitely try to keep up with the readings and have the ability to get the central argument from each one.","Not the best organized, big, and interesting.","This class is both very interesting and also very uninteresting. This year's class was interesting because of Mr. White, Mitt Romney's Chief Advisor who came in every lecture to contribute to the class, as well as just a fascinating election cycle to begin with. This class in isolation, however, was not that fun. Mr. Rosillo is a very standard professor, not boring but not exciting either.","If you are fairly knowledgable about the American election system, do not take this class. If you have no background on the American political system, do not take this class either. This class is boring, disorganized, and unfulfilling. Diaz makes no contribution to the class (you could learn the same content from a middle school teacher), besides bringing in an occasional semi-famous person to guest lecture when he's too famous to lecture. The readings are excessive and detailed, while section is painfully basic. Exam essay prompts are ridiculous (they ask multiple questions, don't really apply to the readings, etc). Even though this class is supposed to be \"easy\" (as in, you feel like you arent learning anything new ever), you'll still get a subpar grade because TFs are nitpicky. \r\n\r\nDon't be fooled.","This class seems interesting and like it will be very easy, but I tell you now, do not take this class. It is poorly structured, the grading is arbitrary, and I can honestly say I learned absolutely nothing from taking it. Read maybe 2 articles in the New York Times during the next election and you will learn more than you do in this class.","More work than it seems.","awesome class, quintessential!","Interesting and informative but you may be frustrated by the lack of organization with the course.","The most relevant class I have ever taken at this school. Finally a class that talks about things that are happening right now!","Don't believe the hype about this class. Starts off well but they run out of material to teach after a couple weeks. Diaz is uninspiring.","This is a great class to balance out your schedule. While I didn't feel like I learned anything new, it was nice having an excuse for keeping up with what was going on in the election trail. The assignments were interesting, although graded somewhat arbitrarily.","Gov 1359 was disappointing.  The course had a lot of potential to be a fascinating, educational and fun way to learn about the presidential election, but unfortunately it fell short.  Professor Diaz did not give effective lectures and the guest speakers were generally not as prominent and interesting as they could have been.  Still take this course if you want to learn more about our political system, but don't have too high expectations for what you want to get out of the course.","this class is really interesting if you want a crash course in how the presidential selection process works.","If you have a semi-decent understanding of American politics, this class will be a total waste of time for you. Only take this course if you're looking to gain a basic understanding of American politics.","Despite very poor organization and very simple topics taught during lecture, it did help me be more informed about election processes and updated about the current election. However, I was disappointed by what appeared to be a very small amount of preparation from the professors in lecture.","This class has super interesting material and can be very riveting and completely innovative, the only issue is really the size and the section, which sucked so much. But here is the DL: you do not need to do the readings, studying for the final is not the hardest thing to do. SICNE LECTURE SPENDS 30 MINS TALKING ABOUT POLLS AND 30 MINS WAITING FOR STUDENT PARTICIPATION THEN THERE IS NO POINT GOING TO LECTURE REALLY.","I would highly recommend this class!","This class is over-hyped and is not anything new that you could learn in the news.","I took this course as my fifth class senior spring, and never regretted it. Prof. Diaz is a wonderful teacher who brings great energy and enthusiasm to every lecture. Class was always fun, entertaining and informative - which is saying a lot considering it was 2 hour lecture on Monday nights. I would highly recommend you take this course. It's highly topical and you will never regret knowing this information.","The course started off really great, but quickly declined in terms of quality. The lectures and sections rarely went beyond the surface.","While no preparation for the course is necessary, a lot of gov concentrators take this class and have a lot of previous knowledge. There are a lot of readings to do every week. Assignments are time-consuming and long. Make sure you have a good TF. Try to stay on top of the readings (for the final, the professor provides a list of 200 IDs that come from lectures and readings that may appear on the final).","This class will teach you a lot about the electoral process and presidential campaigns.  Overall, it was worth it to take it, seeing as it is only offered every four years.  Great way to keep up with the current presidential campaigns.","This class is fun, interesting, and is directly applicable to your daily life. It is practical in that it helps you become a better, more informed citizen.","This class taught me a lot about the history of elections, and it was interesting to see how they've changed and evolved with time. The assignments were interesting (a ad campaign project and a memo) and the exams weren't too difficult. Post-midterm the class seemed a bit more disorganized and diluted in terms of material, but overall pretty interesting and decently low workload.","Not what I expected this class to be: barely talked about the election and didn't learn anything super interesting (especially after taking American Presidency the semester before). This class is a over-hyped, but he guest lecturers were definitely interesting!","Professor is not great, and he's a nitpicky grader\r\nMaterial pertaining to current election is super cool though","Make sure you follow current events; many essay questions on the exam assume some knowledge of current events.","This class is an awesome way to learn a general overview about elections. No Gov background needed.","Take this course if you really want to understand the complexities of our election system. It will be an easy class if you're interested in the election - this election was especially interesting, which made the class more fun.","This class has too many assignments for an elective. Lectures, particularly guest lectures, are stimulating and engaging--but most exam material comes from readings that are never reviewed in class. Take it if it's offered pass\/fail.","I came in with really high hopes and they certainly weren't met. Turned out to be an okay course, but nearly everyone I've spoken too grew less enthusiastic about it over the course of the semester.","Overall a super disappointing course. Wish I had not taken it. Lectures are frustrating because you learn so little and so many of us just wanted to understand the US presidential campaign system better.","Something like this is a really unique \"Harvard class\" that I would recommend to everyone who has the chance to take it. The class is not very hard but just challenging enough that is still a good class to devote time towards. The assignments and exams are very fair and the class is structured very well.","good class. lot of it is common sense, but you have to substantiate said common sense in essays with boring, empirical readings","It will force you to generally know what's going on with the presidential primaries, which can be pretty cool. Unfortunately, class is a waste of time and not run efficiently at all. You can pretty much learn everything in a lecture in five minutes.","The course has the potential to be great, but it isn't. Lectures are boring and hardly teach you anything. The timing of the lecture is not great, and the exams are graded way too harshly.","The course is a lot of fun. You only get one chance to take it at Harvard (offered once every four years), so go for it.","If you're interested in politics, this is a fun and interesting class, and it's only taught when there is an election in process, so it feels very relevant.","Definitely take this class if you are interested in hearing more about the current election! A fair amount of memorization but overall pretty straightforward course.","great course if don't know about government and the electoral college but it's not an easy course","This course features very exciting material (especially during current election years). Although we received some confusingly vague instructions about the major assignments (creating your own advertisement, writing a memo, etc.), the assignments were interesting and helped put the readings into context. Sometimes it was frustrating feeling like the professor had \"favorites\" in the class (so the same people were participating over and over again).","This class was interesting, but don't expect to cover a ton of material or dive to deeply. The fact that participation is encouraged in a 500 seat lecture hall should definitely be considered, because this often does not produce great lectures.","This class will help you be much more attuned to the political world and understand what is happening with a fairly high degree of knowledge. That said, the later lectures were quite repetitive\/boring and the assignments, though not challenging, were not particularly rewarding either. Several of them felt like busy work.","Interesting because it coincides with the election and keeps you up to date with the current events.","Road to the White House is a truly phenomenal class. It is only taught during election cycles so take advantage. It is fun to watch the current campaign from the beginning to the end of the semester with the insight you receive. The midterm and the final are difficult in terms of the massive amount of ID terms you need to know but that should not detract you.","Easy to take but also very intetesting","Not a good class if you want to learn gov, instead take gov 30 or the american presidency, mainly people are baited because it is offered every 4 years, but you don't learn much.","Take this if you can.","This is not an easy course. there is little workload, but it is extremely hard to get an A","RTWH is a great class, and I would recommend it to anyone. It's definitely not necessary or important to come into the class with a lot of prior knowledge as long as you keep up with the readings and attend lecture. It's a fascinating time to learn about presidential elections, and this class will make you a more well-informed citizen. It can be slightly dry at times as the course sometimes goes a little bit too deep, but on balance, I really enjoyed the class and would consider it a must take during an election year.","Beware of this class in that your experience can be very much influenced by your tf. hope you get a good one or your grades can suffer. lectures are rather long and just consists of reading of slides. guest lecturers are cool to listen to.","Fun class, easy, interesting","This course is a great opportunity. It is only offered once or twice every four years so if you are thinking about taking it take it. It is not hard and there is not a lot of work besides reading that is interesting. There are cool speakers and good lectures by the professors. If you are at all interested in politics take this class you will understand a lot more about the election.","Easy course but not the most stimulating","This class is essentially all fluff and no substance. There needs to be a more in depth exploration of the material as opposed to reading definition off of slides.  We discuss easy concepts many times and then are graded harshly based off of nitpicky details.  There is no midterm review or study sheet, so you're supposed to magically glean what is on the actual tests.  The assignments were cool but didn't really increase understanding of the material.","Although this class was slightly less structured than I would have liked it to be, it was very interesting and probably the most applicable-to-real-life class that I've taken in my entire life. I would recommend it because it really helps you keep up with the election on a weekly basis.","The class material is pretty basic so do not go into the class hoping to learn a lot about how campaigns are organized in great detail. Guest speakers were often interesting but overall the lectures were pretty boring.","Don't take this course if you already know about presidential elections.  The lectures can be extremely soporific.","This is a good class to take if you're interested in politics or find the presidential race exciting. The tests and assignments are a little bit more difficult than you'd expect, but overall pretty manageable","It provides a solid overview of election politics. If you don't know anything about this stuff and actually WANT to learn, then take this course. If you don't want to learn about it, you could take this course and not learn anything. So...if you actually want to learn, make sure you either go to lecture or do the readings. Neither matter that much for the exam. You can learn the terms before the exam and read the two books (scan them through for content) and be totally fine. But that's dumb if you actually want to learn about election politics, which everyone should know about because it's YOUR LIVES, PEOPLE. If you know something about election politics, you'll be bored 50% of the time and excited the other 50%--bored during the stuff you already know, excited during guest lectures and videos.","It is a fun class but to get an A, it does take a lot of work.","I would definitely take it if it was shortened to an hour and a half.","This is a great, low-stress course that legitimately engaged with real-world events. Lectures can be a little repetitive sometimes, but overall it's a really fun and informative way to gain a better understanding of the modern presidential election.","If the course is revamped with better organization, a clear curriculum grounded in political science theory and practice, I'd recommend it with enthusiasm. Unfortunately, given the logistically disorganized nature of the course, I recommend it with reservations.","It was a fun course but the fact that we were told not to take it pass fail because it would be easy and then having assignments graded harshly was very annoying.","assignments are so brutal, and lecture can get way too detailed on the most basic subjects. Like we would spend entire lectures on why people vote and debates and ads when it's all just common knowledge. You end up just memorizing the bullet points on the lecture slides because if you state opinions in your essays that aren't in the lecture slides you get brutal marks","Pretty easy gov class, if you've taken gov 30 you've learned most of it.","Class was boring. Section was useless. Tests were fine. Professor was not engaging and at times, I wondered if even he knew what he was saying. I valued the talks from the guest lecturers far more because at least I could trust to a great degree what they said.","a very good way to expand one's knowledge of the presidential election process and to keep up with the current election in an engaging manner","Don't take this class just looking for a gem, because many TFs grade unreasonably harshly. Lecture sucks, and oftentimes it's unclear what graders are looking for in exams or assignments. Interesting topics, but I learned more from following the election on the news than from taking this class.","This class is a fun and easy class but ultimately a bit of a waste of time. The first 6 weeks were great and I was very interested in the material. Then for some reason the class just lost momentum. Lecture became tedious. By the end, I felt that there was almost no reason to go to lecture as I wasn't really learning anything.","A solid class examining the path that candidates take in an effort to reach the White House and where most of them go wrong. Interesting speakers and topics. Not a ton of new material if you're already a US history\/politics guru, but still many engaging conversations and applications of that material.","This class was neat because there is nothing like it, and it is such a relevant topic. However, it is a really big class, which has its negatives as well. I really loved section (Mabel is a great section leader).  This class isn't very hard.  Sometimes it can be boring as the topics are fairly basic.  It did make me more interested in politics.","Very easy class that helps you understand what is going on in the presidential election.  Very informative in the first half but drops off in the second half of the semester.","This class is terrible. You will do very little work, learn almost nothing, and will consider every lecture to be a waste of your time and money. Do not be fooled, it is garbage.","The course gets less interesting and more repetitive as the semester goes on.","Don't confuse this for a gem. Although you can probably skate by without attending lectures or doing the readings, exams and assignments will be all the much more tedious and difficult as a result. Lectures are incredibly boring - Diaz is one of the most brutal lecturers I've ever had to endure. You don't really learn over the course of the semester - most of the material is either repetitive or just common sense. The only saving grace of Road to the White House is the fact that it's an easy 4th class. But I'd implore you to take something that requires a few more hours per week but that you can actually gain something from.","This course can be very frustrating at times because it is very very very disorganized. For instance, during the midterm they let people start before they had printed enough for other people. And it took me 3 weeks to get sectioned which is absolutely ridiculous.","this course covers interesting concepts and definitely encourages you to pay attention to the election, it can be a bit slow\/repetitive and little review is provided for the exams, definitely provides insight into the campaign process","Know that the grading can be abstract and may not reflect how well you understand material, but simply how much you can memorize (exams) and how well you can write (both exams and projects). Be smart and do the readings through the semester as doing so is rewarded on exams.","Pretty easy but not really very interesting.","Very interesting class. Taking it during an election makes the class much better.","Class is really boring but pretty laid back.","The class is a ton of fun. Do the readings and take notes during lecture.","Take this course. As a citizen of the US and gov concentrator, this course provides the most meaningful theories and analysis of something that's most relevant to our lives during an election year. The fact is that many of the courses we have in the gov department are theoretically and difficult to directly tie to current events. This course was by far one of my favorites because I came to understand the high level and details of a presidential campaign.","Interesting look into the detail of an election process.","During an interesting election and with little background in politics (applied or academic) this course was a great learning experience.  The content is interesting, but sometimes lectures could be a drag.  In fact, lectures were best when there was a guest, who could really shed some insight onto the campaign.","Take pass fail....grading is random"]}},"mostRecentQ":{"overall":"3.40","workload":"3.40","difficulty":null,"recommendation":"3.60","enrollment":"493","response rate":"79.11","QCourseOverall":{"number":"GOV 1359","course_id":"2227","cat_num":"125228","1s":"22","2s":"64","3s":"117","4s":"119","5s":"65"},"QDifficulty":{"number":"GOV 1359","course_id":"2227","cat_num":"0913","1s":"12","2s":"85","3s":"161","4s":"17","5s":"0"},"QWorkload":{"number":"GOV 1359","course_id":"2227","cat_num":"125228","1s":"129","2s":"193","3s":"15","4s":"3","5s":"1"}},"success":true}