{"scores":{"Spring '14":{"course_score":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":null,"response rate":null,"QCourseOverall":{"number":"GOV 94ek","course_id":"2165","cat_num":"13525","1s":"0","2s":"0","3s":"0","4s":"1","5s":"14"},"QDifficulty":{"number":"GOV 94ek","course_id":"2165","cat_num":"13525","1s":"0","2s":"5","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 94ek","course_id":"2165","cat_num":"13525","1s":"3","2s":"12","3s":"0","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.93","workload":"1.80","difficulty":"2.67","recommendation":"4.93","enrollment":"16","response rate":"93.75","QCourseOverall":{"number":"GOV 94ek","course_id":"2165","cat_num":"13525","1s":"0","2s":"0","3s":"0","4s":"1","5s":"14"},"QDifficulty":{"number":"GOV 94ek","course_id":"2165","cat_num":"13525","1s":"0","2s":"5","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 94ek","course_id":"2165","cat_num":"13525","1s":"3","2s":"12","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 94ek","cat_num":"13525","course_id":"2165","year":"2012","term":"1","id":"d24f777730b7e5c8ba21808f769dd1ab","first":"Michael J.","last":"Hiscox","InstructorOverall":"4.93","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.77","ReturnsAssignmentsinTimelyFashion":"4.77"}]}},"comments":{"Fall '12":{"comments":["This is one of the best courses at Harvard, for sure. If you have the chance to take it, don't pass it up!","This is truly a great course! Professor Hiscox is a wonderful professor that is very knowledgeable in his field and is very approachable (go to his office hours!!) He helps create an environment conducive to great conversations in section. The course overall is very relevant to our everyday lives and at the end of the course you're left with a sense of accomplishment and a more hopeful vision of the world that individuals can make a difference.","This is truly the best class that i have taken here. Professor Hiscox is brilliant and clearly knows what hes talking about, especially as he has actual experience in private governance and advising private companies. Class is amazing because it will be filled with enthusiastic students. Only issue is that the research paper really creeped up on me--do research early and start writing early as well.","Best class I have taken at Harvard! I would take it again it I could. Work load in manageable, material is very interesting... Just make sure to figure out your research topic early and work with the prof. to get all the details nailed down, the deadline can creep up on you.","Take this class! Professor Hiscox is amazing! The class is incredibly interesting, and it's one of those classes where you genuinely want to do the readings and where you learn plenty of useful, interesting and applicable information. If you may be remotely interested in the subject, hands down, take this class. You won't regret it. The workload is perfectly manageable, and you get the opportunity to work on your own research project (and get a lot out of it).","Prof. Hiscox is one of the most down-to-earth, knowledgeable professors at Harvard and he teaches the COOLEST course in the Government department. Where else can you talk about Fair Trade labels, CSR, and private governance issues? Probably the Business School, but this isn't a bad substitute at all. Take it! You'll learn a ton and love yourself for it!","Professor Hiscox is great, and the course is a very interesting look at private governance (something that most of the government department doesn't even look at).","This is an incredible course.  Professor Hiscox is really great, and he will get excited about whatever research you decide to do.  It is useful to go into the course with an idea of what you want to write a research paper about.","This class is great! I came in not knowing a lot about the subject matter, but that made no difference, and I have walked away with a new perspective on so many different issues regarding ethical consumerism and private governance. Professor Hiscox is wonderful and he really makes the entire experience extremely enjoyable. The assignments are manageable, and he never asks you to read anything or do any assignments that are not worthwhile. Overall a terrific class!","This is a wonderful class to expand your thinking about the ethics and practice of global trade. Prof Hiscox is awesome, so helpful and available and really passionate about the material. Engage yourself in the material and start early on the final project!","Be sure to keep an eye out for final research topics early.","This course is one of the best I've taken at Harvard. I came into this class knowing absolutely nothing about corporate social responsibility, fair trade, etc. and left at a totally different state of awareness. The material can be dense, but it's extremely interesting and Professor Hiscox is just pure awesomeness.","This was a great course and I would recommend to anyone who is interested in human rights, business, or globalization generally! There are so much directions you could go in with the research and the material is all interesting.","This is an awesome class! It's super interesting, and Professor Hiscox will help you come up with a really cool project to do at the end of the semester.  You will learn a lot about international trade, certification schemes and private governance."]}},"mostRecentQ":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":null,"response rate":null,"QCourseOverall":{"number":"GOV 94ek","course_id":"2165","cat_num":"13525","1s":"0","2s":"0","3s":"0","4s":"1","5s":"14"},"QDifficulty":{"number":"GOV 94ek","course_id":"2165","cat_num":"13525","1s":"0","2s":"5","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 94ek","course_id":"2165","cat_num":"13525","1s":"3","2s":"12","3s":"0","4s":"0","5s":"0"}},"success":true}