{"scores":{"Fall '12":{"course_score":{"overall":"4.82","workload":"2.55","difficulty":"3.45","recommendation":"4.82","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"GOV 94zg","course_id":"2192","cat_num":"96589","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":"GOV 94zg","course_id":"2192","cat_num":"96589","1s":"0","2s":"0","3s":"6","4s":"5","5s":"0"},"QWorkload":{"number":"GOV 94zg","course_id":"2192","cat_num":"96589","1s":"0","2s":"6","3s":"4","4s":"1","5s":"0"}}}},"comments":{"Fall '12":{"comments":["Janet Lewis is incredible! Really cares about her students. Also helps improve your writing. Lots of reading, but worth it.","Great class if you are interested in ethnic conflict and want to getter a better sense of the topic. Particularly useful in that it reveals a number of different ways that one could study ethnic violence.","This is an amazing course if you are interested in ethnic conflict and would like to engage in in-depth and insightful conversations about the subject...Janet is one of the best professors I've had at Harvard so far.","Amazing professor. Really interesting material. I would definitely recommend it!","This is an excellent class for anyone who is thinking of writing a thesis (even if you''re not... it's awesome and you should still take it). It's focused on research design and really teaches you how you should be thinking about research. The readings are really interesting and manageable, the expectations for written work are very clear, and the feedback is very specific and helpful. Dr. Lewis is also available if you ever need help with anything.  If none of those reasons are compelling... take it because ethnic conflict is a really interesting area and Dr. Lewis runs a great discussion.","This class is great! Janet (the professor) is fair, knowledgable, kind, and willing to help her students succeed. The discussions were always interesting and the two hours flew by every week. This is obvious, but don't leave the paper until the last minute or even the last week. Push yourself to get big parts of it done early on so you can really get the most out of the course.","This course will teach you each step of the research process, from preliminary research into case countries to the editing stages of your paper. If you are thinking of writing a thesis, especially on issues related to ethnicity and politics, definitely take this class!","Great course.  Highly recommend this if you can, no matter what background you come from.  A lot of the assignment are tailored for juniors considering writing a gov thesis (it is technically a junior seminar), but it is a great class for seniors also.","Janet does a great job of generating enthusiasm for the course. She can be a bit of a tough grader on stylistic and other points, but generally she is fair and the course is well worth the time if you're interested in further research in the areas of ethnicity, ethnic politics, conflict, or nationalism.","This course is an amazing way to deepen your own interest in a specific region while getting a thorough background of the different aspects of ethnic conflict. The readings are interesting and the discussions are very engaging."]}},"mostRecentQ":{"overall":"4.82","workload":"2.55","difficulty":"3.45","recommendation":"4.82","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"GOV 94zg","course_id":"2192","cat_num":"96589","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":"GOV 94zg","course_id":"2192","cat_num":"96589","1s":"0","2s":"0","3s":"6","4s":"5","5s":"0"},"QWorkload":{"number":"GOV 94zg","course_id":"2192","cat_num":"96589","1s":"0","2s":"6","3s":"4","4s":"1","5s":"0"}},"success":true}