{"scores":{"Spring '13":{"course_score":{"overall":"4.78","workload":"2.00","difficulty":"2.89","recommendation":"4.67","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"0","2s":"2","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"2","2s":"5","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"E-PSCI 182","cat_num":"37284","course_id":"686","year":"2012","term":"2","id":"8a4ac6a48a5c5f3b9ca80a05df5ef9b4","first":" Francis Alexander","last":"Macdonald","InstructorOverall":"4.56","EffectiveLecturesorPresentations":"4.56","AccessibleOutsideClass":"4.44","GeneratesEnthusiasm":"4.56","FacilitatesDiscussionEncouragesParticipation":"4.75","GivesUsefulFeedback":"4.38","ReturnsAssignmentsinTimelyFashion":"4.14"}]},"Spring '12":{"course_score":{"overall":"5.00","workload":"2.00","difficulty":"3.17","recommendation":"5.00","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"0","2s":"2","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"2","2s":"5","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"E-PSCI 182","cat_num":"37284","course_id":"686","year":"2011","term":"2","id":"8a4ac6a48a5c5f3b9ca80a05df5ef9b4","first":"Francis Alexander","last":"Macdonald","InstructorOverall":"4.92","EffectiveLecturesorPresentations":"4.75","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.83","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '10":{"course_score":{"overall":"4.00","workload":"2.90","difficulty":"3.40","recommendation":"4.30","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"0","2s":"2","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"2","2s":"5","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Spring '10":{"comments":["It was probably my hardest class and most time-consuming class, but also my favorite.  It was fun, interesting, had a great group of people and a really supportive professor and TF.  And the field trip was amazing of course.","This class was a bit disorganized the first time it was taught but I'm sure that will improve with time. Francis is an enthusiastic lecturer who really knows what he is talking about. The field trips are an amazing experience, because seeing geology in the field is very different from seeing it in a classroom.","I would be hesitant to recommend this class because of the general lack of organization and difficulty in following lectures. The professor is very enthusiastic; this could be an absolutely stellar class in the future, but the professor needs to put substantial thought and effort into the course material before this can happen. I loved how firmly grounded this course is in developing field work skills. Many classes in the EPS department are abstracted from real field skills, and I think it's really wonderful to have a course that can help fill this mostly-empty niche. The focus on field skills is yet another reason why this could be a great class, but I think it requires some more work first.","This course is an excellent and broad survey of sedimentatology","Be prepared to spend a lot of time on this class, but it's completely worth it! It's not too hard, you just need to put in the work.","This class has very interesting topics and great field trips.  The professor is enthusiastic and knowledgeable.  Make sure you ask enough question to make sure things are clear for you.","This is a new course, so you have to excuse any roughness around the edges. The teachers are good and the section leader is at least funny sometimes. If you enjoy learning about earth processes and how they can tell you about earth or rather environmental history---and if you like Italian food and culture---this is the course to for you! Show some committment though and don't take the course just to get a free trip to Italy! It'll be work, but it'll be fun work!"]},"Spring '12":{"comments":["This is a great class! If you are an EPS concentrator I would say this is a must because you learn so much and it really cements your geologic knowledge filling in many of the gaps that were created by introductory classes.","one of the essential EPS courses to anyone looking to pursue geology beyond undergrad but also a great class to take for anyone interested in geology. very interesting material. practical assignments. great field trip.","Great class, don't be intimidated by the topics or the subject, totally worth it.","Great survey of sed\/strat. I only wish I had taken it earlier. \r\nA good way to learn sed processes and how to interpret with strat.","This is a really good class that teaches a lot about sedimentary rocks and geologic processes in sedimentary environments.","This class is a lot of fun and has an amazing field trip to Italy. That being said you should only take it if you really like geology and find rocks fascinating. The class definitely has a learning curve but Francis and Justin are both great teachers.","italy was, like, the best week (!!!!)","This class was incredibly interesting and I learned such a lot. It wasn't easy but the workload was very manageable- labs were almost always completed withing lab time - but picked up towards the end of semester with longer assignments and the field trip paper to write up. The Italy trip is incredible, but don't take the class purely for that. Francis is an inspiring teacher and is really invested in his teaching and the subject material.","Great teachers, very interesting material, and awesome field trips.","This course is incredibly broad. We cover everything from intra-bed structures to basin analysis. In one class and one semester, it's a lot of information, but immediately applicable to any fieldwork and relatively easy to stay on top of.","This is a very entertaining course"]},"Spring '13":{"comments":["Are you interested in geology? or are you MEGA ULTRA SUPER interested in geology. Take this class in that case. It is small so you form a nice tight knit group with the professor and the other students.","One of my favorite classes - very well taught with interesting subject matter. Hands-on field work is an excellent component of this course and you learn so much.","This was by far one of my favorite classes at Harvard. If you're someone who learns better by doing than seeing and is interested in the processes of the Earth this is the class for you.","Great class that you learn a lot in! Labs are your homeworks each week, one midterm, one final paper about the field trip (TO SICILY), one final. Francis is great.","If you want to go into industry as a geologist, you need this class. Well, any geologist needs it, really, but, particularly, an industry geologist that doesn't have sedimentology is generally an unemployed geologist. It's fun - the trip to Sicily was amazing. The material itself can get dry, but the interpretations you can make from it are far-reaching and useful.","SedStrat is a phenomenal overview course! It covers really interesting material, and Francis and Emmy are great teachers. That being said, don't take this class just for the field trips. There is still a lot of geology to learn, and the more you are willing to put into this class, the more you get out of it at the end."]}},"mostRecentQ":{"overall":"4.78","workload":"2.00","difficulty":"2.89","recommendation":"4.67","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"0","2s":"2","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"E-PSCI 182","course_id":"686","cat_num":"37284","1s":"2","2s":"5","3s":"2","4s":"0","5s":"0"}},"success":true}