{"scores":{"Spring '13":{"course_score":{"overall":"4.82","workload":"1.27","difficulty":"1.73","recommendation":"4.91","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"6","2s":"2","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"8","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 34z","cat_num":"97712","course_id":"1835","year":"2012","term":"2","id":"a8cdcade3f0696e038669e6d336f9a17","first":" Zachary","last":"Sifuentes","InstructorOverall":"4.73","EffectiveLecturesorPresentations":"4.67","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.91","FacilitatesDiscussionEncouragesParticipation":"4.78","GivesUsefulFeedback":"4.44","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '12":{"course_score":{"overall":"4.82","workload":"1.00","difficulty":"1.18","recommendation":"4.90","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"6","2s":"2","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"8","2s":"3","3s":"0","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"4.92","workload":"1.50","difficulty":"1.75","recommendation":"4.92","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"6","2s":"2","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"8","2s":"3","3s":"0","4s":"0","5s":"0"}}},"Spring '10":{"course_score":{"overall":"4.58","workload":"1.17","difficulty":"1.67","recommendation":"4.92","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"6","2s":"2","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"8","2s":"3","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Spring '10":{"comments":["It's an easy ride, but there's a surprising amount of depth to it. If you take it sriously, be warned that most of your classmates won't. Also, expect to have to show up for longish blocks of time outside of class, but you likely won't need to show up for class every day. It's really flexible, fun and at least two thirds of your classmates won't take things seriously.","This freshman seminar is really fun and interesting, and it's great to have the final projects to take home and keep.  Especially in the spring of freshman year when you're likely to be getting into a much more rigorous academic schedule, this course is a nice way to balance out your workload since it only requires a few hours of work each week -- and most of this work is just during the class hours anyways.  Definitely recommend this class for a fun, different, hands-on experience!","If you're looking for a fun class that's totally different from every other class you'll take (unless you're a VES concentrator), this is the class for you.","This is a great class if you're interested in taking a break from lectures and written work and want to explore hands on projects.","This class provides a comfortable environment to try something new and different from the traditional Harvard class.","Great class! You really get as much out of it as you put in. This is a fantastic freshman seminar--all of the work is artistic\/creative, so you really get to relax and explore. I highly recommend you take this!","You should definitely take this seminar. Zac's the best and it's super low stress and a lot of fun.","If you wish to take this course, come with an open mind, a willingness to learn, and the courage to jump in and be adventurous with the course! Overcoming the fears embedded in the risks of art-making is important too. Also know that Zachary is one of the greatest instructors ever! He will guide you in the right direction, yet allow you the imaginative freedom to create whatever your heart desires. And learning from him about the importance of turning mistakes into opportunities for success has changed both my approach to art & school, but also my outlook on life. This class is amazing!"]},"Spring '11":{"comments":["I would highly recommend this course. Zachary is AWESOME, and I was able to become good friends with a number of people in the class. For those who enjoy the arts, this course is a great way for you to make art without feeling guilty that you aren't spending your time studying. You learn everything from the thought process behind the art to the inner workings of exhibition. The class stretches your creativity and allows you to create some pretty neat works of art.","It's a great class, and you should take it if you're genuinely curious about and\/or interested in art. It's shown me a side of art I haven't really seen before, and I really found it interesting. It also forces you to make time for art during the academic year, which is nice if you don't get to do it otherwise.","I loved this seminar! Zachary is very down-to-earth and what we do in this seminar is absolutely amazing.","It great if you want a stress free environment. This class teaches you how to teach outside of the box and take your own initiative. Also, the exercises are enriching because you have an actual product you can take back with you.","Zachary is a phenomenal instructor, and he certainly succeeds in creating a stress-free art-making environment for the artistically inclined of all backgrounds. You do not need to have a background in the arts to take this course; I, myself, was pleasantly surprised by the things I could create thanks to Zachary's guidance. On top of it, you get to have an extremely cool exhibit in Adams Art Space at the end of the year, as a part of the Arts First weekend. I enthusiastically recommend you to take this course.","This course is absolutely fantastic, but don't just take it if you're looking for an easy class. There isn't a lot of work, but it isn't worth taking unless you really enjoy it.","Where else can you play around with 150 year old printing presses? The course is a lot of fun. I recommend speaking with Zachary before you apply to the course, if for nothing else than to find out what exactly is on the syllabus for the year.\r\n\r\nThe art fair at the end is a lot of fun.","This is one of the best freshman seminar programs. The projects that you engage in are not only unavailable elsewhere, but teach you so much about yourself. It has been one of the most fun, engaging, and inspiring classes I have taken. Also, you get to set up an exhibit of your work at the end.","Come in with no expectations.  Would blow your expectations away anyways. Don't bother.","I loved the projects we did for this course! Learning how to use the letterpress was amazing! I also appreciated that Zachary taught us to just dive in and learn by doing. He treated us like true artists and really believed in our visions. Zachary Sifuentes is the most amazing person I have met at Harvard thus far. The gallery showing at the end was just the icing on the cake :).","fantastic experience - worth every minute. There should be many more classes like this."]},"Spring '12":{"comments":["What did I like about this course?\r\n\r\nEverything:\r\n\r\n1. The experiential learning component - we were taught not to follow the rules, to explore and to treat normal objects and normal perspectives as things to alter and things to craft in our own mind's eye. It truly allowed us to be creative. It allowed me to explore different mediums of craft - such as using ink for photographic slide shows - not just for regimented activities scheduled in over the year. It helped me further my discovery of a passion I never knew I had - namely, art.\r\n\r\n2. Zachary's incredible dedication to our experience. He truly cared for us and made sure that we were not only safe but also having FUN. \r\n\r\n3. The fact that there was NO PRESSURE to create. By giving us all breathing room, this class allowed us to unwind and really explore and extend and push our creative boundaries. We discovered things about ourselves and others. We inspired each other by the artwork we saw each other try. \r\n\r\n4. Zachary never criticized. If he wanted us to do something other than what we thought was best, he was usually very, very right. For example, when I tried to simply peel off tape from a piece I made, he stopped me - though I was a little unsure, I came to see that he was indeed very right. The resulting piece that he preserved was a magnitude better than before. His encouragement and guidance is truly amazing.\r\n\r\nBasically, if you want to unwind for six hours a week, to explore your passion or unknown passion for art, TAKE THIS COURSE. It was honestly the highlight of my year. You will not be disappointed. I am not. I now am very seriously considering courses in VES (maybe a secondary if I get to it) simply because I feel almost that this class helped me reveal a passion of mine that I NEVER EVER knew I had. \r\n\r\nAlso, take this course if you are genuinely interested in experiential learning. Make sure you're willing to put in the creative effort. If you're looking simply for an easy course - well, yes this is an easy course - but don't take it for that reason. Leave the spot for someone else who's life my very well be changed by this small inspiration six hours a week. \r\n\r\nIf you are genuinely interested, PLEASE APPLY. And when you get it, be the happiest person ever. Because you'll have the best time evah.","This course is a great respite from a heavy or stressful course load; it helped me relax in the middle of three depressing, reading-heavy classes and I'm so glad I took it.  There's very little homework, though you will get 24\/7 access to the press to work on assignments whenever you want.  Zach (professor spring 2012) is funny, smart, creative, and super supportive.  You'll need some attention to detail and a lot of patience, but the best thing you can bring to the table is willingness to try new things.","Best class of my year.","If you like the idea of taking a class that is completely different than anything else offered at Harvard, take this one!! It requires very little outside of class work, but has big pay-offs in terms of your ability to your hand at a skilled art.","Greatest class at Harvard. Lots of fun, get to know peers, get creative, learn. Take risks without fear of graded assignments, remember that learning is fun. Try something new and express yourself. Learn to explore and enjoy the process.","This is a great class to relax and enjoy making art. It's a wonderful opportunity to work with materials and machines of a dying art form! Take this class if you like being creative, are looking to relax a bit, and are very self-driven! and Zachary Sifuentes is awesome!","This is the best class you will ever take. You will look forward to going to it every time. The hours you are in the printing press room fly by and, before you know it, class is over (and you don't want to leave). You can come in after hours to finish a project if you are so inclined. This is a great class to add to your schedule, especially if you're taking three hard classes and you need a break from it all just to enjoy yourself finally. The class will challenge you artistically and make you a more creative and productive human being. I cannot rave about this class enough.","it's so fun--take it!","Take this course! Don't pass up this incredible opportunity. Even if you haven't taken art since second grade and consider yourself the least creative person in the world, try it. People with all degrees of artistic experience and talent are made to feel welcome."]},"Spring '13":{"comments":["This is an amazing course! It was really a one-of-a kind experience to use letters to make art and to organize a group exhibition at the end, during the arts first.","This course is literally a life-changing experience. Learning the skills of a dying art form is just the beginning; I now go about my day more aware of the interactions of the human world with the written word around us. Talking with Zachary is an eye-opening experience, regardless of the topic of conversation, and all the more so if the topic at hand is art, words, poetry, or the human experience in general. In short, take this class. It'll change you for the better.","this was by far my favorite class i took this semester, it was a great way to meet and work with other freshman in a fun environment","This is one of the best classes you can take at Harvard. Learning how to use a printing press, working with Zachary to create incredible art, you begin to see how something small or simple can be transformed into something incredible. You'll remember this course forever, and--perhaps--find a new love for both printmaking as well as art, in general.","Make something cool, seriously, do it.","This class was an amazing outlet for creativity during the semester.  This class kept me sane - taking it was one of the best decisions of my semester.","This freshman seminar was fun and mind-expanding in that it forced us to think creatively on a regular basis. It was a good balance for some of my more memorization-heavy classes.","really fun!"]}},"mostRecentQ":{"overall":"4.82","workload":"1.27","difficulty":"1.73","recommendation":"4.91","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"6","2s":"2","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 34z","course_id":"1835","cat_num":"97712","1s":"8","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}