{"scores":{"Fall '15":{"course_score":{"overall":"5.00","workload":"5.50","difficulty":null,"recommendation":"5.00","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"},"QDifficulty":{"number":"HEB 1335","course_id":"2725","cat_num":"32284","1s":"0","2s":"1","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1335","cat_num":"126512","course_id":"2725","year":"2015","term":"1","id":"5e5f8e0c91b337ba4f1b2797daf31688","first":" Zarin Pearl","last":"Machanda","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '14":{"course_score":{"overall":"4.90","workload":"2.10","difficulty":"3.00","recommendation":"4.90","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"},"QDifficulty":{"number":"HEB 1335","course_id":"2725","cat_num":"32284","1s":"0","2s":"1","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1335","cat_num":"32284","course_id":"2725","year":"2013","term":"2","id":"5e5f8e0c91b337ba4f1b2797daf31688","first":" Zarin Pearl","last":"Machanda","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Spring '12":{"course_score":{"overall":"4.80","workload":"2.60","difficulty":"2.90","recommendation":"4.80","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"},"QDifficulty":{"number":"HEB 1335","course_id":"2725","cat_num":"32284","1s":"0","2s":"1","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1335","cat_num":"32284","course_id":"2725","year":"2011","term":"2","id":"5e5f8e0c91b337ba4f1b2797daf31688","first":"Zarin Pearl","last":"Machanda","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Spring '10":{"course_score":{"overall":"5.00","workload":"1.86","difficulty":"3.14","recommendation":"4.86","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"},"QDifficulty":{"number":"HEB 1335","course_id":"2725","cat_num":"32284","1s":"0","2s":"1","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Spring '10":{"comments":["Have fun!","This class is AWESOME if you love chimpanzees\/primates. It's a great opportunity to delve into the various topics in the field of primatology.","If you are at all interested in chimpanzee behavior and human evolution then this course is a perfect recommendation.","One the best classes I've taken at Harvard.","To stay on top of the reading because it's interesting."]},"Spring '12":{"comments":["One of my favourite classes that I've taken here. The discussions are always fun and easy to take part in. It's about 50 pages of reading a week, so usually not a huge amount of work. Zarin is totally amazing. Highly recommend it for any HEB students or people who like learning about primates.","If you're interested in chimpanzee behavior, you should definitely take this class! Even if you're not sure you're interested in chimpanzees specifically, the class is a great way to learn the ropes of behavioral ecology research and how to evaluate scientific literature. It's a fantastic overview of chimpanzee behavioral ecology, with the right amount of breadth and depth, and without too much work. There's a lot of freedom to pursue your specific interests in terms of the final paper. Zarin is absolutely fantastic and really cares about her students.","This class is really fun and interesting! You will learn really cool things about chimpanzees that you can probably apply to your own life.","You should take this course if you really like chimps because otherwise, it could get tiresome.","loved the class! seriously considering getting involved in primate research","If you are at all interested in primates or chimpanzees, take this class! The professor is really passionate about the subject and she studies chimps in the wild, so she has amazing stories to tell and lessons to teach."]},"Spring '14":{"comments":["This seminar is a lot of fun, particularly because it allows you to dive really deep into a pretty specific topic. Zarin makes the class environment really fun and comfortable, so that everyone is free to share their ideas and ask questions. The readings focused on one topic each week (ranging, cognition\/communication, etc.) and presented multiple perspectives from different authors and field sites, so we were encouraged to formulate our own opinions and look at differences between field sites. I feel like I learned so much not only about chimpanzees but also about how to read and critique scientific papers. The discussions were great, and we also got to watch some amazing chimp videos and hear about Zarin's field experiences. Besides the weekly readings, the main assignment was the final paper, where we had a choice of doing a literature review or data analysis project on a topic of our choice--I found it really fun and challenging. I'd highly recommend this course for anyone interested in primates or just looking for a fun HEB elective!","I originally took this class to fill a concentration requirement and was very worried that I wouldn't enjoy it as I've never been particularly interested in non-human primates. However, this ended up being one of my favorite classes I've taken at Harvard. The material in genuinely interesting. The film clips and Zarin's stories from the field also help to contextualize and engage you in the readings and discussion. Do the readings, engage with them. Learn as much as you can from the data assignments. I was unfamiliar with excel and learned so much for the experience! Choose a final paper topic that you can really engage with and talk to Zarin! She's so nice and is incredibly willing to help students.","This course requires a lot of reading and critical thinking. I recommend it without reservation.","One of my favorite classes I've taken at Harvard!","Prepare for a wonderful in depth look at chimpanzees. The readings are reasonable in length and the assignments are fun. Discussion is enjoyable for the entirety of the three hours, which is hard to achieve.","The three hour section can be rough. It is a long time to be sitting in class, but seminar is usually very engaging. Do your readings thoroughly and consider flaws in each paper.","I should have taken this class sooner! It is an amazing class, not only for learning about the topic (chimps and social ecology), but also to learn how to critically assess material, get a view to the politics of science and apply Excel skills."]},"Fall '15":{"comments":["This class is amazing. It is all about chimpanzees (of course) and it never fails to be interesting. Zarin is amazing, one of the most caring and dedicated teachers at Harvard. Definitely my favorite HEB class yet, and probably favorite class at Harvard so far. It's a lot of work, and the final paper is daunting, but it is extremely rewarding and doable.","It's a lot of work, but it's worth it.","Zarin is by far one of the coolest and most interesting professors I have ever had. This class is incredibly well run, and if you like primates (and chimpanzees in particular) then you will love this class. If I could take it again, I would.","This class is pretty awesome if you're into chimpanzees and primate behavior. The discussions in seminar are interesting and relaxed. You also learn a lot of practical excel skills from the assignments. There is a bit of reading every week but the papers are usually interesting. Zarin's also really chill and awesome. You get to hear a lot of funny stories from the field too. Take this course!"]}},"mostRecentQ":{"overall":"5.00","workload":"5.50","difficulty":null,"recommendation":"5.00","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"},"QDifficulty":{"number":"HEB 1335","course_id":"2725","cat_num":"32284","1s":"0","2s":"1","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"HEB 1335","course_id":"2725","cat_num":"126512","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"success":true}