{"scores":{"Spring '17":{"course_score":{"overall":"4.00","workload":"6.30","difficulty":null,"recommendation":"3.70","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QDifficulty":{"number":"HIST 2450","course_id":"2492","cat_num":"91462","1s":"0","2s":"3","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"1","3s":"3","4s":"0","5s":"1"}},"instructor_scores":[{"number":"HIST 2450","cat_num":"126559","course_id":"2492","year":"2016","term":"2","id":"3804daf994f51800346bfd8412ef5da4","first":" Julie A.","last":"Reuben","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.30"}]},"Spring '16":{"course_score":{"overall":"4.00","workload":"9.80","difficulty":null,"recommendation":"4.20","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QDifficulty":{"number":"HIST 2450","course_id":"2492","cat_num":"91462","1s":"0","2s":"3","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"1","3s":"3","4s":"0","5s":"1"}},"instructor_scores":[{"number":"HIST 2450","cat_num":"126559","course_id":"2492","year":"2015","term":"2","id":"3804daf994f51800346bfd8412ef5da4","first":" Julie A.","last":"Reuben","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '15":{"course_score":{"overall":"4.20","workload":"7.40","difficulty":null,"recommendation":"4.00","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QDifficulty":{"number":"HIST 2450","course_id":"2492","cat_num":"91462","1s":"0","2s":"3","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"1","3s":"3","4s":"0","5s":"1"}},"instructor_scores":[{"number":"HIST 2450","cat_num":"126559","course_id":"2492","year":"2014","term":"2","id":"3804daf994f51800346bfd8412ef5da4","first":" Julie A.","last":"Reuben","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Fall '13":{"course_score":{"overall":"4.10","workload":"2.20","difficulty":"2.80","recommendation":"4.00","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QDifficulty":{"number":"HIST 2450","course_id":"2492","cat_num":"91462","1s":"0","2s":"3","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"1","3s":"3","4s":"0","5s":"1"}}},"Spring '12":{"course_score":{"overall":"4.86","workload":"2.33","difficulty":"3.00","recommendation":"4.83","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QDifficulty":{"number":"HIST 2450","course_id":"2492","cat_num":"91462","1s":"0","2s":"3","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"1","3s":"3","4s":"0","5s":"1"}}},"Fall '10":{"course_score":{"overall":"4.40","workload":"2.20","difficulty":"3.00","recommendation":"4.40","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QDifficulty":{"number":"HIST 2450","course_id":"2492","cat_num":"91462","1s":"0","2s":"3","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"1","3s":"3","4s":"0","5s":"1"}}}},"comments":{"Fall '10":{"comments":["This was a truly illuminating course, both with respect to the history of education in America and aspects of American culture and history more generally. I learned how to critically engage with American history in an entirely new way, particularly with topics relating to civil rights and Southern culture, which were a much larger focus of the course than I'd initially expected. A fun class that provides much insight into the nature of the contemporary education debate. Thanks for a great semester, Julie!","this class is a more than a survey, it is exciting and thought provoking."]},"Spring '12":{"comments":["Take this course!!! It is not by ANY MEANS your generic history of education course. Julie carefully chooses course material and does an amazing job guiding discussion.  You will NOT feel intimidated as an undergraduate.  Julie is always there if you need her and is just a wonderful resource in general.  Really, if you're studying education, you must take this class.  You won't be bored, either by the readings or Julie's way of leading class.","This is an excellent course for anyone with even a passing interest in education. The reading list is filled with fascinating books on different aspects of education from deaf students to antebellum African American students in New Haven to teachers union strikes in New York City in the 1960s. Issues of race, class, gender, and ability are central themes. \r\n\r\nThe book reviews were useful to thinking about the core issues in the books and easy to do. The research paper was manageable and you have complete freedom in topic choice. \r\n\r\nJulie is a fair grader and an excellent professor. She managed discussions very effectively and mixed in her expert knowledge through short lectures. She's masterful at transitioning between themes in the book discussions and I never felt off-track in our discussions.\r\n\r\nClass was about 1\/3 book discussion, 1\/3 lecture on the context for the books, 1\/3 video or primary source discussion. As a result, the class culture was engaged and thoughtful. The mix of Harvard social studies students and Ed school students made for an enjoyable diversity of interests. \r\n\r\nThis course is a real treasure.","Professor Reuben is a wonderful teacher and discussion facilitator. The books we read are interesting and thought-provoking yet approachable for someone with little to no experience in the subjects. If the name of the course at all interests you, you should definitely check it out!","This is a great class.","This is an awesome class. You cover a large span of time and many topics, yet it feels cohesive and thorough. Prof. Reuben is excellent - very knowledgeable and intelligent while facilitating group discussion and in-depth thinking about history, education, and the intersection of the two. The assignments are fair and quite open. It's nice to be in a class with members from different parts of the university.","Great discussion and informative readings. Also, the final paper is due mid-semester, which frees up finals period a lot!"]},"Fall '13":{"comments":["This class is awesome. I took this class as an elective and it was my favorite class taken at Harvard thus far. The discussions are interesting and engaging, and the material is fascinating, regardless of whether or not you have a prior interest in education and its history.","Amazing class! If you have any interest in American educational issues, a must take.","The readings are very heavy but the assignments are easy and discussion and collaboration with grad students is insightful.","If you are interested in the topic of education in the US, and haven't taken any courses about it yet, this course can provide a good understanding of its history and the debates that have shaped its development. There is a very broad range of topics covered so you will learn a lot. It is also nice to be mixed with grads and undergrads--provides a mix of perspectives and experiences.","This class goes through SO much material, but it's SO worth it. The depth of the topics involved is just incredible. Professor Reuben is incredibly knowledgeable about the subjects involved, being a historian herself - her experience with this field makes for an even better learning experience. The readings are also carefully chosen, although initially seemingly unrelated; by the end of the course, however, things just clicked for me and I began to see the current education field through a more historical perspective. If you're interested in education, and intend on taking other courses on education in the future (read: US-World 35), I'd recommend this course. If not, I'd recommend this course anyways because it just provides such valuable background knowledge to how our educational system came to be today. \r\n\r\nOh, and by the way: you probably will get substantially more out of this course if you don't take another reading-intensive course (given that you really do gain a lot from the readings). Also, visit her office hours; Professor Reuben is extremely nice, and will be willing to help or just casually talk about education.","Although this course is cross-listed as a graduate seminar, it's really aimed at GSE and College students, not graduate students in the history department. Class discussion tends to focus on tying historical topics to contemporary policy debates, and the assigned reading is discussed mostly on an empirical level--not at all in historiographical or conceptual terms. Useful background, but you will feel as though you're in an undergraduate seminar.","I took this course because the reading list looked amazing and because I am passionate about education. I thought that it would be great to take a class with HGSE students, and that the historical aspect of this course would be a great complement to my knowledge of the current education system in the US. Looking back, I was right on all of that, except that the reading list was somewhat less amazing than I'd expected, albeit with high standards. The reading list did its job - giving me a great overview of the topic, and really explaining and teaching me history - but I came in expecting to love the experience of reading every book based on my passion for education, and I didn't. There is a lot of reading, and some of it is highly redundant. I think Julie could've chosen parts of books in many cases, rather than requiring the whole thing. 3 hour classes are long. But Julie is great at facilitating discussion, and the readings were instrumental in that respect. I would recommend the class to anyone, just realize that no reading list is going to be perfect and recognize how long 3 hours is.","The class gives a great introductory overview to the history of education in the US. Professor Reuben is a great discussion leader, though not always the most engaging lecturer. The class consisted of a really nice mix of undergrads, masters students, and doctoral students, so that's a great component that makes this class valuable compared to other undergrad courses on education. \r\n\r\nI was frustrated that we only had one big writing assignment at the end of the course and so there was little opportunity for growth as a historian writing. We didn't get to learn a lot from the professor about how to make a historical argument or structure a paper. Also, I didn't feel like the class had an overarching theme or lens."]},"Spring '15":{"comments":["While a great many educators disregard the history of their profession altogether, and a great many more simply ransack the past for simple lessons that can inform practice or policy, this course pushes you to think historically about American schooling within the specific times, places, and milieus in which it developed. The historical orientation of the course may be frustrating for pragmatically-minded educators, but this is good - they need to be challenged to think differently and to draw conclusions from history and make decisions in the present more humbly. The educational orientation of the course may be frustrating for strict historians or other academic-minded students who are uncomfortable with the ways in which the topics constantly lend themselves to urgent problems in modern-day schooling. But this can challenge historians to think about how they may be able to engage contemporary conversations with integrity to their discipline but with wisdom for current conundrums.","This class is a great way to learn about the history of education. Do the reading, even if there is a lot of it from week to week. It is the only way you will both be able to participate in discussion and learn a lot about education.","Really look over the syllabus and make sure that it covers the topics that interest them. Also - the class is 3 hours - but the professor gives breaks during class so it makes it more manageable. Finally, check the assignments before you sign up for the class; the weekly response papers were fairly formulaic. Lastly - this class will help you question your assumptions about the role of schooling in assimilation, education, citizenship, etc.","Class with a series of good readings that provide a very broad but analytical take on the history of schooling in the U.S.","Engaging and well-structured"]},"Spring '16":{"comments":["This class is definitely doable without a strong history background, but you should be strongly interested in history. As someone who took the course because of an education rather history interest, I sometimes found the class discussions not particularly engaging. However, many of the readings are pretty interesting and worth reading and discussing.","If you want a class that you can just \"get by\" don't take this course. Take this class if you want a super well-organized course, filled with information, that keeps students accountable to do readings and have fruitful conversations. You will have a history course that highlights the voices that you wouldn't necessarily hear in mainstream American history courses (ex. deaf, American Indians etc.).","The class is comprehensive and you will take a lot away from it. Julie is incredibly knowledgable about pretty much anything you might be interested in focusing on for a final project and is very helpful with the writing process, which she scaffolds heavily with checkpoints throughout the semester. The reading load is pretty heavy, but manageable. The three hour long classes are often a mix of discussion and other activities\/videos. I never felt like the time dragged."]},"Spring '17":{"comments":["This course does require a lot of work but is wholly manageable. It is also very welcoming to undergraduates and is a great course to take at the Ed School."]}},"mostRecentQ":{"overall":"4.00","workload":"6.30","difficulty":null,"recommendation":"3.70","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"0","3s":"1","4s":"4","5s":"1"},"QDifficulty":{"number":"HIST 2450","course_id":"2492","cat_num":"91462","1s":"0","2s":"3","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 2450","course_id":"2492","cat_num":"126559","1s":"0","2s":"1","3s":"3","4s":"0","5s":"1"}},"success":true}