{"scores":{"Spring '14":{"course_score":{"overall":"4.80","workload":"2.20","difficulty":"3.00","recommendation":"4.60","enrollment":"6","response rate":"83.33","QCourseOverall":{"number":"GOV 94hu","course_id":"2174","cat_num":"68777","1s":"0","2s":"0","3s":"0","4s":"1","5s":"4"},"QDifficulty":{"number":"GOV 94hu","course_id":"2174","cat_num":"68777","1s":"0","2s":"0","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 94hu","course_id":"2174","cat_num":"68777","1s":"0","2s":"4","3s":"1","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.50","workload":"2.44","difficulty":"3.00","recommendation":"5.00","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"GOV 94hu","course_id":"2174","cat_num":"68777","1s":"0","2s":"0","3s":"0","4s":"1","5s":"4"},"QDifficulty":{"number":"GOV 94hu","course_id":"2174","cat_num":"68777","1s":"0","2s":"0","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 94hu","course_id":"2174","cat_num":"68777","1s":"0","2s":"4","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '13":{"comments":["Cosette is kind and incredibly helpful, and this class helped me get grant funding for thesis research, solidify my research question, and generally excite me about the thesis process.","Fantastic forum for a Social Studies or Government student to plan his\/her thesis. Cossette is great!","This course will leave you with a strong idea of methodology and research design which will put you in a terrific place to begin your thesis research over the summer. Highly recommended to those writing a thesis - Cosette was a huge help, and although she will not be teaching the class next year, the structure of this course is great. I don't know how I would have developed a thesis idea without her help.","Cosette is a super dedicated and committed instructor. She is really invested in the development of each student's thesis. Her feedback is always very helpful and accurate. I would definitely recommend taking this class, especially if you are thinking of human-rights related thesis.","Great. Coming up with a thesis topic and methodology is tough... But it is best to begin the process sooner rather than later with the help of this course. The assistance and support that this course provides in the process is really exceptional.","Having a seminar devoted to helping develop and orient a research question is incredibly helpful for a senior thesis. This class provides that opportunity in a very manageable way. Cosette is super helpful and supportive throughout the entire process. Highly recommended for all potential senior thesis writers!","Cosette is a fantastic instructor to have and has a lot of real experience and knowledge in human rights. In addition, she is a great resource to bounce ideas off of and get great insight. The class is really great if you're interested in possibly doing a thesis about human rights!","This is a great course to take if you have an idea for your senior thesis and need help starting or thinking through your idea. Cosette is very supportive and you get great feedback from your peers as well. The seminar helped me to think through sound methodology for my thesis and gave me a much needed push to apply for funding, find an advisor, and plan my research. The assignments are reasonable. Overall, you get out of the course as much as you put in.","This class is a must for anyone planning on writing a government\/social studies thesis!"]},"Spring '14":{"comments":["If you have a research interest even remotely related to human rights, take this course! Cosette is an excellent instructor and she will really take you under her wing as you develop your prospectus! The readings are also excellent.","Take this course if you're even thinking about writing anything about human rights!  Cosette is so helpful and I appreciated her feedback soooooo much.  She makes herself available to meet, and she chooses really relevant course material.  I really enjoyed the class and wish I had been able to contribute more, but ultimately I got a lot out of it and really enjoyed those two hours every week.","Anyone considering studying Human Rights more in depth should consider taking a course like this!"]}},"mostRecentQ":{"overall":"4.80","workload":"2.20","difficulty":"3.00","recommendation":"4.60","enrollment":"6","response rate":"83.33","QCourseOverall":{"number":"GOV 94hu","course_id":"2174","cat_num":"68777","1s":"0","2s":"0","3s":"0","4s":"1","5s":"4"},"QDifficulty":{"number":"GOV 94hu","course_id":"2174","cat_num":"68777","1s":"0","2s":"0","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 94hu","course_id":"2174","cat_num":"68777","1s":"0","2s":"4","3s":"1","4s":"0","5s":"0"}},"success":true}