{"scores":{"Spring '17":{"course_score":{"overall":"4.10","workload":"4.50","difficulty":null,"recommendation":"4.10","enrollment":"19","response rate":"73.68","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"3.80","workload":"3.40","difficulty":null,"recommendation":"4.00","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}}},"Spring '15":{"course_score":{"overall":"3.90","workload":"5.20","difficulty":null,"recommendation":"4.00","enrollment":"21","response rate":"66.67","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"3.90","workload":"5.00","difficulty":null,"recommendation":"3.90","enrollment":"38","response rate":"78.95","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"3.40","workload":"2.40","difficulty":"3.00","recommendation":"3.60","enrollment":"25","response rate":"76.00","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.00","workload":"2.40","difficulty":"3.00","recommendation":"4.00","enrollment":"50","response rate":"88.00","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.20","workload":"2.50","difficulty":"3.10","recommendation":"4.17","enrollment":"23","response rate":"86.96","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"3.56","workload":"2.31","difficulty":"3.04","recommendation":"3.78","enrollment":"62","response rate":"88.71","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH C","cat_num":"58289","course_id":"4378","year":"2012","term":"1","id":"f6c79eed4fe81d56db624f228deb2e2e","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '12":{"course_score":{"overall":"4.29","workload":"2.00","difficulty":"2.89","recommendation":"4.32","enrollment":"32","response rate":"87.50","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.26","workload":"2.32","difficulty":"2.91","recommendation":"4.48","enrollment":"67","response rate":"97.01","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH C","cat_num":"58289","course_id":"4378","year":"2011","term":"1","id":"f6c79eed4fe81d56db624f228deb2e2e","first":"Carole","last":"Bergin","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.62","AccessibleOutsideClass":"4.79","GeneratesEnthusiasm":"4.79","FacilitatesDiscussionEncouragesParticipation":"4.71","GivesUsefulFeedback":"4.79","ReturnsAssignmentsinTimelyFashion":"4.57"}]},"Spring '11":{"course_score":{"overall":"4.15","workload":"2.03","difficulty":"2.84","recommendation":"4.30","enrollment":"37","response rate":"89.19","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"4.38","workload":"1.90","difficulty":"2.68","recommendation":"4.44","enrollment":"56","response rate":"91.07","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH C","cat_num":"58289","course_id":"4378","year":"2010","term":"1","id":"f6c79eed4fe81d56db624f228deb2e2e","first":"Carole","last":"Bergin","InstructorOverall":"4.86","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.86","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Fall '10":{"comments":["A course that will, by its nature as a language course, require a bit of the lab-rat \"I'm just memorizing flashcards\" learning, but one that shouldn't be disregarded because of that. A fun course if you allow it to be, a killer if you refuse to apply yourself.","It's a great class if you want to improve French skills; lots of little assignments but nothing too time consuming.","this is a great intermediate french class!","if you don't like french just switch to another language","The tf's are wonderful and encouraging.  I would strongly recommend taking this class if you have any interest at all in language","It's good, just a little tedious at times.","A lot of the grammar material is review from French A, but the authentic materials we used (movies, texts, etc.) made it interesting.","N\/A","Regular quizzes and homework important to study \/ prepare for. This class is very high-school at times - you meet 4 days a week, you do your homework every night, you study for a quiz every week, and you wind up learning the material.","This class is a very good follow-up for French Bab!","I would say that I learned a lot in this class, but it isn't the most exciting class in the world.  It is a good class if you're looking for something low-stress and easy, but also quite instructive.","French C is great! It's a good level for people who know French but aren't necessarily fluent yet.","What you get out of this course is directly proportional to what you put in. Do the homework. Study the words.","That they will learn a great deal, in a fun setting.","great class that really helps you become more comfortable with speaking\/writing\/listening\/reading french. if you have taken more than 2 years in high school, this course might be too easy so take a higher level. but if you only have one year\/one semester of experience, then it's a perfect class.","I feel like my French improved very much over the course of just a few months. Learning from a native speaker is something I've never experienced before, and it was really helpful. I enjoyed this course very much, and Maud is a wonderful teacher!","not an easy A like one might suppose.","Great course! Classes are very enjoyable and TFs are GREAT! Specially Kathryn!","it's a wonderful class!","This is a nice refresher course for those who have taken two to three years of French in high school. The two areas of language that it helped me improve the most were listening and speaking. Kathryn Rose is wonderful and extremely friendly.","I only took French A as a freshman last year, and there were a lot of kids in French C who were freshmen with extensive French backgrounds from high school.  If you only took French A last year, be prepared to work very hard to keep up!","I would like to tell them that the course itself is very enjoyable and the workload is definitely manageable.  Try to keep up with assignments and do out-of-class movie viewings and such so as to get the most out of the class.","The class is very fast-paced, but you can definitely cope with the pace.","Fun and low-stress.","Really good class & my TF, Kathryn, was amazing!  Be prepared to actively participate every day; classes are small and it's largely discussion-based.  Doing the homework isn't that important, as it was never checked (although perhaps that will change?)","This class is fun, not much work, and a great way to maintain and improve your French skills. The TF's are excellent, and the comfortable and personal classroom atmosphere is a welcomed change from many other Harvard classes.","Don't wait until 3am to do your homework.","Take it!"]},"Spring '11":{"comments":["Wonderful language class. Not a lot of stress. But a lot of fun. A lot of work. But each counts very little.","This course prepares you very well for a trip to France and to continue with your french experience. There is focus in all areas that you would want in order to improve your understanding and use of the language. You WANT Franck as a TF; he is amazing and so enthusiastic!","I would only recommend this course to someone who has had enough training in French where they do not need remedial instruction.  Also, if someone is considering taking this course they should have recently taken French.  If a student meets these qualifications, they should have an enjoyable time in the class, but it will still require a lot of work.","Good French class if you took it in HS.  A lot of speaking in class though, as well as a fair amount of writing on quizzes (not essays).  Grammar is pretty easy though.","It adds to what you already know, and fine tunes what you already know","Fun French class. Weekly quizzes which gets a little frustrating, but nothing too unmanageable.","you will get a lot more comfortable with French (reading, writing, speaking, listening)","Great course if you apply yourself","It is a great language course that allows you to dedicate at least one hour a day to learning a language. It tends to be time consuming at times.","Language classes are always worthwhile.","Learning French is truely about the amount of work you put in, as cliche as it sounds. There is only so much a great teacher can do for you if you don't put in the effort.","Kathryn est la meillure T.F. dans le monde.","Do the work and study hard for the exams.","A repetition of French A in one semester. Skip it if you did well in French A.","absolutely great for keeping up with languages.  definitely a lot of work and a lot of time, but worth it too!  very practical and i can't emphasize enough what a great teacher Kathryn was!","This course is a great review! Although I placed into French 30, I opted to take French C instead to better brush up on my grammar--I'm happy I did. Meeting 4 times a week can be cumbersome (make sure you don't miss more than 2 sections!), but the homework is reasonable and fairly easy. It was nice to take a class with straight forward, consistent homework.","Painless, but you learn a lot. Great course!","This is a good class for reviewing French after high school.  It's a very quick review of everything you would have learned in high school French and a bit more, leading well into French 30."]},"Fall '11":{"comments":["Excellent opportunity to strengthen grammar skills and build vocabulary.","The course requires diligence and a genuine interest in the francophone culture and language.","This course has immersion-style teaching, which quickly equips you to understand and speak French. It solidified my knowledge of grammatical concepts as well.","You will learn a lot!","Stick with it!  By the end you'll realized how much you've learned and it'll be worth the 'hassle' that comes with taking a language course.  Take it seriously too, or you might end up with a lower grade than you wanted","This class is key to furthering your study in French.  The work is sometimes cumbersome, but if you have an engaging TF the class is enjoyable.","I enjoyed this class and learned a lot. I would recommend it to students who want to improve their French skills, particularly their comprehension and written skills. I thought the way that grammar was taught was particularly helpful.","Take the class! Learn a language--the way it's taught I feel was a million times better than most other classes I've taken. I've learned more in this class than I have in the countless hours I've had to spend for other classes. The world is increasingly a global network--know something other than English and French is a good option (numerous francophone countries for study abroad)! French C has convinced me to seriously consider pursuing a citation...","The class isn't too difficult but assignments like watching Sous le soleil and having to post about it on Facebook each week was really annoying.","This is definitely a good class if you want to improve your grammar. If you're looking for a fun and easy language class...try a lower level. It meets four times a week which can be a little tedious, but it gets your day up and going. It's really good to participate in class, and the teacher will appreciate it. Be sure to ACTUALLY do the grammar each night, as it will help you improve the most.","Attend the individual tutoring sessions","French C was fun - make sure you have a good TF because they're the ones that really make the material engaging.","take it. it's fun and easy. but do remember to come to class prepared.","Make sure to be self-motivated, force yourself to talk in class a lot, and keep up with the work.","If you are interested in continuing French, this course is a great place to find yourself. Madame Bergin is a very good teacher, the assignments are all helpful and not by any means overwhelming, and you'll finish with a proficient understanding of French grammar and one step closer to fluency.","Not to be missed","Very good option to recall what you learned in the past and to give you a platform to improve your French in the future.","I did not take any french before this course. I studied over the summer for 2 months on my own and took this course. The first week may seem overwhelming if you aren't comfortable with your french, but don't be worried. Most people in the course are overqualified for the course I thought, but that won't take anything away from your french experience. Being around better french speakers will only help you if you don't give up. You will learn a lot of french very quickly if you want to.","It's a really good review of grammar, much better than French 30.","The class was fun, I greatly improved my French, and had manageable work.","It's great, you will definitely improve your French.","If you have the time, take French 30.  If you are short on time but still want to continue with a French language course, this is a good option.  However, it is not a challenging course, and rather than teach you anything new, it mostly solidifies the knowledge you had already acquired.","Fun class. Very interesting cultural component.","Very good class with a lot of small assignments that do not take a ton of time to complete (like one weekly problem set in other classes) but they do add up over the course of the week into a decent amount of work.","Carole is great and makes the class so much fun! I hated French when I took it in high school, and wasn't looking forward to taking it in college - but, Carole made the class very enjoyable and my french improved more over the course of this one semester than it did throughout my 4 years in high school.","This class was one of my favorite this semester. The coursework was not too difficult and you get to learn French in a fun and creative way.","Unfortunately, like French A, this is the only game in town to learn French at Harvard. It really depends on your TF, otherwise you don't learn a lot.","Carole is amazing!","Take this, you will learn french whether you would like to or not.","Prof. Bergin is great! This course was really fun, and it's amazing to see how much improvement there is at the end","You will learn only as much as you put into the course.","If you have taken French A, DO NOT TAKE THIS COURSE, it will suck away all love for French. Skip it.","I particularly enjoyed this course with Franck as my instructor.","This class is different from a language class you would take in high school. The TFs are so much more enthusiastic about the subject matter and I had a really great time.","It will be difficult, but work with your TF and you can really improve your french and start the seriously learn the language.","This class is very well-taught and by the end, students are well-prepared for the more advanced French classes offered at Harvard.","Stephanie teaches the course very well. She managed to cover everything on the syllabus and that really kept us on track for the class (as the pace of the course was quite quick).","J'adore le Francais C!"]},"Spring '12":{"comments":["hard to get an A","Great class that goes over the basics of French. Your speaking and writing skills will certainly improve after taking this class.","It challenges you in many different areas.","Kathryn is the best TF ever. However, if you took AP French in highschool, even if you didn't get a 5 on the exam, this course is probably too easy for you. Although it is a great review if you've been away from the language for a while. All of the assignments have an objective - it never feels like you're doing busy work.","Super fun. Totally depends on your TF how hard the class will be though. It doesn't need to be hard for you to learn, but some like to be more harsh than others.","It was a truly great class and reminded me why I had begun taking French to begin with. My language skills are light years ahead of where they were just 3 months ago. I think I learned more in this one semester of class than I did in 4 years of high school French. I highly recommend it!","Professor Bergin is an excellent teacher. She is very dynamic and enthusiastic. She does everything she can to help people learn. She knows how to engage people to the topic.","Make sure FRANCK is your TF!!!","I had not taken French since I was a Junior in high school and I was a second semester freshman when I started French C. It's not a bad transition. I got reacquainted with the language effectively and am going to continue learning more.","depends on the instructor you get, im sure. my instructor was very good so i got a lot out of the class. you'll learn enough to say whatever you want, but in a roundabout way because you wont have the depth of vocabulary or know all of the colloquial phrases. comprehension will be a little more difficult for this reason.","I think it depends on the section leader you get to teach you Mon-Thurs. If they are excited and interested in the class and the class material, the experience can't be bad - it isn't a difficult course.","I would tell them I really enjoyed going to this class because everyday was something different, it is not boring, and very \"happening\" with the things that are going on in our world. YOu learn french very well!","great","French C is a great refresher course if you haven't taken French for a couple of years.  It sharpens and expands your grammatical knowledge of the French language while forcing you to re-learn how to speak French.","This course is great if you need to review French grammar.  I took French in high school and then took four years off, so this was definitely the refresher that I needed. \r\n\r\nAlso, the enjoyment of the class probably depends on the instructor that you get.  If possible, definitely take the course with Kathryn Rose.  She teaches the material really well and is an absolute blast.  I had this class every morning at 9am, but it was definitely worth it.","Very good for review. I have struggled with learning French and I took Ab last semester, which I found to be very demanding and difficult. Though many topics are repetitive, this course has finally made French click in my mind. I still have a long way to go before I am proficient, but if you struggle with grammar particularly, this course is for you. Also Kathryn Rose is great!","Fairly straightforward- two questions: \r\n1. Have you met the requirements for this class? \r\n2. Do you want to learn French?\r\n\r\nIf you answered 'Yes' to those questions- take the class.","It's pretty difficult, but it will improve your understanding of the language","If you want to learn French, this grammar-heavy class is an essential if sometimes dry step along the way.","The atmosphere, energy and dynamism encourages interest and hard work. Except you do not really feel it is hard work.\r\nPlus the instructor was personal and very encouraging, and also easily accessible by email.","Take this course if you're interested in improving your French. Aussi, Kathryn est la meilleur TF du monde!"]},"Fall '12":{"comments":["great class, take it","This course is definitely a good review for people who have learned these concepts, even briefly, before.  However, the course is fast paced, and there a few breaks in work.  If you don't understand something, don't expect it to be reviewed in class, you will just be expected to use the new material, usually in a short skit or written dialogue.","I really enjoyed this class.  Although there is homework every night and you are expected to be prepared in class, if you do your work the class is easy.  Overall I feel that my french really improved.  There are lots of songs, skits, interactive activities so if you like that kind of stuff you will enjoy this class!","This class can be very rewarding if you are willing to put in a lot of work.  You will have homework every night, and there is always extra work for the weekends.  They expect you to be able to speak comfortably, and they also expect you to teach yourself any grammar you don't already know and simply review it in class.  This is a good course if you aren't sure if you're ready for French 30 or above, or if you need more practice speaking.","Be prepared to participate a lot in class. Doing the work every day is a big help. Quizzes every week can get a little annoying, but in the long run it helps you learn French better by making sure you're keeping up with the class.","I started French at Harvard with Aa\/Ab and LOVED them, so much so that I decided to pursue a citation. French Aa\/Ab was run incredible well--I learned so much, had so much fun, and developed a genuine love of French. French C tore a lot of that love apart, and wasn't a pleasant experience. \r\n\r\nFirst of all, people who should have enrolled in French 30\/40\/50 take the course, which makes the learning environment stressful for people who are at the C level (in French C--who could imagine???). The course was run very poorly. Assignments, materials, and other components of course design were deeply flawed.\r\n\r\nBUT, you will learn SOME French (not nearly as much as you should for the time you put in). The assignments will be easy (except the IMPOSSIBLE Midterm\/Final, which the course will NOT have prepared you for). Interacting with your TF will improve your ability. Most of the course is self taught (this is partially just because it's a grammar class). \r\n\r\nHopefully French 30 will rectify some of my love of French that C broke down...","Not only are you able to watch French films and ENJOY them by the end, this course is also a daily reminder why fluency in another language is so important.","If you need grammar review, it's a great class. If you don't, you can skip to French 30.","This class is not too hard and improves grammar greatly.","French C is a great class for expanding your knowledge of French. Try and get Franck- he will make every class hysterical and entertaining.","It is a fun course.","Don't be afraid if you feel lost in the first few weeks. I hadn't taken French in 2 years and felt discouraged at the beginning but if you stick with it, put in the effort to understand the grammar and go to office hours, you'll be fine.","For an intermediate level language course, French C strives to keep the content relevant and engaging. You will do a lot of tedious grammar work; this is inevitable at such a level. Stick it out and you will be rewarded with a significant improvement in your French. In particular, your writing will be markedly improved. This course will also prepare you for developing your vocabulary in your own time, having now covered pretty much all essential grammar.","French C is a great class to help improve your French skills, but keep in mind there is a lot of work involved from daily homework to weekly quizzes to a midterm, final project, and final exam.","Excellent class for moving toward fluency.","it's very time consuming and work-load heavy. But if you commit whole-heartedly this course would prove beneficial to improve your french.","The pace is pretty easy to handle, and while there is speaking involved, there is not as much as the French 30 class.","This class was very poorly organized - assignments, lessons, etc. seemed to be thrown together very haphazardly.  Also, grammar isn't actually taught in class - each day, part of your homework consists of learning\/reviewing the grammar topics to be discussed in class the next day.  Overall, not a very great course if you want to learn new grammatical concepts, but it serves as a decent grammar review if you're not ready to jump into French 30\/40 yet.","It's an excellent review for those who haven't taken French in a while. Be sure to keep up with the work and do your readings. The immersion is really a great way to learn a language, and it's lots of fun!","it's a ton of work and takes up so much time, but you do come out with a lot more fluency","DO NOT TAKE IT.","Beware of all the tiny little components of this class and how one third of the most important assignments are packed in the last 2 weeks of class, which is very frustrating. The book in general is not very interesting. Midterms are alright, but finals are very long! In general, moving from a wonderful Aa and Ab to French C, I am disappointed and I don't recommend this class. Also the grading is very strange. It doesn't matter whether you make 10 or 20 mistakes, your grade is still the same.","If you have a knack for learning languages, or know another romance language well, it's possible to jump up to C from Aa. It's a steeper learning curve than Ab, but you'll get a lot out of it!","It is very useful if you want to refresh and deepen your knowledge of French.","YOu will really learn a lot from this class even though the course work might be a bit challenging.","This class is great if you want to practice speaking French and review the grammar so as to speak accurately as well as fluently.","This class is a lot of work and is more focused on exercises than on speaking.","Students who take this course will probably do so out of necessity that desire. Be warned that this course will take up far more time than you think it will. This is mainly due to the fact that the homework assignments are so persistent - you will constantly have small, time-consuming though not intellectually challenging pieces of work to do. I felt that there was a lot of busy-work - work which was assigned, never graded, and related-though-perhaps-not-relevant to the work in class. \r\n\r\nYou will improve your french, if only by virtue of being forced to speak it four times a week. I enjoyed the fact that the course was conducted entirely in french and so you are forced to confront the language very frequently. The grading is fair, the assignments are never particularly demanding but do still need to be done. Try to choose a section time that you will definitely be awake for.","This class is a lot more disorganized than French Aa and French Ab. Prepare for a lot of homework that will often feel like busy work.","This course is a solid way to bridge the gap between into French and the more intermediate French of French 30. However, the course is disorganized, which no TF can do anything about. It was hard to keep track of the many small assignments, and so they tended to pile up. There was also constant confusion about which assignments were required and which were suggested, as well as when various assignments were due.","The course work is graded pretty harshly but it all helps you to effectively learn the language."]},"Spring '13":{"comments":["If you're looking for a class that will go through a thorough yet quick review over French grammar... THIS IS THE CLASS TO TAKE!","Manageable workload and you have a good deal of fun!","I liked it and felt that it was taught well just wished I had taken a lower level class, so I would have gotten more out of this class.","This class can be very fun at times, but also frustrating because it is 4 days each week. Consequently, there is homework due almost every single day. I will say that these tasks will not take very long, but it can be annoying and a pain to have to worry about homework and class almost every day of the week.","This class was great - Franck is a wonderful, energetic, enthusiastic teacher who just gets really excited about all things French. We talked all the time and that's the best way to practice. I also liked how we did the necessary grammar work, but under the themes of food and popular culture and other interesting topics.","Loved this class much more than French Ab... Much more interesting and I learned so much more. Might have been the instructor though. Franck was great!","If you are looking to sharpen your grammar skills and improve your speaking abilities, French C is a great class to take. The course requires a lot of tedious homework, but none of it is challenging. If you keep up with the work and participate actively in class, your French will undoubtedly improve. I hadn't taken French for two years and wanted to sharpen up my grammar before moving onto French 30, and French C was the perfect way for me to do this. As long as you keep up with the work, this class really isn't hard and your French will most definitely improve. Franck was a very enthusiastic TF who truly wants his students to succeed!","This course helps a lot with French grammar if you are feeling shaky on that after taking a previous French course. There is constant work, but that is the nature of a language course.","The class is not bad at all - good level french class and not too much work. If you want to really learn and do well, its an hour Mon-Thurs and then maybe 2 on th ewekends. Which is not hard. What is frustrating like with a lot of language classes is that many students speak the language or are at a much high level. In my class of 11 students, at least 6 of them had prior experience at a higher level than French C (two even spoke french at home). The course head seems to not want to give out As and it is very difficult to get an A. An A- is easy to get with minimal work and a B+ if you aren't the best at language. You can't miss class though.","You'll meet your requirement and actually read, write, and speak better French for it. May as well make it count!","French C is a fun class.  It does a good job of solidifying grammar skills and making a casual dip into French culture.  It is not intense enough to cause French skills to quickly improve, but it is a painless way to pick up some of the language.","Be prepared to learn grammatical structures at a fast pase.","You learn a lot in a short amount of time. It's very fun and engaging.","Class is enjoyable but be prepared to complete a lot of homework assignments"]},"Fall '13":{"comments":["It was truly a pleasure to come to this class every day. Work is very do-able and enjoyable! Enjoy it.","My French skills grew a lot more than I imagined they would and I loved it so much.","This class is a great way to build your foundation of French. Fanny was engaging, and she always made class interesting - even when we were learning grammar. It can get a tad tedious at times with daily homework, but overall it is a great class.","If you put in the effort and do the work you shouldn't have too much trouble me succeeding in the class.","This class is more useful for motivating you to study french in your own time and providing you support in the process, didn't learn much as such from the class. Lots of different french\/francophone cultures covered, feels a bit hap-hazard. Would be better if like French AB they focused on one country\/city.","This is a fantastic course! if you want to improve your French grammar and work towards becoming more fluent, this class is for you.","This course is very effective at pushing you out of your comfort zone in order to help you better understand and utilize the language.","This is a great course","Fanny is a wonderful TF who is very accessible to meet and talk-- but she's a little quiet. Definitely not quite as exuberant as some of the other TFs. This is not necessarily a strength or a weakness; just a difference. Come prepared to learn verb tenses\/conjugations quickly, and never neglect to review vocabulary. Engage with others and speak as much French as you can.","This course is great if you need to review grammar. I learned A LOT because I hadn't taken French in a while, thus reading French articles online after this class made so much more sense. The downside, however, is that there's a lot of busy work and I wasn't happy about the constant work that continued to be pushed at us.","French C is one of those courses where you can have a wonderful experience if you make the most of what is given to you. The faculty members expect you to have a good base in French and so, though concepts will be reviewed, the material will be covered quickly. You will have to self-study at times, but the faculty (at least in my experience) are always open to giving you assistance. The romance language department offer free tutoring, and I would definitely suggest checking it out to work on any problems. In general, I really loved my French class, and even though I had to wake up at early hours to go to the class, I still didn't regret the experience. The material is fresh and I've learned so much more in these few months than I learned in my five years of learning the language before!","Be prepared to do a lot of work if you want to get the most of this course. It's very time consuming but it's worth it! Fanny, my instructor, was wonderful, also!","This is a great class and Franck is an awesome TF! The class however has weekly quizzes and requires a lot of work outside of class, so keep that in mind if you are considering taking the class!","You will learn grammar and structure, but it isn't intensive or helpful for improving conversation or audio comprehension.","It is far more difficult than French Aa and Ab, but far more rewarding as a result. Be prepared to put in much more work every night, but the class is fun.","This class is worthwhile for learning to speak with a variety of tenses.  However, be prepared for a barrage of quizzes (ever week) and an excessive amount of assignments: 3 long compositions, watching French movies on your own time, 6 audio recordings, the creation of a final skit, and more.","If you've taken French Aa and Ab, French C is just a slightly more difficult, work intensive version of those two classes. However, like all Harvard language classes, French C is taught wonderfully. I don't think you can go wrong with any of the teachers.","The teachers are great and the class is awesome.  If you take it, you are GOING to learn French (or at least a lot of French).","Do the work. Interact in class. Speak up. You only get out of the class what you put in it.","This class is good as the logical next step in French, but by itself, it doesn't have too much to offer. What I did really like about it was that for me, rather than throw a bunch of new aspects of the language onto me it fine-tuned and reviewed things I'd learned in high school, and I felt like that was very necessary before I continued on to anything else.","If you love French, you'll love this class. TF Franck is awesome - so enthusiastic and funny. He really makes the class fun for everyone. Expect weekly quizzes, which are a great way to work on your writing and grammar. The materials are super interesting and fun to talk about. Don't be afraid to speak up in class. I was terrified at first, because I had never taken a class conducted entirely in French before, but the only way you'll improve your speaking skills and pronunciation is by practicing. Some of the films we watched were very explicit (really gory, or a lot of sex scenes, or murder scenes), but hopefully they cut those ones and choose different films. Overall a great class!","French C is hard but it is an amazing opportunity to advance your French fluency.","a pleasant language class, daily homework but not unnecessarily labor intensive","Find a partner you feel comfortable working with, it will make class a lot more fun!","This is a really solid French course that will improve your French fluency with an edge towards writing and grammar. I think that taking this course is definitely beneficial, especially if you want to go further in learning French, because you are really able to gain a much greater understanding of grammar rules and vocabulary than you did in an introductory French course.  And the workload is not too bad if you set time for this class  and do not get behind. I also liked many of the activities that we did in section. Overall I would recommend this course for anyone that has already taken an introductory French course.","If you took high school French for several years but didn't really care or pay attention, this will consolidate what you learned and help you get \"serious\" about the language.","Franck is a great teacher"]},"Spring '14":{"comments":["This class is not one you want to without having taken a language at Harvard before. It's difficult adjusting to the structure of a language course here and trying to skip ahead.","There is a lot of busy work in the course, which was frustrating. It demands significantly more time than French Ab.  However, I felt prepared to succeed in the course after taking French Ab, and would recommend it if one would like to continue the language, since the class isn't extremely difficult, just time consuming.","it is regular wok","A fun course with fun assignments. Section was pretty awkward at least with my group (a lot of silent moments). Meets Monday-Thursday so be prepared to be doing homework before each class, doesn't take too long but it does add up.","French C is a lot of review, but a lot of fun!","Manageable class!","It's a pretty straightforward course for a language requirement if you've taken high school French. Be sure to look at the syllabus ahead of time- this semester, the assignments were poorly timed, and sometimes ended up with an absurd amount due all at once.","Taking a foreign language is a really important element of learning, but it is a very time consuming course.","This was great preparation if you are really trying to use french practically, especially for speaking.","I feel more comfortable conversing in French, and I feel that I learned a lot.","French C was an excellent way to engage with intermediate level French. I liked the combination of speaking, writing, and watching French soap operas. I definitely can speak French much better now. I only recommend with reservations because it was a lot of work, and I sometimes was a little wearied by the work. I guess that's necessary to learn French.","Because most of this class is practicing your speaking with your peers, it's really what you make of it. You can not say much and be bored, or you can take the chance to get to know the other students in class and have a fun, great time."]},"Fall '14":{"comments":["I understand that there is a new professor, and therefore a new course, for French C. Although this course had some redeeming qualities, you should count yourselves lucky to be rid of a class that turned my budding passion for French into a regret that I am using one of my precious 32 Harvard courses on French.","This course depends greatly on your TF, as it's taught entirely in section. If you feel comfortable in your French after French Ab, I'd say skip to French 30, as this course is not that effective and offers minimal linguistic improvement.","DO ALL YOUR HOMEWORK!","It's a fun class. It can be a lot of work at times. But it's worth it especially if you need it,","This class is very good for students that have a background in French, but haven't really been able to practice often. This class really helped improve my conversational french.","French is an excellent language, and I really felt like my knowledge grew a lot while I took this class.","I would tell future students to be ready to have a quiz each week, so to pay full attention during class time and to participate frequently in class to get feedback on your speaking skills.","It is a fun class. I improved my writing, and became more aware of getting the accurate pronunciation.","French 30 is useful if you need a review of introductory French but if you feel that you have a good mastery of introductory French this course is not necessary.","This is a great class to further your french!","- Super immersive language course that will allow you to really apply french","Great way to review your French!","Pay attention to assignments and dates on the website's syllabus.","Your TF in French (or any language class for that matter) is what makes your experience. So far, I have had fantastic TFs for French at Harvard, and I often picked my section times based off the TF I liked the best! It's important to get to know your TF throughout the semester -- I think that's the best way to begin to feel more comfortable with the language and with your work throughout the course. I love the smaller classes and the inhibition-free environment to talk and stumble your way through communicating any and all thoughts and ideas you may have. The quizzes are frequent but require some practice\/getting used-to. The projects are fun, and I'm definitely continuing French.","I would just make sure to be aware that this is a FRENCH class. There isn't a lot of opportunities to ask questions in english so make sure that you are able to speak the language pretty well. This is important. I would also be aware of the number of writing compositions required throughout the course. And the excessive amount of homework.","Be prepared to spend a lot of time actively studying for the class. You won't do well on the weekly quizzes if you haven't.","Franck is the bomb! Get Franck as your TF if you can!","Great class, your writing and grammar get a lot better. Franck is a great TF and keeps the class engaged and enthusiastic about French. There's also ample time allotted for class participation. However, I didn't feel as though my speaking improved too much, definitely not as much as my writing. However your speaking will improve nonetheless.","It's a good comprehensive grammar review - a reasonable amount of busy work, but it's not too bad. Definitely manageable.","Great class! Super fun, interesting material, easy to get an A- hard\/impossible to get an A -- as with all language classes."]},"Spring '16":{"comments":["really depends on the instructor","I'm a person who likes language classes as I find talking and conversing to be quite relaxing\r\nIf you liked French AB, you will like this class","Great class that suits many learning styles. No overwhelming expectations of fluency.","This is a good course, just stay on top of the current grammar and it will go well.","The class will depend a lot on the professor.","This course did not really have the structure I would have hoped for. I was wanting and expecting some more structured grammar, phonetics, and vocabulary\/writing lessons but we just did a series of high-school-esque work packets. If I had the foresight, I would have taken a different class.","Do not be afraid to ask for help if you are struggling with a concept.  Professor Bernthal is very friendly and ready to help.","really awesome and interesting course- highly recommend.","This is a really fun class! Enjoyable to participate and there is a manageable work load."]},"Spring '17":{"comments":["you will definitely improve your french","Make sure to attend office hours with the instructor to allow for more immediate response.","if you are at all experienced in french-this class will be too easy. It was more like an introductory class for French.","The class is an easy way to gain proficiency in French through regular contact with the language, while at the same time not being demanding of the students and leaving time for other studies.","Take it if you want to improve your French skills and if you don't want to do it in a stressful environment.","A very solid language class.  It's not going to stress you out.  There are lots of opportunities to speak.  You should see good improvement in your French ability."]}},"mostRecentQ":{"overall":"4.10","workload":"4.50","difficulty":null,"recommendation":"4.10","enrollment":"19","response rate":"73.68","QCourseOverall":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"0","2s":"1","3s":"1","4s":"9","5s":"1"},"QDifficulty":{"number":"FRENCH C","course_id":"4378","cat_num":"58289","1s":"0","2s":"2","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH C","course_id":"4378","cat_num":"126938","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}},"success":true}