{"scores":{"Spring '17":{"course_score":{"overall":"4.30","workload":"4.20","difficulty":null,"recommendation":"4.50","enrollment":"39","response rate":"89.74","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.10","workload":"4.90","difficulty":null,"recommendation":"4.20","enrollment":"23","response rate":"73.91","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}},"Fall '15":{"course_score":{"overall":"3.80","workload":"5.00","difficulty":null,"recommendation":"4.10","enrollment":"27","response rate":"100.00","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}},"Spring '15":{"course_score":{"overall":"4.40","workload":"3.80","difficulty":null,"recommendation":"4.60","enrollment":"24","response rate":"87.50","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"3.90","workload":"4.40","difficulty":null,"recommendation":"3.90","enrollment":"28","response rate":"89.29","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH 40","cat_num":"74519","course_id":"4380","year":"2014","term":"1","id":"5fb2f0b919c99ea475cd8e947055693f","first":" Aurelie","last":"Chevant","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Spring '14":{"course_score":{"overall":"4.20","workload":"2.10","difficulty":"3.00","recommendation":"4.20","enrollment":"33","response rate":"75.76","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH 40","cat_num":"74519","course_id":"4380","year":"2013","term":"2","id":"5fb2f0b919c99ea475cd8e947055693f","first":" Aurelie","last":"Chevant","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '13":{"course_score":{"overall":"4.30","workload":"2.00","difficulty":"2.80","recommendation":"4.40","enrollment":"33","response rate":"90.91","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH 40","cat_num":"74519","course_id":"4380","year":"2013","term":"1","id":"5fb2f0b919c99ea475cd8e947055693f","first":" Aurelie","last":"Chevant","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Spring '13":{"course_score":{"overall":"4.11","workload":"2.22","difficulty":"2.83","recommendation":"4.17","enrollment":"23","response rate":"82.61","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.12","workload":"2.06","difficulty":"2.85","recommendation":"4.32","enrollment":"34","response rate":"97.06","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"4.09","workload":"1.97","difficulty":"2.61","recommendation":"4.42","enrollment":"34","response rate":"97.06","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.29","workload":"2.04","difficulty":"2.67","recommendation":"4.25","enrollment":"49","response rate":"97.96","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"4.18","workload":"1.98","difficulty":"2.50","recommendation":"4.25","enrollment":"46","response rate":"95.65","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"3.92","workload":"1.90","difficulty":"2.61","recommendation":"4.08","enrollment":"82","response rate":"93.90","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}}}},"comments":{"Fall '13":{"comments":["Dr. Chevant is an amazing professor, and if you want to learn French, take this class!  She is patient, willing to work with you one-on-one and engaging.  She is really passionate about the material which makes this class really interesting.  She understands the reasons behind the grammar errors you make and helps correct them by pointing these out to you.  HIGHLY RECOMMEND!","This class is very manageable in terms of coursework and assignments. I liked how the class was structured in that I knew what workload to expect each week. Every other week we had to watch a movie and write a blog post about it. On the weeks we didn't have this assignment, we usually had a composition or grammar homework due. \r\nWhat I like about this class was that we improved our French through watching and discussing films. The movies we watched were (mostly) pretty interesting, like Indochine and Amelie. The test were manageable because they were broken down into three part: grammar, vocab and essay. The grammar we were tested on was much easier than the homework assignments we had. In fact, what most surprised me about this class and my least favorite part was the amount of time that I had to invest in order to learn the grammar from the book and then completing the homework assignments. What was challenging was learning how to spread the great amount of homework over two weeks. It was more than in high school, but instead of having homework due every other day, in college it's due every two weeks. \r\nI took this class because my advisor said it would be a nice, small class to balance out my big lecture courses. The size of the class did allow me to become really good friends with many of my classmates. The content wasn't hard necessarily but I do wish I had invested more time in the assignments because with language learning, the more effort that's put in, the more knowledge that one gains. I think I didn't prioritize this class and wish I had learned more.","This class is a lot of fun. Dr. Chevant is amazing and the movies are interesting and ones that you'd probably enjoy watching in your free time. The skits are mainly fluff, but the discussions are really good if everyone participates. I'm not sure how much I grew French-wise after taking this course, but this is one of those classes where you get out what you put in. You can definitely go and not pre-read MES and not do grammar until the day before it's due and not bother looking at vocab until before the two exams and still do well. However, you're not going to retain much, and Dr. Chevant is a fantastic resource.","If the curriculum becomes more focused, this class has serious potential to be great. However, as it is, it is unfocused and hard to keep up with. If it weren't for Professor Knudson, I would not have enjoyed this class at all.","I left this class with a better knowledge of French grammar and French cinema (and cinema in general, actual). It was a great class!","Some of the movies are very boring but some are awesome.","If you have interest in French cinema and are at the level for this course, I'd recommend it. The course takes a really enjoyable approach to learning, thinking critically, and working on skills often left out in other courses.","This is a great class that helps build and strengthen listening skills in French.","This course provides an interesting introduction to French films and simultaneously reviews and improves grammar. The professor provides a fun, engaging classroom environment and always gives  constructive feedback. The movies are interesting and the projects are fun, and you learn how to work in a team.","This class is all based on various movies that you watch on your own time, and most are pretty interesting and fun. Classes are all based on discussing these movies. Grammar learning is largely done on own outside of class, though you go over some of it in class and you can ask your teacher for questions. Class is really small, so it is easy to get to know your classmates well.","Good French class--easily better than C and 30. Chevant is an excellent teacher--the best I've had in the Romance Language department by a large margin. If you take this class seriously you'll learn a lot, but if you don't you won't get much out of it (no hand-holding). Great mix of painful, boring French classes (C) and easier, flimsier ones (30) with exams and papers both. Overall, tons of potential if you work. Thank you for being awesome, Dr. Chevant!","Please take this class if Aurelie Chevant is teaching. She is a wonderful and hilarious person, not to mention an effective, knowledgeable, and professional teacher. She is also very young which makes her a relatable and perhaps more approachable person. The class is small, and super fun! If you take this class, you will almost certainly enjoy it, make friends with your classmates, and learn a lot of French!","This is a pretty good class. The workload isn't too heavy, and a lot of the movies that you watch for it are pretty good! You're allowed to watch the movies with subtitles as well, so preparation for discussion in section isn't too stressful. This class really makes you speak a lot too.","This class is fun, goes over a great collection of French films, and develops your written work quite well. Conversation is less of a focus, but still gets improved. Aurelie is awesome!","Great class, amazing TF and really interesting films!! An amazing package!","it's a good class and not too much work. the movies are a good way to learn","REALLY REWARDING AND AMAZING CLASS! Make sure you get Aurelie as your TF, because she generates enthusiasm and I was actually looking forward to every French class. You fall in love with the language itself, and improve your language skills a lot!!! Aurelie is a great professor, she makes you get involved in the discussions and get the most out of them!","This course was very nice because it provided a lot of different ways to practice French language while still refreshing many important grammar lessons.  The films were all very entertaining, and I really enjoyed watching them.  To get the most out of the class, you really have to dedicate time to doing all of the assignments as they are assigned and not just cramming for the exams.","Great class! Time consuming but overall worth it. The group assignments were actually really fun. Madame Gates is super nice and really helpful! :) I felt like I didn't improve my speaking\/ listening skills as much as I would have liked however.","I really liked this class. although there are a lot of projects and assignments. They are all really creative and interesting and I enjoyed them. Also, your French improves a great deal so that is cool."]},"Spring '14":{"comments":["Great class.","Don't be nervous about not being great in French. All the teachers are very nice and they offer a lot of help and support.","I am not a fan of language classes, but I had to take French 40 and it was a lot more painless than expected. Franck is fantastic--fun, enthusiastic, but also serious. You will do a wide variety of assignments and exercises to improve your French, and actually have some fun doing it. The movies were mostly really good and interesting, and there was a lot of discussion of relevant interesting topics in French culture. Some of the work feels like busywork, but there is no way to avoid that in language classes. Keep on top of all the assignments--don't get behind, and it won't feel too bad.","The films in this class were really great and by analyzing them I gained a new appreciation for film in general. This class has a surprisingly large amount of work that I wasn't expecting.  There is always something due in every class and the work feels like it is never ending.  Also, we spend little time going over grammar in class, so that has to be done at office hours or on your own. The group projects could get stressful but were always fun.  All in all, I don't think my French skills improved as much as they did after taking French 30, but this class was still an enjoyable way to experience a different side of the French language.","Franck is very enthusiastic about teaching this course. You get to watch and analyze french movies which is a great way to learn and practice the language! Je pense que cette classe est excellente!","The movies can be time consuming, but they are infrequent enough that it does not create a substantial burden. Typical workload is very fair.","This is a great class! It's definitely more difficult than French 30, but it's still a lot of fun and you learn a lot.","It is a great way to learn about both the French language and culture.","This class has a constant stream of work which really forces you to work on all aspects of learning the language. While sometimes watching the films is tedious, they are mostly interesting and great for understanding native speakers.","This class is great. Dr. I would highly recommend taking it if you want to improve your speaking skills, as the class is largely discussion based.","This class isn't especially difficult, but you'll really need to motivate yourself to do the work since the pacing is strange (nothing too much, nothing too much, sudden heaps of work). Keep up with the work and you'll be fine. The class materials are engaging, though the structure for the class doesn't really allow for much depth.","It's harder than French 30, but I believe my French improved much more quickly than with other classes.","A very great class to consolidate and deepen French speaking and learning while also learning about French cinema.","It's fun to watch the movies and discuss them, but there's a lot of work outside of class like watching long movies and writing and memorizing 15 minute scenes, on top of vocab and grammar work. If you do take it, take it with Franck, he's great.","Much, much better than French 30, so if you're thinking about dropping after 30 don't do it!! The assignments are actually pretty well structured even if there are a lot of them, and the movies are shockingly enjoyable to watch and analyze. Aurelie (Dr. Chevant) is a wonderful TF who leads surprisingly good discussions on the material considering this is a lower level language class--absolutely try to get her if you can. Would definitely recommend as a good step in your language development.","The conversations, flow and structure feel somewhat artificial, but you will have a good opportunity to practice auditory comprehension and review grammar"]},"Fall '14":{"comments":["The class was great, and definitely one of the lightest on my schedule, but I found myself often bored with the assignments and the conversation. If you think you can handle anything more difficult, take 55 or something higher. Dr. Chevant is incredible, and I'd highly recommend her for any other course, but this one in particular was more valuable for the films we watched than for what we 'learned.'","This is an interesting class, especially if you like the French cinema and like to analyze French films while discussing important contemporary French issues regarding art, politics, family life etc.  However, be aware that this class has a lot of homework and a moderately heavy work load, so you need to spend a lot of time on it. However, it is totally worth it as your listening, writing and speaking abilities in French will definitely improve.","This course is good if you want to get accustomed to HEARING French, but it may not necessarily be one that pushes you into the realm of fluency if that's what you're looking for.  You have to be willing to speak up in class in order to practice your own speaking as well as be able to organize the grammatical concepts in your own mind so when it comes time for exams, you are not trying to learn everything on the spot.  In regards to pacing yourself, you should be doing that with the work in this course as well; it's not difficult, but you should supplement the movie watching and assignments with reading French articles on your own and listening to radio so that you become more comfortable with it.  In one sentence, I would say that in order to succeed in this class, you have to take your learning into your own hands and go about meeting your own personal goals as opposed to focusing on the levels of other students in the class.","Get to know your class and get involved in the discussions.","Make sure you watch the films!","Great class!!!! Dr. Chevant was amazing.  Led a really fun class with good group discussions.  Assignments are completely fair and it is very clear what is expected of you for each assignment.  Tests are fair and she will give you as much help with the papers as you need as long as you seek it out!  The group projects can be a little tedious, but really helped bond our class and make for a fun class overall.","I would say to not take the course in the morning. It was a bit tough to get through.","This is a fun class to take but it is not really a lot about film. Perhaps I was mistaken thinking there would be a lot of film study but this is really simply french language through film.","This class is more interesting and less work than most other french classes at Harvard.","The class does little to advance spoken French, although you do learn written structures.","Dr. Chevant is an amazing professor. Definitely try to get into her section for the class because she is very helpful and truly wants to help her students succeed. Always take your compositions to her before they're due and she'll help you out with grammar. Basically a really fun class with not too much work. Highly recommend.","It's a great class if, like me, your high school French classes were not that great and especially if you have had little exposure to writing or speaking in French. The movies are great, the professor is great, and although there is a lot of small work to do constantly, it's a relatively low-stress class. I feel that French 40 prepared me well to take my next steps in learning French.","The class itself requires a lot of work, especially writing in French. It quickly and greatly improved both my oral and written French, and the grammar is definitely a welcome refresher. There are some movies I really enjoyed and others that I did not enjoy as much, but overall it is a wonderful class.","A good class to take to fulfill french requirements"]},"Spring '15":{"comments":["French 40 is a really excellent class, and section with Amanda is wonderful. One watches a lovely array of French films, and trying to keep up with complicated dialogue in the films is an excellent way to improve one's comprehension skills. The atmosphere of the class is laid-back and creates a comfortable environment for sharing ideas and talking about the films. The workload is highly manageable, though there can suddenly be several assignments at the end of the semester. Amanda is a caring, knowledgeable, and fun teacher, so I would recommend her section highly, as well as French 40 as a great way of brushing up on one's French!","The French tongue will passionately stick to yours after this class.","This class will teach you a lot about french language and culture. I think it is definitely worth taking, especially after French 30. I am so happy that I took this class. With that said, you get out of it what you put in, no question. You can definitely take this class, do well, and put in very little time. Also, you can put in a ton of time and learn loads.","The material for this class is interesting, although if you have never had to an evaluate a film before, there will probably be a bit of a learning curve. Fun class, though, and your french will definitely improve. Overall, Harvard french class are great, as are the TFs.","A million times better than French 30. After French 30 I wanted to stop taking French at school because I hated the course so much. But I am so glad I stayed with it for French 40. The class was interesting, the movies we watched were actually good, and Amanda is a great great great teacher. Best French class so far at Harvard.","I will say that it's a great way to improve your speaking skills and that learning about movies at the same time really increases the enjoyment of the class.","This is an excellent course if you're looking to improve your French skills in all aspects of the language. I feel much more confident in my ability to have a casual conversation in the language, but I also find that my formal writing skills have improved immensely as well. If you're taking this course try to go to Amanda's section, she is super helpful and really fun!","Amanda is amazing!","It is fun because you get to look at films","French 40 is a wonderful class.  You will improve your French and gain confidence.","Great class, take it if you want a good French course.","French 40 is a fantastic course. Movies beat textbooks any day. It does seem like a course that would depend a lot on your TF--Amanda is fantastic, do not hesitate to take it with her. There is a huge variety in assignments, from presentations to skits to films to papers to exams, so everyone gets a chance to show their strengths. This class does require a significant amount of group work, so make sure you find a good group early on with whom you can continue to work because a bad group can easily ruin the experience. Overall, it is a great course if you are interested in french.","This class is a really awesome way to practice your oral french. The movies really help with pronunciation. If you take advantage of the discussion segment you really start to get a grip of French. (but please don't be that person who talks for 15minutes straight) Amanda is also really cool so go to office hours and chat to her if you can.","I really enjoyed this course! It's much better than French 40 and the movie chosen lend to interesting conversation and work, while also allowing you to improve upon your speaking and writing abilities.","This is a fantastic class! Amanda is great, and I really enjoyed it. Take this!","This is a very lightweight course; if you have a busy semester and you can't spend too much time on French, perhaps this is the right course. However, if you want to invest in French, you may want to skip and move on to Business French."]},"Fall '15":{"comments":["I think the only way to really improve your French in this class is by going over all of the corrections on work; since I didn't, I never felt my French measurably improving.","I enjoyed it a lot more than French 30, especially because we used movies which were fun to watch and discuss.","This course is well-organized, and the movies that we watched were extremely applicable to the issues society is facing today (race, police brutality, gender issues, etc.).  I also feel that this class is what got me from proficiency in french to almost-fluency.  The final film project was also extremely enjoyable, and I met a lot of good friends through this class. I highly recommend it.","Take this class if you like watching movies as part of your homework and want to keep working on your French. It did not improve my speaking abilities by a lot though. The workload is very doable and the final project can be a lot of fun if you want it to be.","For everyone who took French 30 and wasn't exactly a fan, French 40 is definitely a step up. First of all, for the most part, they ditch all the busy work. Then add to that the fact that the class revolves around watching lots of really interesting French movies. The class has a lot of writing, but the prompts are usually thoughtful and more like opinion-based writing than formal essay writing, plus your writing improves a lot. The discussions are also a lot more sophisticated than in French 30, which definitely boosted my enjoyment of the course. \r\n\r\nFor some reason, I found speaking in class to be a bit more nerve-wracking in this course than other French classes I've taken at Harvard, but that could be personal. There are also several projects, including creating a short film inspired by one of the movies from the curriculum, and that's an opportunity to have a lot of fun.","It is a great course and you will learn plenty. I did not take French 30, but I do hear the jump is considerable, so be prepared for that. The entire class is in French, and you will be expected to produce several pieces in French, but there are many resources available to you, so avail yourself of them.","Your experience will depend on your teacher.  The films are very interesting and entertaining and the discussions are also interesting.  It forces you to speak a lot which is very nice practice.  The grammar we do is hard but also very helpful.","If you're seeking to improve your French skills, this class will definitely help you, but it does so in proportion to the work that you put into it.","very structured class, violeta is delightful, the movies are great, relatively light course load","French 40 offers a fun and engaging way to secure your grammatical knowledge and really get comfortable speaking and engaging in intellectual discussion in French.","This class inspired a lot of very interesting discussions about the important themes of the films we watched. However, the films felt more like vehicles to discuss these topics -- there wasn't a lot of discussion about film movements or French cinema itself and the syllabus really lacks a lot of great films.","I took this class after getting a 4 on AP French. I technically placed out of language (and in the 60s level) with the on-campus test, but decided French 40 was a good fit, and I wanted to continue with French anyway. My speaking was weakest in the beginning, and that definitely improved a lot. But my writing and analysis also improved a lot too. The work load is manageable while still meaningful. Overall, a great class!","The movies for this class are watched outside of class on your own time, so be sure to cut out a chunk of time for that. There's a decent amount of writing for the course, but it's completely manageable.","If you like movies and discussing these movies, this is the course for you! Be prepared to talk a lot! I feel you'll get the most out of this course if you participate in class often-- don't be afraid to make mistakes!","Honestly a very dull class at times and something you'll just have to grind through. However I do feel like my oral French capabilities have skyrocketed which is definitely something good I got out of this class experience.","This course is great for students with a strong grammatical background looking to improve their speaking ability. Requires a decent amount of writing - I found that my writing skills improved significantly.","Keep in mind that this course will require completing a lot of small assignments, so you will have to keep on top of your work throughout the entire semester.","The class is a look at french cinema but isn't done well.","The movies are excellent.","This class is awesome."]},"Spring '16":{"comments":["You get to watch really interesting movies, and your language and writing skills will definitely improve. The amount of work required per week is somewhat uneven, but if you plan for it this isn't a problem.","If you are looking for either a way to continue French study in an intriguing new way with real-world applicability, or just interested in brushing up on advanced, but forgotten French, this class would be a great fit. The film selections are incredibly interesting and serve as a great introduction to authentic French culture, and the class is planned very well with a logical progression.","Once you stay on top of the homework, the class is fine","French 40 is a great time! Really awesome movies, great assignments and discussions, fun projects. Not a lot of speaking, moderate amount of writing, and as much listening as you can ask for.","This is a very enjoyable course, and by the end of it you will be better at writing, speaking, and reading.  You will also really build your general vocab as well as vocab relating film.","I thought the course was interesting in terms of the film we saw and discussion topics but sometimes class felt long and discussions were not very fluid.","This is a great French course. Watching movies and writing about them was fun, and in general it improved my skills a lot.","This is a great class that offers a wide variety of movies to watch. As long as you do not have a problem with writing assignments, then I guarantee that you will enjoy the class overall.","The movies are a core part of this class, and while they are great and it is nice to be exposed to french culture in this way, that's an additional 2 hours (sometimes more) of homework every week at Lamont in the LRC, so you need to plan ahead. But there is a diverse array of films."]},"Spring '17":{"comments":["This class is fun! I enjoyed getting back to French after missing it from high school. It was nice to jump into French 40 which is very relaxed (watching movies on the weekend and talking about them in class).","It's a great class if you love french and films!","This course is pretty good for teaching grammar, and most of the movies you watch are genuinely engaging. You also get to learn about parts of French culture that you might not have known much about before (e.g. the specific cultures\/languages of Nord-Pas-de-Calais and the Parisian suburbs). However, you might not get as much oral practice as you might like â€“Â even during class discussions of the films, people usually answer questions in 1-3 sentences, since the discussion questions are pretty straightforward and don't leave enough room for in-depth class conversations.","This class is great for developing speaking skills while becoming more exposed to French cinema. The movies we watched were very interesting, and discussions in class really help reveal the reasoning behind certain cinematic choices a director might make. Overall, it was a great course because it covers listening, speaking, and writing pretty equally.","Great class that really helps enhance your french","Be sure you are prepared to watch a 2 hour-ish movie once every week.","Really an awesome course, structured around exciting French Films! Bahij is just the best TF I have had, and he is willing to help you every step of the way.","Honestly a great class and bahij is an amazing tf. Just do your work and make sure to meet with you TF on essay drafts.","Would 10\/10 recommend! I hated French 30, and only took French 40 because my friends convinced me to give French one more chance (I had fulfilled my language requirement before coming to Harvard). Taking this course was one of the best decisions I made this semester, and I will definitely take another French course. The films were very interesting, the exams were extremely fair, and the workload for the course was well balanced.","Fun class, Matthew is great, good films","This is a great class with very interesting films.","This course is amazing; there is one movie to watch a week, and class discussions are focused mainly on the themes of the movies and how those themes relate to french culture and France in general. Bahij, our TF, was so enthusiastic and kind; my class got along really well and I really enjoyed every minute of it. I wish I could take this class again!!","This is a great class to take to fulfill your language requirement that is more than a typical vocabulary and grammer french class. The material was interesting and I often enjoyed our class discussions.","This is a good class. Watching movies is a lot of fun and you get some practice saying complex things in French in the classroom. You have to make sure you keep up with the weekly grammar stuff on your own.","This class provides interesting insights into French film while helping you develop French language skills. The assignments are fairly easy and the exams are fair. At times it can feel a little redundant and there is little incentive to do most of the grammar homework.","The movies are very interesting and the class in general is very fun!","I didn't realized that French class could be fun until this class. My French also improved tremendously","A great class!","Glad it was not an easy A class and felt it accelerated improvement in my speaking abilities far better than my high school classes. Films are very entertaining and interesting since they touch on important themes which are fun to discuss and write about. Just be aware that you have to watch the films in Lamont's LRC, and so this can sometimes be difficult to fit into a schedule as a traveling student athlete."]}},"mostRecentQ":{"overall":"4.30","workload":"4.20","difficulty":null,"recommendation":"4.50","enrollment":"39","response rate":"89.74","QCourseOverall":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"1","3s":"8","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 40","course_id":"4380","cat_num":"74519","1s":"0","2s":"3","3s":"20","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 40","course_id":"4380","cat_num":"126997","1s":"1","2s":"22","3s":"4","4s":"0","5s":"0"}},"success":true}