{"scores":{"Spring '17":{"course_score":{"overall":"4.50","workload":"4.80","difficulty":null,"recommendation":"4.50","enrollment":"9","response rate":"66.67","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.10","workload":"3.50","difficulty":null,"recommendation":"4.20","enrollment":"14","response rate":"78.57","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Fall '15":{"course_score":{"overall":"4.00","workload":"5.70","difficulty":null,"recommendation":"3.90","enrollment":"26","response rate":"84.62","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Spring '15":{"course_score":{"overall":"3.80","workload":"4.40","difficulty":null,"recommendation":"4.10","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.50","workload":"3.80","difficulty":null,"recommendation":"4.60","enrollment":"26","response rate":"92.31","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH 50","cat_num":"22997","course_id":"4381","year":"2014","term":"1","id":"5fb2f0b919c99ea475cd8e947055693f","first":" Aurelie","last":"Chevant","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Spring '14":{"course_score":{"overall":"4.40","workload":"1.90","difficulty":"2.80","recommendation":"4.50","enrollment":"16","response rate":"68.75","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH 50","cat_num":"22997","course_id":"4381","year":"2013","term":"2","id":"5fb2f0b919c99ea475cd8e947055693f","first":" Aurelie","last":"Chevant","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Fall '13":{"course_score":{"overall":"4.40","workload":"2.00","difficulty":"2.80","recommendation":"4.30","enrollment":"26","response rate":"88.46","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.29","workload":"2.18","difficulty":"3.06","recommendation":"4.47","enrollment":"17","response rate":"100.00","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"3.92","workload":"1.85","difficulty":"2.81","recommendation":"4.08","enrollment":"27","response rate":"96.30","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"3.93","workload":"2.28","difficulty":"3.00","recommendation":"4.00","enrollment":"31","response rate":"93.55","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.40","workload":"2.16","difficulty":"2.88","recommendation":"4.40","enrollment":"28","response rate":"89.29","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"3.96","workload":"2.62","difficulty":"2.88","recommendation":"3.96","enrollment":"26","response rate":"92.31","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"3.67","workload":"2.26","difficulty":"2.78","recommendation":"3.44","enrollment":"30","response rate":"90.00","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}}}},"comments":{"Fall '13":{"comments":["The course will definitely improve your French but you may find it slow and boring at times.","French 50 is amazing! My French really improved a lot through this course. Professor Chevant is wonderful - she really helps each student to learn and grow. I highly recommend French 50!","It's a great class if you're already comfortable with French, but would still like to improve your command of the language. I would recommend taking this before a literature course if you're still prone to errors in writing or speaking. From what I gathered from shopping classes 60 and above, those focus on ideas instead of the mechanics of the language, while French 50 emphasises the latter.","Solid class; workload is not too bad. Good for writing practice and keeping up your French.","Practice your writing and grammar regularly even when it's not for an assignment.","This was a really wonderful advanced-intermediate French class. There was a good balance of grammar, vocabulary, discussion, and engagement with culture. Aurelie is a fantastic teacher who really cares about teaching and dedicates enormous energy and passion to the class. Easily my favorite of the five French classes I've taken at Harvard.","This course is a great continuation of my understanding of the french language and has allowed me to convey my self effectively via writing in the french language.","If you are looking to continue your French education, this is a good class to take, even if you have not taken a French class for a year or two. The expectations for homework and exams are very reasonable; if you put some time and effort into this course, you will be successful.","Professor and class are solid, just like all the others in the department. BUT BE WARNED that, at least this semester, your grade was often depended on things other than your French ability (eg. Your ability to understand poetry)","The professor really cares about her students and the class, and it really shows in class.","I could barely write a sentence when I first started because I learned French phonetically from talking with my parents, but by the end of the semester I could write an entire essay. Dr Chevant is patient and wants you to succeed always. Take this class if you want to be able to write!","French 50 is a great opportunity to review your French and prepare yourself for more advanced French classes. Dr. Chevant is a great teacher who cares about her students and takes time to help them improve their skills.","it is a lot of writing and can sometimes class can seem tedious and not very interesting.","Useful class, helped improve my writing a lot","A solid continuation of the french program with a heavier writing requirement, also a bit more rigorous than previous classes in the curriculum.","This is a great French class! You learn to write and speak better through engaging material, and the professor is fantastic."]},"Spring '14":{"comments":["I really enjoyed this class.  Aurelie is an excellent professor, the course is very well organized.  My french definitely improved, both in writing and speaking\/listening.  It's not an incredibly exciting course but if you're looking for an effective course from which you will gain a lot that is also relatively painless, I would definitely recommend it.","This is a good class to advance on becoming fluent in French, although perhaps not quite as fun as French 40.","great course if you want to improve your french writing skills!","Aurelie is an amazing professor! She knows what she's doing, so just absorb everything that she teaches and you'll make the most out of this class! She has a good sense of humor, and knows how to make classes fun! French 40 is completely different from French 50 though, but it's still fun and a great class for language citation or just as an elective!","Dr. Chevant makes this class great. Also, you finally stop having to do pointless scenes and video projects and focus more on the actual language","Amazing class!! Aurelie is the best prof ever!!","This class is wonderful. Also, it was a really small section so there was room for everyone to participate. Also, Vincent was very accessible so I could go and ask any questions and he provided a lot of helpful feedback on your essays. I really saw my French improve during this course plus the workload is manageable. You learnt a lot about writing in French.","French 50 is an amazing course! You got the feeling that all the students were there, because they wanted to be there. We all indicated a desire to continue French after finishing this course. Professor Chevant's feedback on compositions and during office hours was excellent and well thought-out. She is extremely knowledgeable on the art of prose and poetry analysis. She pushes students to exceed their current abilities. She is enthusiastic and caring. She encouraged interaction in class, incorporated videos, and even invited a rapper to teach the art of rhyme and word choice in poetry. Through the help of this course and Professor Chevant, my French composition writing has progressed amazingly!"]},"Fall '14":{"comments":["The compositions are lots of fun and the discussions in class can be pretty deep as well, especially considering that everyone is speaking a foreign language but speaking about issues like race relations and gay rights. Phenomenal course!","I thought that my writing really improved throughout this course. In class conversations were very relaxed, and the class didn't focus too much on grammar, which was nice.","Dr. Chevant is amazing!  She really cares about all of her students becoming better writers regardless of their background coming into the course.  The course is extremely well-organized, and you learn a lot about different types of writing in French.","This is a great class! Dr. Chevant brings so much energy to the class that it is impossible not to become engaged in the subject. The homework, essays, and tests were all reasonable. You do have to put work into this class, but, as long as you do, the class will be a breeze.","Excellent class with great instructors. Your writing will drastically improve.","One of the best French classes I've taken at Harvard! Participation and speaking is highly encouraged, and its writing intensive, but you improve a lot on grammar and speaking.","Great course--just, please, if you are fluent (you know who you are) DON'T TAKE AN INTERMEDIATE COURSE! Really just not fair to the rest of us :(","This was an absolutely wonderful class, one of my favorites of the semester. It was a relaxed classroom setting that made learning french fun! The composition are not too difficult and Dr.Chevant will go over anything in your composition you want to know how to correct in office hours. Definitely would take it if you want to polish up your writing skills in french.","Not terribly challenging, just put a lot of effort and time into the blog posts and compositions and you'll be okay","If you are at all interested in improving your writing skills in French, I highly recommend that you take this course. Prior to French 50, I would say that I felt relatively comfortable speaking in French (I could get by on a trip to France), but I was terrified of having to do any writing. Over the course of the semester I went from writing ten sentence paragraphs about my home country to crafting two-and-a-half page argumentative essays.\nThe class itself was very enjoyable - you got a sense that everyone wanted to be there (unlike in some of the lower level language courses). Grammar exercises were very relevant and to the point, and we got more than enough practice integrating these into our compositions. Exams were very fair and students knew what to expect.","Dr. Chevant is a fantastic teacher who really puts in the effort to help her students succeed in the course. The class is very small and intimate, with participation required of each student. Overall this is a great way to improve French writing and speaking skills with a very manageable level of coursework.","If you want to brush up on your French and learn how to write an actual analytical essay in the language, take this class! There are lots of assignments and busy work, but overall it is very manageable if you stay on top of things. This class greatly improved my French writing abilities and also boosted my confidence in speaking. I highly recommend this class to anyone who wants to sharpen their French skills or prepare to enter a higher level French literature or business class.","I've taken three French classes here at Harvard (30, 40, 50) and while I loved all of them, this one was my favorite! It's difficult and demanding but also Dr. Chevant is SO helpful and encouraging and provides all the help you need. It's fascinating and you learn a lot of wonderful new words and ideas in French, and I thoroughly recommend it without hesitation. It's a lot more writing-focused than the previous courses, but you learn a lot and it's definitely worth the effort.","If you want to make huge improvements in your French writing and comprehension abilities in the course of a semester, definitely take this class!","This class is a solid French class in which you will have the opportunity to grow in your speaking and comprehension skills, but mostly, to grow as a writer. I was immensely satisfied by my ability in this course to write papers that I could have written in an English class and felt good about. Writing a poetry analysis in French? Immensely gratifying. Tali was an excellent TF, and her constant emphasis on the \"Champs Lexical\" has stuck with me in ALL my writing classes."]},"Spring '15":{"comments":["Overall great class! Tali is enthusiastic and gives great feedback on written assignments. The theme of the class is a little jumbled and each section does not really flow well but the topics are interesting and allow you to provide your own perspective.","I loved Tali, she is great and very enthusiastic. I think that class was great at giving you an insight on the french writing styles. Some of the activities regarding literary devices were a bit slow but later in the semester the conversations began to get more interesting because they dealt with more current social issues.","You will definitely practice your written French.","This class is a great way to continue in your discovery of french language and culture through writing. It will extend your writing ability and the level at which you can interpret and critique french writing.","It's a lot like a high school French class which is great if you want to do higher level work but don't feel 100% solid on things like grammar and vocabulary.","This course really helps improve your writing.","This is a great course and Tali is an amazing and very energetic lecturer. Although it is a writing-focused class, your oral skills can also improve through class discussions.","Very similar to French 40, so if you took that course right before, it's easy to check out and fall into a pattern of not doing much work or not being very excited about the class. Did not learn that much vocab, the grammar was also pretty repetitive, however there was a greater focus on writing. The class itself is good, but exercises where we come up with sentences in class can get boring. It is really what you make of it - try to use the writing assignments to improve and enjoy the writing."]},"Fall '15":{"comments":["Take it if you are up for a challenging French course!","You will not regret to have taken this course. Your writing skills writing skills improve greatly. Also, to do well in this course, you need to do all your writing assignment so that you can have time to revise your essays word by word. \r\n\r\nMatthieu is a big plus for this class, you will love him very much. He is very understanding and very flexible. Just know you are just one email away from him.","This is an excellent course if you want to improve your french. There is a lot of writing involved, but you will undoubtedly learn the proper way to write in French.  I could not be happier with my decision to take this course.","This course requires a lot more work than what meets the eye.  Not very balanced between positive and negative feedback.  I ended the semester discouraged; however, I did leave the course with a stronger vocabulary and a better writer.","Learning to write in French is such an important skill if you want to become proficient in the language. I came in with no writing background as a freshman, so I was the least prepared person in that class, but I would strongly recommend always challenging yourself in language courses. The curriculum was interesting, the support great, and the grammar reinforcement really helpful. My vocabulary and syntax are so much better now. You'll definitely be expected to speak in class because sections are small, but that component, although nerve wracking, also really helped. The TF is really good about correcting mistakes in an encouraging way.","This class was really great. Take it!","French 50 will teach you a lot about the French language and help you greatly improve your written french. You will definitely have to put a lot of effort into each assignment, but it will be rewarding.","It is a lot of writing, but also you really get to learn how to write fluently in French.","More work than you would expect coming from French 40","I developed my French writing skills in this class and became more confident in my speaking and more comfortable writing.","I liked it a lot and think it was good for what I wanted in a French course, but there was a lot of work involved and if students want to improve their speaking and their French use, this might not be the right class. This class is if you want to improve your formal writing and composition skills.","great class if you're comfortable with your french","This is a great course! Your written French will improve tremendously and the subject matter is very interesting. Really makes me want to pursue upper-level language courses in the coming semesters.","Take this class if you are interested in developing your writing skills in French.  It truly helps you advance your writing."]},"Spring '16":{"comments":["I thought the essay topics were comprehensive and interesting.","It is very helpful if you have a love for literature and poetry because that is a large component of the class.","Be ready to write a lot of essays and posts. Take advantage of the small class size to practice speaking in french.","A great introduction to more serious French language and literature.","I think your experience in this course largely depends on the TF. Much better with a native French speaker. Without, I do not feel like I learned much, especially relative to high school French.","This course is great. There are not too many assignments and it is not difficult as long as you put in the work. It's a very interesting course. You cover a wide variety of interesting topics. Your French, particularly your written French, will improve greatly from the course. You also learn a lot about French culture too.","This was a really strong class. All of the assignments seemed purposeful, and I really didn't feel like I was doing any pointless work or too much work. Yet I learned a lot both in class and out of class. If you are looking to work towards fluency in French, I would highly recommend this class!","Actually a very good French class. Tali Zechory made the class very engaging and allowed us to talk French a lot making it possible to really learn the language.","Take this course, especially if Tali is teaching. The workload is extremely reasonable, despite the fact that I had heard, before taking this class that there was \"a lot of writing\". There are a lot of opportunities to write, but I found that my speaking and listening skills also improved immensely during this course.","It's a really great class, the assignments are fun and interesting, and Tali is a really amazing TF."]},"Spring '17":{"comments":["If you're looking to improve your French this class will certainly help. You constantly have useful assignments and get valuable feedback. So, with that being said, the course is very time-intensive. On top of the \"dossier\" homework each class, you will often also have a blog or essay due. I think it's worth, it but it's good to be prepared for! Also, Matthew is fantastic - he ensured everyone in my class was involved and improving, and helped when times got tough!","This course builds off of the strengths of French 40 and will make you a better writer.","This is a great class if you really want to focus on improving your French speaking abilities.","This is a very great French class, especially if you enjoy different forms of writing.","I took this course to build up my writing chops and I would say this course definitely did that. The first month or so can be a little dry, but you read poetry and essays and it is overall very engaging. The small class size is also a plus, as you will have ample opportunities to practice spoken French as well."]}},"mostRecentQ":{"overall":"4.50","workload":"4.80","difficulty":null,"recommendation":"4.50","enrollment":"9","response rate":"66.67","QCourseOverall":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"0","2s":"2","3s":"3","4s":"9","5s":"8"},"QDifficulty":{"number":"FRENCH 50","course_id":"4381","cat_num":"22997","1s":"1","2s":"2","3s":"6","4s":"2","5s":"0"},"QWorkload":{"number":"FRENCH 50","course_id":"4381","cat_num":"126998","1s":"2","2s":"10","3s":"6","4s":"0","5s":"0"}},"success":true}