{"scores":{"Spring '17":{"course_score":{"overall":"2.30","workload":"3.80","difficulty":null,"recommendation":"2.30","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"2","2s":"1","3s":"2","4s":"1","5s":"0"},"QDifficulty":{"number":"BIOSTAT 297","course_id":"422","cat_num":"67195","1s":"0","2s":"0","3s":"12","4s":"2","5s":"1"},"QWorkload":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"1","2s":"1","3s":"0","4s":"1","5s":"3"}},"instructor_scores":[{"number":"BIOSTAT 281","cat_num":"126944","course_id":"422","year":"2016","term":"2","id":"d41166cd4540853019536a8e3ed76eaa","first":" Curtis","last":"Huttenhower","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"3.00","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.10","GivesUsefulFeedback":"3.30","ReturnsAssignmentsinTimelyFashion":"3.20"}]},"Spring '16":{"course_score":{"overall":"2.30","workload":"13.50","difficulty":null,"recommendation":"2.70","enrollment":"10","response rate":"60.00","QCourseOverall":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"2","2s":"1","3s":"2","4s":"1","5s":"0"},"QDifficulty":{"number":"BIOSTAT 297","course_id":"422","cat_num":"67195","1s":"0","2s":"0","3s":"12","4s":"2","5s":"1"},"QWorkload":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"1","2s":"1","3s":"0","4s":"1","5s":"3"}},"instructor_scores":[{"number":"BIOSTAT 297","cat_num":"126944","course_id":"422","year":"2015","term":"2","id":"d41166cd4540853019536a8e3ed76eaa","first":" Curtis","last":"Huttenhower","InstructorOverall":"2.50","EffectiveLecturesorPresentations":"2.70","AccessibleOutsideClass":"2.20","GeneratesEnthusiasm":"2.80","FacilitatesDiscussionEncouragesParticipation":"2.70","GivesUsefulFeedback":"2.40","ReturnsAssignmentsinTimelyFashion":"2.30"}]},"Spring '15":{"course_score":{"overall":"2.30","workload":"9.20","difficulty":null,"recommendation":"2.40","enrollment":"23","response rate":"78.26","QCourseOverall":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"2","2s":"1","3s":"2","4s":"1","5s":"0"},"QDifficulty":{"number":"BIOSTAT 297","course_id":"422","cat_num":"67195","1s":"0","2s":"0","3s":"12","4s":"2","5s":"1"},"QWorkload":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"1","2s":"1","3s":"0","4s":"1","5s":"3"}},"instructor_scores":[{"number":"BIOSTAT 297","cat_num":"126944","course_id":"422","year":"2014","term":"2","id":"d41166cd4540853019536a8e3ed76eaa","first":" Curtis","last":"Huttenhower","InstructorOverall":"3.20","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"1.70","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"2.90","GivesUsefulFeedback":"1.80","ReturnsAssignmentsinTimelyFashion":"2.00"}]},"Spring '14":{"course_score":{"overall":"3.30","workload":"3.00","difficulty":"3.30","recommendation":"3.80","enrollment":"18","response rate":"83.33","QCourseOverall":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"2","2s":"1","3s":"2","4s":"1","5s":"0"},"QDifficulty":{"number":"BIOSTAT 297","course_id":"422","cat_num":"67195","1s":"0","2s":"0","3s":"12","4s":"2","5s":"1"},"QWorkload":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"1","2s":"1","3s":"0","4s":"1","5s":"3"}}},"Spring '13":{"course_score":{"overall":"2.75","workload":"3.62","difficulty":"3.88","recommendation":"2.62","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"2","2s":"1","3s":"2","4s":"1","5s":"0"},"QDifficulty":{"number":"BIOSTAT 297","course_id":"422","cat_num":"67195","1s":"0","2s":"0","3s":"12","4s":"2","5s":"1"},"QWorkload":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"1","2s":"1","3s":"0","4s":"1","5s":"3"}}},"Spring '12":{"course_score":{"overall":"2.88","workload":"3.65","difficulty":"3.24","recommendation":"3.29","enrollment":"21","response rate":"80.95","QCourseOverall":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"2","2s":"1","3s":"2","4s":"1","5s":"0"},"QDifficulty":{"number":"BIOSTAT 297","course_id":"422","cat_num":"67195","1s":"0","2s":"0","3s":"12","4s":"2","5s":"1"},"QWorkload":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"1","2s":"1","3s":"0","4s":"1","5s":"3"}}},"Spring '11":{"course_score":{"overall":"3.08","workload":"3.85","difficulty":"3.77","recommendation":"3.38","enrollment":"19","response rate":"68.42","QCourseOverall":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"2","2s":"1","3s":"2","4s":"1","5s":"0"},"QDifficulty":{"number":"BIOSTAT 297","course_id":"422","cat_num":"67195","1s":"0","2s":"0","3s":"12","4s":"2","5s":"1"},"QWorkload":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"1","2s":"1","3s":"0","4s":"1","5s":"3"}}}},"comments":{"Spring '11":{"comments":["Come to this class only if you're very interested in computational biology. You'll learn a lot and enjoy it. If you just want to get credit or a high score from a course, this is probably not the good one, because it takes a lot of time to finish the assignment.","This is a wonderful introduction to the thinking and programming that go into handling large biological data sets.","This class could actually be very helpful, if you can follow...","For strictly hard science biology students, this course had no value.  This course did not enhance my biological understanding of anything, and was useful only to show me that I will need to hire someone to do any biostatistics I need in the future.","Take this course with caution. There are a lot of kinks that need to be worked out. This may be helpful if you have prior programming knowledge and want to see how programming can be applied to a number of different types of data sets.","Only take this course if it has been substantially changed and you have prior programming knowledge.","This class will certainly improve your understanding of programming and how to handle large data sets. The material is very introductory, but will give you a good sense of what methods and programs one can use to understand the data."]},"Spring '12":{"comments":["Can you do C? Matlab. eeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee","really good intro into using python to manipulate large data sets (and you don't need to already know how to program); a large chunk of the course is going over different kinds of biological data that is large scale (such as microarrays, sequencing, interaction networks, etc.) that is kind of boring for students with a good biological background; lots of assignments (10 programming problem sets, 1 group paper presentation, 1 group project and presentation)","Do not take this class. The second half is absolutely not worth your time. You spend countless hours downloading huge files containing data you don't understand, and then formatting these files to work with programs you don't understand, to produce figures you don't understand. Lectures are not helpful with the problem sets, and meander from topic to topic with no particular logic. This class will leave you even more confused about bioinformatics than you were when you started.","Very difficult if you aren't a computer science person. A ton of work.","This was a good class, overall. It is hard to teach a bioinformatics class because there is no set curriculum and Curtis did a good job. However, some of the biology lectures are too rudimentary for biology grad students.","Be prepared to spend considerable time working on the assignments and final project, but in the end, it will be some of the most practical, hands-on training in bioinformatic tools and analysis that can be obtained outside of working in this field.","lot of homework"]},"Spring '13":{"comments":["I think you can learn a lot from this class, but you definitely need to put in the effort. There are not many assignments or feedback to give incentive to work hard, but if you have many questions and want to learn - Curtis has an incredible amount of knowledge and is great at explaining things.","Great material that's carefully prepared to be as relevant and engaging as possible, but very time-consuming. I lost motivation towards the end of the course.","Listen to all the comments. Do not take this class. If you are a programmer, you will be bored by the programming aspect and confused by the biology. If you are a biologist, you will be bored by the biology and confused by the programming. If you are a biostatistician, you will know all the biostats are wrong and not know how to fix it."]},"Spring '14":{"comments":["The first half of this course is great - good intro to quantitative methods, good intro to Python. The problem sets are really well done (for the most part) and help you actually learn Python.\r\n\r\nHowever, the final project and journal club presentation are very disorganized, with the goalposts shifting all the time. This part of the course was neither very helpful or fair and served to sour the whole experience; I would not take this course unless there have been updates to how the final project is handled. (For example, you turn in a proposal for the final project before starting and have to have it approved. Having exactly what you were doing and the way you were doing it does not mean, however, that the professor won't ask you why in the world you would do it that way during your presentation and then have you re-do everything. You won't know what is expected of you until right before something is due.)","You will need to invest a significant amount of time, but the things learned in this course will be very useful as future researchers","you need to spend a lot of time with figuring things out on your own if you want to get something out of it","They should be comfortable with programming so prior programming experience would be good.","The first half is very useful.  The second half (as it currently stands) is not.","This class is a great class for getting an introduction into computational biology and bioinformatics. However, it must be stressed that the course is structured to be like a \"buffet\" line, covering a wide variety of subjects with only moderate levels of depth. Nonetheless, it provides a good starting point for anyone interested in integrating modern computational biology\/bioinformatics into their own work.","If you want to effectively learn Python for biology, this course is for you. But there are some things that will be boring\/useless to you because the course covers a lot of ground."]},"Spring '15":{"comments":["Start the problem sets early and study Python prior to beginning the class.","This was a very poorly-run, poorly-taught, and poorly-organized course.  Dr. Huttenhower was a good lecturer, but he left after only four weeks, leaving Dr. Morgan in charge.  Dr. Morgan's lectures were very difficult to follow; she is not a good public speaker, as a result of which many people stopped even showing up for class.\r\n\r\nThe workload is simultaneously too much and not enough.  There were ten problem sets, a journal club, and a final project, which is a bit absurd.  It was impossible to make a really good final project with that much other work to do immediately beforehand -- if they really want good projects, there needs to be fewer other assignments.  The problem sets are relatively easy to get through without actually understanding the subject matter, which is unfortunate: the Python parts are all fill-in-the-blank, which makes them very easy but also makes it possible to finish them without really learning anything.  In addition, the assignments frequently had out-of-date or inaccurate instructions, which could make homework very painful.\r\n\r\nI was also very frustrated that I felt that when I had questions, I could not get reliable and accurate answers from anywhere; when I asked the professors, it didn't seem like they really understood what I was asking and didn't give me the answers I wanted.","The teaching team is committed and accessible. The first half of the course was very good - useful in teaching the basics of programming languages, and how to use Python to handle data. The second half of the course was a broad survey of bioinformatics tools - this focused too much on experimental biology techniques, which was perhaps too basic for the biologists in the class. There was perhaps insufficient coverage of the practical aspects of how to handle genomic data. The assignments were useful towards this end (and in learning how to programme and use bioinformatics tools), but class time could have been more effectively used to demonstrate the manipulation of genomic data. Expectations for the final project were not particularly well-defined, which presented difficulties while working on the project. Lab sessions were short for the most part, and could have been more effectively utilised to cover practical aspects of programming and data handling. I would recommend the first half of the course for learning programming and Python.","This course provides little guidance on the software used and covers many software packages very superficially. Many of the covered topics will not apply to your research. Your time would be better spent teaching yourself only the tools you need for your research.","This class is a really great introduction to programming and techniques in genomic data analysis.  Expect it to take a lot of time-- getting basic fluency in a programming language is always time consuming-- but you'll walk out of it with an excellent toolkit.","Audit the course and do the first half.","If Curtis is teaching it, go for it. If not definitely stay away.","Challenging but you learn a lot! Especially if you put the time into the problem sets.","The instructor did not show up to class.  The lectures are largely unhelpful and outdated.  If you do not know how to code you will not learn from this class.  You're better off using online resources to teach yourself.","I would tell them that the first third was a great introduction in to the kind of python and unix coding that is helpful for manipulating genomic data.  The 2nd third of the course is a very broad summary of all the different ways that genomic data can be measured and analyzed.  In this section of the course, you might learn the name of a program that you might find applicable to your research, however you won't learn anything in-depth enough to apply to your actual research (for this you'd have to teach yourself via online tutorials\/asking friends etc.)  The final third of the class was spent listening to student group presentations, and in my opinion was not the best use of class time (though I do appreciate the group-project component of the class).  I would have preferred the class to be more in-depth about the subject matter rather than listening to student presentations.","You learn a lot of basics. If I had to tackle some of these big datasets in my own research I'd have a much better jumping off point than I would if I didn't take this class, but it would still require a ton of work figuring something out on my own. Even something super basic would be difficult to figure out because we only learned certain tools in very specific settings, were told what options to select and were given most of the python script needed. I would need to practice a lot more to be even a novice and that is frustrating because I already put so much time into this course.","DO NOT TAKE THIS COURSE. You will spend lots of time in painfully dull and unhelpful lectures, followed by lots of time on finicky details on problem sets from which you will learn next to nothing.","The foundational concepts taught early in the course were great.  They were presented in a carefully thought-through, non-intimidating way.  The chalk talk format was very engaging and made the material approachable. I hope that the second half of the course will be rethought.  It has a lot of potential, as obviously genomic data manipulation is a very hot concept and everyone would like to know how to wield these tools.","The first half of the course is great if you want to learn the basics of programming in Python. You won't learn anything else besides that.","This course will teach you nothing about genomic data manipulation. You're better off just using the internet to find the tools you need. Curtis will never be there and the second half of the class will be absolutely horrible. Please don't take this, there are much better ways to learn about coding and genomic data."]},"Spring '16":{"comments":["The course is a joke, I'm sorry you HAVE to take it, and good luck!","This course gives a good overview of several topics and strategies but if you plan on doing some type of data manipulation it may be best to just go to the new\/best available tools and learn them on your own. The course covers so many topics that it is forced to be a bit broad and we don't learn as much on real world programs that should be used like those in the final project.","Plan your schedule so that you can spend plenty of time outside of class on the problem sets and projects. Especially if you do not have a background in coding, this may likely be one of the most challenging classes you will have in graduate school. Also, take advantage of the office hours as they are very helpful."]},"Spring '17":{"comments":["an introductory class to R or python, or a directed course will be more useful.","Only expect to learn the basics of Python. You'll be exposed to Python, but you won't actually apply what you've learned. You'll basically just see it.","Very useful, especially if you're completely or mostly new to coding. The final project can be a bit frustrating in its amorphous-ness (is that a word?), but overall the class is definitely worth it.","This course is very unorganized and not very relevant. It is good for someone going into a microbiome lab, but not really for anyone else. There is a little bit on RNAseq, but it's mostly theoretical. You won't learn how to use any useful bioinformatic tools, not even something like seqIO. I guess it helps understand how these tools work, but it would be more useful for most people to learn actual practical workflows for sequencing data.","Do not take it unless the format of this class is changed to having students writing their own code."]}},"mostRecentQ":{"overall":"2.30","workload":"3.80","difficulty":null,"recommendation":"2.30","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"2","2s":"1","3s":"2","4s":"1","5s":"0"},"QDifficulty":{"number":"BIOSTAT 297","course_id":"422","cat_num":"67195","1s":"0","2s":"0","3s":"12","4s":"2","5s":"1"},"QWorkload":{"number":"BIOSTAT 297","course_id":"422","cat_num":"126944","1s":"1","2s":"1","3s":"0","4s":"1","5s":"3"}},"success":true}