{"scores":{"Spring '17":{"course_score":{"overall":"4.30","workload":"3.40","difficulty":null,"recommendation":"4.30","enrollment":"35","response rate":"82.86","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}}},"Spring '16":{"course_score":{"overall":"3.90","workload":"4.70","difficulty":null,"recommendation":"4.00","enrollment":"29","response rate":"82.76","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}}},"Fall '15":{"course_score":{"overall":"4.20","workload":"4.40","difficulty":null,"recommendation":"4.10","enrollment":"37","response rate":"83.78","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}}},"Spring '15":{"course_score":{"overall":"3.60","workload":"4.10","difficulty":null,"recommendation":"3.80","enrollment":"41","response rate":"85.37","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}}},"Fall '14":{"course_score":{"overall":"3.80","workload":"4.50","difficulty":null,"recommendation":"3.70","enrollment":"29","response rate":"79.31","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}}},"Spring '14":{"course_score":{"overall":"4.30","workload":"2.20","difficulty":"3.20","recommendation":"4.40","enrollment":"49","response rate":"81.63","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"FRENCH 30","cat_num":"36981","course_id":"4379","year":"2013","term":"2","id":"f6c79eed4fe81d56db624f228deb2e2e","first":" Carole","last":"Bergin","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Fall '13":{"course_score":{"overall":"4.10","workload":"2.10","difficulty":"3.00","recommendation":"4.20","enrollment":"34","response rate":"97.06","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}}},"Spring '13":{"course_score":{"overall":"4.09","workload":"2.16","difficulty":"2.80","recommendation":"4.18","enrollment":"62","response rate":"88.71","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"FRENCH 30","cat_num":"36981","course_id":"4379","year":"2012","term":"2","id":"f6c79eed4fe81d56db624f228deb2e2e","first":" Carole","last":"Bergin","InstructorOverall":"4.92","EffectiveLecturesorPresentations":"4.83","AccessibleOutsideClass":"4.83","GeneratesEnthusiasm":"4.92","FacilitatesDiscussionEncouragesParticipation":"4.91","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.91"}]},"Fall '12":{"course_score":{"overall":"4.07","workload":"1.91","difficulty":"2.78","recommendation":"4.20","enrollment":"48","response rate":"95.83","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"FRENCH 30","cat_num":"36981","course_id":"4379","year":"2012","term":"1","id":"f6c79eed4fe81d56db624f228deb2e2e","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '12":{"course_score":{"overall":"4.43","workload":"1.95","difficulty":"2.83","recommendation":"4.40","enrollment":"51","response rate":"84.31","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"FRENCH 30","cat_num":"36981","course_id":"4379","year":"2011","term":"2","id":"f6c79eed4fe81d56db624f228deb2e2e","first":"Carole","last":"Bergin","InstructorOverall":"4.75","EffectiveLecturesorPresentations":"4.78","AccessibleOutsideClass":"4.89","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.86","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '11":{"course_score":{"overall":"3.88","workload":"2.12","difficulty":"3.14","recommendation":"4.00","enrollment":"47","response rate":"93.62","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}}},"Spring '11":{"course_score":{"overall":"4.16","workload":"2.16","difficulty":"2.92","recommendation":"4.16","enrollment":"62","response rate":"80.65","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"FRENCH 30","cat_num":"36981","course_id":"4379","year":"2010","term":"2","id":"f6c79eed4fe81d56db624f228deb2e2e","first":"Carole","last":"Bergin","InstructorOverall":"4.83","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.91","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Fall '10":{"course_score":{"overall":"4.17","workload":"2.04","difficulty":"2.89","recommendation":"4.40","enrollment":"52","response rate":"92.31","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}}}},"comments":{"Fall '10":{"comments":["Be prepared to do a lot of outside work in order to come to class fully prepared. Not necessarily difficult work, but there is a lot of footwork to be done.","There isn't too much work if you already understand grammar very well. The grammar is taught very quickly and treated as a review so if you do not know it already it can be difficult to keep up with the work. The in class experience is great because there are a small number of students so everyone can get better at speaking without feeling intimidated. Anne is very helpful and is willing to work with anyone who needs extra help.","Great way to ramp up your spoken french and to dispel any stereotypes you might have about France and francophone countries.","It takes a lot of work. You won't get a lot of long assignments, but you will get many small assignments that you have to keep on top of. There are also hour long conversation sessions that you have to attend, so keep those in mind. Overall, I think that the class is taught very well. It was something I looked forward to during my day.","This is a very useful class for working on oral skills. However, it involves a lot of work and dedication to practice.","I think that Franck is an amazing teacher. He is very enthusiastic and helpful at all times. Yet, I felt like many requirements and assignments were quite useless.","This class has so many different components (Chat, blog, video\/audio submission, grammar quiz....) that sometimes it is hard to keep track of all of them. Also, a lot of the materials in the class go untested so you will learn only if you try to push yourself.","This course was set at a great level for me, coming from a background of many, many years of having taken french without making much improvement. I think it's a great way to get a comprehensive review of the language before jumping off into other courses. There was a considerable workload however, so if you put a lot of effort into the language placement test to barely pass it, I would think twice about taking French 30.","Students interested in pursuing French should definitely take this class. That material is interesting, and the grammar review is invaluable.","You improve tremendously over the course of the semester, especially in regards to speaking. And best of all, you are immersed not only in the language but also in the issues and social debates of francophone countries. This course helped me develop a whole new perspective on the world and what it means to be a part of an international community. Take this class!!!","pray that you get Franck. he's simply awesome.","Very discussion-based. The work is sometimes tedious, but manageable. There is a pressure to perform during discussions, though, so they can sometimes be stressful.","A lot of interesting materials and an amazing TF","The course was good, it focused a lot on pronunciation which was great. There is a lot of work that is all separate and rather random, the structure of the class was a bit disorganized but I learned a lot from it and it was a good French instruction class.","This class is a lot of fun because you get exposed to lots of forms of French media, and then it is interesting to discuss the topics in class.  The intimacy of the small class helps your willingness to participate, improving your conversation skills.","It's a fast paced course, and it definitely helps to stay ahead of the homework.","This course is extremely interesting and fun!","I had not taken French since my sophomore year in high school and was very rusty. This class was an incredibly effective refresher. I am very impressed by my increased proficiency. It is a lot of work so beware but the work is not that difficult, so in sum it was pretty manageable.","There is a lot of work involved, but if you're dedicated you could get a lot out of it.","This was a good French class- not too hard, good communication between TF and students. While the work isn't hard, there is a lot of it. Many day to day assignments and larger ones as well.","it is a lot of work but you will truly get out of it what you put into it.","It's a crazy amount of work. But if you want to improve your French, then you just have to do it!","Franck and thhe other TFs are excellent. This course is not only well taught, but there are multiple resources, such as an online chat, discussion board, tutoring center and movie nights to help improve literacy. It is an excellent course which I thoroughly enjoyed.","The syllabus is perhaps a bit outdated and some of the activities could be improved upon, but the teaching is great. You can't go wrong.","Make sure you do all the reading in the textbook! The grammar may be familiar, but idiosyncratic phrases, prepositions, uses of different kinds of pronouns - this is all important and confusing stuff that this course will help you master if you put in your own work! Have fun with the creative assignments - they're a breath of fresh air when you're doing a lot of review\/memorizing\/etc.","This is a good course to take if you want to continue to improve your Frenc oral skills and understanding of French grammar. I really did like learning more about French culture by listening to songs, watching videos, and reading newspaper articles. Watch out for the required hours of conversation outside of class and the chats and discussion articles. They weren't explained properly in the beginning causing a lot of confusion. The conversation hours were also seemingly thrust upon us out of nowhere. Other than that, it's a good course.","It is a great class, but a lot of work. If you do it all you should do fine, just be prepared. There is a lot of work outside the class that is not made clear on the syllabus, like discussions in Ticknor or news program watching."]},"Spring '11":{"comments":["Keep track off all of the little assignments!","This class is a lot of work. It's pretty effective at improving your French though. It's definitely easy to manage if you are taking 4 classes, but it's a little difficult if this is a fifth class.","While overall this was a great course, there is a lot of work outisde of class that isn't immediately apparent from the syllabus.  It seemed like there was constantly something to do for French, so don't take this class if you don't have a lot of time to devote to it.","there will be some infuriating assignments and the occasional two week period where you are spending 15 hours a week on the class, but that sounds worse than it is. improves conversational french immmmmmmmmensely.","It's a lot of busy work including memorization of long dialogues.","There are a lot of assignments and you need to be conscious of all of them, or you could forget to do them because they'll not all written on the syllabus. Overall this was a great class I would highly recommend. Listening and understanding skills in particular improve remarkably.","The professor is exceptional!","It's a great class to help you move towards fluency.","From what I could tell, this made for an excellent refresher course for those looking to get back into speaking and writing French. However, someone with even a little more experience and comfort with the language may have felt more challenged and rewarded in a literature class.","This class has a great section component and an enthusiastic teacher. Unfortunately, it also comes with some assignments that might not achieve their intended purpose. Video recordings of \"extemporaneous\" speech must be written out before hand and virtually memorized if one wants to weather strict grading of pronunciation and grammar. You may find yourself practicing memorization more than spontaneity.","This class is an engaging and productive manner in which to continue with study of the French language","This class was very interesting in analyzing different forms of French media and politics and comparing it to American media, journalism, and politics. It was great to keep up on current events. You will gain confidence in speaking French and developing your opinions on international affairs as well as expressing them in French.","too much work, but in theory a good class.","This is a fun, engaging class- the assignments are easy and actually quite enjoyable to complete (you film mini-movies, record a radio broadcast, make an advertisement, etc.), and the instructor is energetic and brings a lot of enthusiasm to the classroom each day.","A nice, stress-free language class.","It's a fun, creative class!","Varied, enjoyable class, with a reasonable workload. Can spark a true enthusiasm for french media and culture.","A good course for working on oral french (perhaps the best at Harvard?), but tend to think quite time consuming vs. the level of payoff.  Would have preferred less \"creative\" assignments (memorizing movie scenes, doing a fake radio interview, etc.) in favor of more reading, watching movies, and in depth discussions.","Try as best as you can to keep on top of the things like article discussions. Class is fun but a lot of the assignments are tedious.","stay on top of all the work and all the activities because it is easy to fall behind. other than that, its a great class, and kind of relaxing (at least compared to premed requirements).","you will not get an easy A","If you need a grammar review, take French C. If you are torn between French 30 and French 40, I definitely recommend French 30. It's fun and you learn an incredible amount from it.","I had a great time with this course, found myself learning so much in every session, and LOVE the way that it incorporates media.  Such a wonderful, wonderful course.  It's fun, useful, and interesting.  You cover topics from current events to culture.  You talk about cities and what people do for fun to rap and hiphop.  Such a great class.","Wonderful teacher, interesting material, but just a lot of daily work.","TAKE IT!!!","This course is a wonderful way to learn French through news articles, radio programs, and television clips. However, it is often hard to be certain about what all of the assignments are, as the course seems fairly disorganized. The organization makes the class far more stressful than it ought to be. I would definitely recommend checking ahead on the syllabus and clarifying assignments far before they're due.","great class to improve speaking abilities.","take it. it's easy, and it's fun. there's a lot of busy work (more than i expected) but it's not difficult.","My ability to read French, to understand spoken French, and to speak myself improved in leaps and bounds. This was the most engaging and immediately useful class I have yet taken at Harvard."]},"Fall '11":{"comments":["Lots of conversation involved as most of the grade is based on oral skills. Be prepared to participate a lot in a bunch of different types of exercises.","Your oral language skills and vocabulary will improve but you won't really know how you are doing grade-wise through a large part of the course.","This class is a lot of fun if you put in the effort.","This class is a good review of the French language, with a specific emphasis on grammar and culture. While my section was a bit unorganized at time, I feel like I've come out of it with more fluency!","Get ClÃ©ment! He's awesome. Also, this is a good course to brush up on your French.","French 30 is an awesome class. You get to look at some of the most important social and cultural issues in the French speaking world, and you get to hone your speaking, listening, and comprehension skills.","Many many small assignments that take up time, it's exhausting. You will inevitably get better at the language, if you're willing to sacrifice a lot of time then go for it.","This class was amazing. We learned in innovative ways, with songs, articles, basically by exploring all the medias available in francophone countries. I would recommend it to anyone, not just because of the course in itself but because of the instructor. Maybe this is applicable to everyone in the Romance Languages Dept., not just Morgane Kieffer, but she managed to awaken our interest and was what a true teacher is supposed to be: kind but firm when it comes to completing assignments, very enthusiastic - generating a lot of interest for the French Language.","This class is very challenging in terms of workload, while the assignments themselves are not terribly challenging. I feel that my proficiency has improved markedly over the course of the semester, a testament to the effectiveness of the course.","There's a lot of work involved","I came into this class not having taken French for 2 years. My speech improved tremendously and I also freshly reviewed grammar and writing. Also, Morgane is awesome, a very engaging TF!","Definetely take it if you can commit the time!","A great advanced french language course that focuses heavily on speaking and listening skills without neglecting writing as well. Expect class participation to be very necessary and expected, but also great fun. A great way of experiencing french language and culture, as well as developing one's own language abilities. With the right attitude and a certain amount of work, expect great improvements in one's own ability to converse in french.","Great course if you want to practise your speaking skills and if you want to review what you already know. Not so great for learning new grammar (although great for widening your media vocab).","In class can be a lot of fun, while out of class can be quite annoying.  Regardless, as with most language courses - but especially this one - you get out what you put into it, and not much more.","It can be a lot of work at times, but the class itself is pretty fun, and you'll come out of it with MUCH-improved speaking and comprehension skills. You'll get a lot more out of the class if you actually speak up in class!","This is a fantastic language course.   I would highly recommend it to anyone wishing to continue their studies of French - after all, Harvard language courses are the best in the world.","TFs can make a big difference.","Fantastic class. Morgane is an absolutely wonderful TF. The grammar units are a bit rushed, but overall, I definitely learned a lot more than I expected!","make sure you get a good teacher.  and be prepared to spend more time on the course than it is worth.  but your french will improve.","I would recommend French 30 for students with prior background in French who want to improve their speaking\/presentation skills. In terms of grammar, the course requires you to study and learn it more or less on your own schedule and effort.","There are quite a few small assignments","This is a great course to learn about French culture and to improve your French."]},"Spring '12":{"comments":["If you like journalism and french this is the perfect class for you. You get to learn about the francophone culture from a very interesting perspective, the media.","Superb class to learn how to use French like a native and to get a good initial exposure to different facets of the culture.","An awesome class! It takes work, but it's not entirely difficult and it's a fun opportunity to learn and practice your French. Morgane is an awesome TF who really brings the class together. :)","I would tell future students that this class is perfect for those students who have never gone beyond merely attempting to learn the french language, but who would like to. This class definitely stresses the language component, but because the class has a theme, french media, you learn about the language in an interesting, novel way.","This is a great class. Professor Bergin is a great professor and makes the class fun. She integrates a lot of interesting French media and culture. There are, however, other section leaders and I do not know what their teaching styles were like. But if you get Professor Bergin then she is great!!!","The choice of French 30 versus French 40 largely centers around your confidence concerning grammar.  Much of French 30 is complete review of basic grammatical points, but then accompanied by more advanced reading and listening\/viewing materials.  If you are satisfied with your grammatical progress, then move on to French 40 (if you have the time).","this was a really fun, engaging class! Matthieu is a great TF.","you work, but you learn french.  the TF's are pretty fantastic.  DON'T take this as a 5th class, because that's dumb, and you're not dumb.  You'll be way further on your way to fluency.","I really enjoyed this course. It's much more interesting than French C. The course materials are really fun. You look at a variety of types of media. I had a great TF, Morgane, who was not only a great teacher but very enthusiastic!","Lot of fun to have a smaller class you are encouraged to talk in.","Don't try to take this as your easy class! Granted, I really enjoyed it a lot, and Carole is one of the best instructors I have ever had, but be forewarned that there is a lot of work involved. But it is lots of fun, and I came out of this class feeling that I have learned a lot.","It's a great class, well structured, and you get to practice speaking french a lot more than in the other classes","Take it!","Carole is wonderful.","Immerse yourself dans la vie!","I think that this course is good to take if you plan on studying abroad in France, or going to France.  This course will not make you fluent or even proficient, and is probably a waste of time to take if you don't plan on doing more with French in the future. But its extremely easy, extremely enjoyable, and lots of fun!","This is a great course! It's a very good way to improve your French in a fun environment. It wasn't too much work but make sure you keep up with your work. And definitely do all the reading and watch the French news because it was really cool!","Morgane is AMAZING! Best teacher ever.","Great course, just be aware of the tedious assignments.","This class is very unstructured, which also means it is fairly easy. Your speaking abilities and vocabulary will improve a little, but your grammar will be the same as when you left French C. At the end of the day, I feel like my time could be much better spent with a more rigorous language class. This class also has a lot of songs, which are not helpful at all.","Best French class at Harvard","This class drastically improved my speaking and listening skills. While there is some busy work, overall, it was worth it to overall improve my french language skills. I think the best thing about French 30 was the environment in which discussion was not a tense activity but encouraged by the teacher and something in which every person participated with worrying about making mistakes.","This class actually requires quite a bit of work. We are required to read a lot of articles and watch some TV shows that are actually quite long.  However, if you are willing to put in the effort, this class can be very rewarding.","it isn't that difficult if you put the time into it","Expect a lot less handholding than you might have received during previous French classes at Harvard. The TFs are incredibly helpful and give you extensive feedback, but you should expect to work much harder than you might have had to for during French levels A through C. With that said, the material covered in class is very relevant and interesting, and section is helpful and fun.","This course is a very good way to practice speaking French to reinforce your confidence and abilities."]},"Fall '12":{"comments":["Go to office hours, it really helps. And don't be afraid to speak in class. They won't judge you if you have poor skills. It's the only way to improve,","This is a wonderful class where you are really immersed into french culture and traditions pertaining to the media. It was a lot of fun and Jeremie is super nice and a wonderful preceptor.","This class would be best taken with a very strong background in grammar as the main focus is with oral and listening skills.","Skip French C for this! It only meets twice a week, but you also do so much more. Instead of constant grammar drills, you get to read articles, watch TV, listen to the radio, etc. and just talk about it. It's fun, and my French improved greatly after having come out of French Acd. One word of warning: the class is more work than it appears at first as weekly\/biweekly assignments start to stack up. Also, grading can feel slightly arbitrary. Still, great class. Also, Maxime Triquenaux was an awesome instructor, but I don't think he's going to be around much longer since he's visiting from France.","I have had a lot of wonderful language instructors in the past, but Morgane by far the best language instructor I have ever had. Her enthusiasm, style of teaching, and genuine care for her students really contributed to my overall learning process. I get really nervous when it comes to speaking French and I feel like this class really helped build the confidence necessary to continue with the language. I also learned a lot of grammar and improved my pronunciation! It is a lot of work on a weekly basis, but I still completely recommend it! The work is fun and you really see yourself improve over time. I could really go on forever about how much I loved this class!","Do it!!!!! Such a good class, I learned so much French :))))))) Morgane is awesome!","Maxime is a great teacher! I enjoyed the class a lot, just because of him.","This is not a very well-run class. My TF (Morgane) did her best with the class structure, but most aspects of the class are pretty bad. The Skypes with French graduate students in Strausbourg are awful because they are generally conducted at 7 in the morning.","I really enjoyed French Ab and French C, but I felt completely different about French 30. The assignments were redundant and weren't very engaging, and I didn't learn much from them- a lot of busy work!","Maxime was a great section leader and made French much more enjoyable than I thought it would be, after my not so great French expereiance last year. The TF matters!","The TF's are very good, very approachable, friendly, and charming.  Maxime is a very entertaining teacher.  The assignments are fun and creative, the textbook is all in french and has lots of example sentences.  You do grammar review, make radio, TV emmisions, record yourself reading, and explore french media: comics, journal articles, songs, TV, reality TV, etc.  A fun and interesting course in which you get to express a lot of your own political opinions.  Take advantage of RLL tutoring and french table--both great ways to practice dialogue.","poorly organized","I really enjoyed this class. I came into Harvard having placed out of French but decided to take this class after about a year and a half away from the language. The course is really focused on French media so we listened to a lot of songs\/video clips\/the radio and read lots of newspaper articles. The other major focus in the class is on grammar. There were a lot of different assignments in this class throughout the semester including making videos or audio recordings of ourself, interviewing a French speaking person and being recorded in an actual recording studio, and reenacting a scene from a movie with a partner, among other things. These assignments could be a little frustrating but they were usually pretty fun. There was a good deal of partner work in the class so be prepared to have to meet up outside of class. This class was also the first time I really got to work on my French accent, since my TF was actually from France. If you do take this class, hopefully you will have Maxime because he is awesome! All in all, I would recommend this class to those looking to continue with French at Harvard.","French 30 is an interactive and fun class in which you can really practice to express yourself in French. There is a good balance between grammar review and speaking exercises.","I would tell future students that they will learn a lot and improve their fluency, however, they must be prepared to work for this. This class takes a lot of work but it pays off in the end!","This is a fantastic course!! By the end of the year, you will be comfortable having a conversation, presenting, and debating in French simply because of the teaching methods and class time devoted to speaking and cultural issues.  I'd recommend this to anyone interested in French culture, media, and politics.","It's a lot of homework for a relaxed class","It is a good review of French grammar while being an interesting course that you can learn form.","A lot of busy work, but a fun class nevertheless.","Maxime is the best ever!!! He absolutely makes this class. Because of him, it is fun, laidback, enjoyable, pleasant, but you also learn a lot about French pronunciation, grammar, and media.","Do it if it makes sense for you, but I don't feel like there's any essential grammar you'd miss out on by not taking it. Good if you're interested in media and things like that, or practice with your oral skills.","This course greatly improved my French speaking and listening skills and was fun as well - from singing French songs to watching\/listening to French media. If taking this course, be prepared to be hit with a lot of French. There are regular homework assignments which are do-able but numerous.","It is very engaging and there is a lot of work. Don't mess around, but if you love French and want to know it better, take it.","Very good class if you would like to improve your speaking skills but do not take it as the extra class. It has and requires a lot of time commitment","To be prepared to work hard and do a lot of busy work.","If you put in the work, your french improves at an enormous rate.","This course is wonderful. I was really nervous at first because I didn't feel like my French was good enough for such a discussion based course, but it's such a supportive environment that I gradually felt more and more comfortable participating, which helped my oral skills quite a bit. The topics are really interesting as well; I ended up learning quite a bit about current events in the US and the rest of the world, not just in France. Overall, this is a course that you won't regret taking; everyone in my class (myself included) improved SO MUCH over the semester.","This is a fast-paced, engaging class. Take advantage of the many assignments and enjoy them to get the most out of the class. Assignments, like recording podcasts, make speaking and interacting with the language interesting and enjoyable. Gives you a strong review of grammar, but is not boring and does not only focus on grammar. The class's focus on an analytical approach to media can be applied in any language or culture, so it is a widely applicable course.","Very good class. Some projects are really fun! There is, however, a decent amount of work and some of it feels like busy work.","Be really, really, really sure you are prepared for this course. I felt sorely unprepared and this course was an uphill\/downhill battle all the way. The hardest part is the pronunciation (proper, correct pronunciation that is) and so be sure you can do this. I spent a lot of time on the course, but with a not-so-stellar foundation, it still felt difficult. Otherwise, you do learn a lot about French and global culture and learning to articulate your thoughts in a foreign language on real issues is an important skill, whether in French or otherwise.","I don't really enjoy speaking French, so I did not benefit much from this class. I took 7 years of French before this, so to me it seemed like more of the same. That being said, if you approach section with a positive attitude and make an effort to speak in class, you can improve. One very important thing they focused on that had not been emphasized enough in any of my classes is pronunciation. It is very helpful to your speaking ability if you try to practice pronunciation (mainly of the letter r.)","The materials are old and sometimes very boring. But the discussion structure is really helpful and some assignments (like the radio broadcast and some acting scenes) give you a fun way to get a good grasp on the language. The homework is busy work and if you've taken French C it's really just a grammar review. I still recommend it if you want to get better at speaking - but some of the written work is just obnoxious and feels like a waste of time. also the technolgy is constantly messing up - but you do get to read some french newspapers and learn some fun culture things. All in all a solid B of a class. Jeremie, however, is a fantastic TF. He's fun and smart and tries to do the best that he can with the course that he has. Try to get him.","This class is an excellent class to improve your French speaking ability by discussing relevant topics.  The TFs are great and the work is not too difficult.  I would highly recommend.","If you want to improve your French and your knowledge of French things, there's no reason not to take the class, good conversation and not too much busywork (other than what's unfortunately necessary for language learning)","This is a great class if you're looking for oral french and a good review of french grammar. Make sure you feel comfortable speaking in class, and for long periods of time as there are important oral exams. All of the TFs are FANTASTIC."]},"Spring '13":{"comments":["I think all language classes highly depend on your tf. Switch sections if you dont like him\/her!","Best French language class I've taken so far at Harvard. All the exercises felt useful and I really gained a better understanding of the language.","French is a very important language in working environments. Carole is an excellent teacher, really committed to the class and to the learning process.","This is a good class, but adds nothing new if you have already taken French C.","Unfortunately, you don't have other options for French classes. I wish I had shopped French 40 and skipped this, however.\r\n\r\nThe course is not difficult (much easier than French C), but you will spend a lot of time doing work that will not help you speak or read French. My improvement in French has been minimal--perhaps nonexistent. This class left me disappointed.","This was a great class for improving speaking ability. Maxime was an amazing TF and really made the course a lot of fun. Some of the audio and video assignments were a bit annoying, but overall there wasn't that much work. It's a good French course, especially for those still looking to improve speaking and grammar.","The class is a lot of fun, but be prepared to spend an inordinate amount of time on the homework and various video assignments.","French 30 is a great class for improving written and oral french in an interesting, casual manner; however, you do have to put in the time and work to do well on assignments. Pay attention to detail! The songs and projects were fun, though time-consuming.","The class is not hard but can have some annoying projects with partners.","This class is great, my conversational French definitely improved. It's a lot of gain without a ton of busy work.","Take it with Maxime as your teacher!","This is a fun class, and Maxime was a delightfully energetic TF. Some units are especially fun--\"Ma Nuit Chez Maud\" in particular. However, the class does have a lot of busywork. It's a lot of scurrying around for minimal payoff. The emphasis of the course is definitely on pronunciation, so work hard on that!","This class can be stressful and frustrating because the directions for assignment are often unclear, and would be very simple if someone just explained how to do them.","Useful in becoming accustomed to French media and to further language grammar skills, but don't take it for fun--the assignments take a long time, often don't have to do with grammar\/vocabulary, and involve group projects on short notice that become annoying to schedule.","It's more time than you think it will be. Be prepared for a lot of random assignments","It's an alright class, but Maxime really makes it worthwhile. You'll need to do a lot of work (writing, speaking) and a lot of learning if you want to improve. Take it if you want your French to get a lot better!","Even if you satisfied the language requirement, language courses are done here incredibly well. French 30 is no exception, and it's a ton of fun and a good mental exercise to practice working with another language. The video and recording exercises take a while, so be sure to plan for them in advance.","This class is fun. A lot of fun, and you learn a ton about France and French culture. You also will easily improve at speaking.","Course really improved my speaking, reading, and writing skills. Very good for those who want a review of key grammar concepts as well as work with a range of primary sources from French media during the process.","If you are expecting a drill-style instructional course - go to C","Overall, I thought this was a great class.  I really enjoyed the discussions we had in class and I felt like my verbal communication skills increased greatly.  However, I hated the grammar component of the class.  The weekly grammar topics and quizzes were simply a review of French C and I felt as if way too much time was devoted to them.","It's an interesting class and Mxime is a great TF. You learn a lot of French.","So far, the best language class I've taken at Harvard. Great balance between learning grammar, vocab, but also about culture and practicalities of francophone countries.","This class is amazing, especially if you get Carole who is an experienced and great professor. Don't take this course if you think you can breeze through it (you can't because of the sheer number of assignments), but definitely take it if you want to come out of it feeling like you can spontaneously speak French on the subway!","This class is useful for furthering oral skills, but for those who dislike busywork, it may not be a favorite.","This class is very fun and a great way to become better at speaking French. Take French 30; it's very enjoyable!","French 30 is a great way to brush up on high school French or to strengthen past French experience with a grammatical background. It is taught very well and the topics are very interesting.","I learned so much in this course and my speaking skills improved greatly- you should take it!","Try to speak in French as much as possible to the other French students. Some students tend to communicate in English outside of class and there is no need to do that.","This class is very useful. Some of the exercises are silly and not that helpful, but Carole is a great teacher and she really cares. She also doesnt grade strictly and is very kind. Can't go wrong.","Take this course if you are looking to improve your french pronunciation! TFs are so nice and all assignments are fun as well.","This course is really interesting, but it is a lot of work.  Class is very interactive and expect to participate often.  You have to be very on top of your work, but I thought all of the assignments were very interesting.  Carole is an AMAZING preceptor, so feel very lucky if you are able to have her!"]},"Fall '13":{"comments":["This class is awesome if you are looking to improve your ability to speak french.  I came in unsure of whether I wanted to continue french, but the tf's were so amazing and had such a passion for the course itself.","Doing the grammar before the class is very helpful, and the video clips are very interesting for this course!","It is a great class to help you become comfortable with speaking.","This course is great if you already know intermediate grammar concepts and just want speaking practice. However, if you want to learn new grammar and expand your understanding of the French language structure, I would very carefully pick your instructor. I found that new grammar concepts were frequently not explained clearly and not given any kind of structure, especially if you had section with Thibaut. You pretty much had to learn it on your own.","French 30 is a fun class with amazing, supportive teachers. It will result in huge improvements in your French skills (especially speaking with the strong focus on pronunciation).  Listening skills will also improve from hearing radio shows and watching tv\/movies.  There are many assignments that involve partner work (radio show, movie, newscast) which provide great ways to bond with classmates outside of class as well.  It is great to be able to understand all of the French-speaking tourists around campus now, which was something I definitely could not do before taking French 30.","French 30 is very fun and provides an excellent mechanism for engagement with the French language and culture. The class meets for 1.5 hours twice a week, which is a different strucuture than most low-level language classes. This means a lower volume of homework and classtime. However, the assignments are sometimes more in-depth than in, say, French C; they includes several films, many paragraphs, oral exams, and a 3-5 page final essay. The feedback on these assignments is very good, and they really help one learn the language. The class centers on engagement with French media, with means that non-grammatical material is relevant and interesting. Students read newspapers, listen to radio, and watch television. The grammar itself isn't too fun, but learning it through singing a grammatically-related song is quite amusing! To conclude, I highly recommend this course. In my experience, my speaking and writing skills improved, my knowledge of contemporary French culture grew, and I had a really fun time.","This course is much better than French C. Having it just twice a week is great, and the content is interesting. It's quite a bit of work, but totally manageable! Great course.","Fun yet helpful grammar review. The class TFs are enthusiastic and chill!","This is a good French course, but nothing outstanding. The assignments are often interesting, although not all of the time, and the classes are helpful for both listening and conversation skills. If you have taken a few yard of high school French, or a semester or two of Harvard French, you should do well, and it is relaxed enough that you can focus on improving your own shortcomings rather than studying just for tests and grades.","Pay attention the whole time, otherwise you'll miss a lot.","First and foremost, if you can take this class with Thibaut as your TA, do it! He's a very good teacher and an extremely intelligent and relatable person. (He's also Parisian, which matters because you want to learn correct French.) The course itself is perfectly fair -- not too difficult, and you'll learn a good amount. If you are deciding between French 30 and French C (which I was), take French 30. The students aren't too great at French, so you'll probably not feel overwhelmed by the level of French (which, again, isn't that high). It's also a good grammatical review, or, if you haven't learned much grammar, a good place to start learning (as was my case)!","Make sure to do all the take home assignments that are not graded, and read over the grammar exercises because they are not always reviewed as thoroughly in class.","I think that this is a great class. I think that if you need a review in grammar this is a great way to go about it. I enjoyed it and loved looking at different types of media.","If you take French 30, make sure you get Thibaut as a TF! He made class fun to go to and made learning French enjoyable. There was never a class where we didn't have a laugh at something and class was always more of a relaxed setting. Always looked forward to this class because of this. The entire class is centered on speaking and communicating orally in French with some written components such as the homeworks. If you want to get comfortable with speaking French and want to understand what is said to you more, take this class. There are many projects in this class as well, but they are actually fun to do! Heads up about the oral midterm and final exams, not hard but definitely challenge you in terms of your speaking abilities.","This class is a good refresher if you feel that your grammar, speaking, or writing skills aren't quite ready for a higher level French class quite yet. If you put in the effort, it is easy to do well and your French will improve. That being said, this class has a lot of busy work and the assignments are sometimes rather tedious to complete. In general the class is not super well organized either, but normally the TFs are good about letting you know what needs to get done.","French Aa and Ab are better organized and more enjoyable, but French 30 is still good.","Make sure that you talk in class. That's only way you'll axctually get something out of it.","The class was pretty fun and the focus on media was interesting. Good course to review grammar as well as learn more about French culture.","I definitely feel like my comprehension has improved because of this course.","The course is a really great way to learn and to practice French, but also to learn a lot of interesting information about French media, through French media outlets themselves, including newspaper articles, t.v. shows, movies, comics, and songs.","This is a good class, very well taught, good continuation of grammar, speaking and understanding work in french.","You will learn a lot during this course! Prepare for the quizzes and read the assigned sections of the textbooks, and you will get a whole lot out of it. Thibaut was a wonderful TF, and the oral exams are also prepared for during class ahead of time, and very fairly graded. It may not seem like you're learning day-to-day, but at the end of the semester you realize that you've learned and improved a lot!"]},"Spring '14":{"comments":["This course is really well-designed for students looking for a French grammar review and to improve their writing skills. The instructors are really dedicated and you will find yourself doing a lot of work and getting a lot of feedback, which is realistically what you need in order to improve. I was disappointed with the amount of practice we got for spoken French-- I really don't feel this course gave me enough practice or prioritized that. It's a big time committment (think tons of little projects right around reading and finals period when you want it least) but not unmanageable and you will improve your grammar and learn a number of useful phrases.","This is, without a doubt, the best French course that I have taken at Harvard. It is the perfect combination of grammar and real language applicability. Our assignments are incredibly interactive and the vocabulary that we learn is very useful for everyday and more intellectual conversations in French.","It is tough, requires a lot of effort, but totally worth it. Not stressful or intimidating, just hard work.","I really enjoyed this class but be prepared for some superfluous assignments. The alternative assessments (oral exams, movies, quizzes...) are fine. My french speaking definitely improved.","If you took French ACD, you might be ready to skip French C and take this course. Although the topic isn't always the most interesting, the teachers are really great and you will finish with great grammar skills.","If you get a good professor or TF, this class is a great advanced review of French. However, be prepared to do a lot of busywork, and more importantly, a LOT of projects; sometimes the project load went a little overboard.","This course is great! It truly marks the difference between studying a language and beginning to speak it !","This is a very fun, effective way to improve your french speaking skills! I took French C the semester before, and I felt completely prepared for French 30.","Overall, I found this course fun, nearly stress free, and worthwhile.  The course has labeled itself as focusing on oral expression, which it does well, but it also successfully integrates ample practice in reading, writing, and listening using course materials that give students a broad exposure to French-language media.  I unreservedly recommend this course as it is for any student who qualifies for 30-level French; however, I would make sure to be cognizant that, if the course is structured the way it was this time around, the workload in the last few weeks will shoot up significantly.","This course is a great course if you want to improve and solidify your ability in speaking, writing, and understanding French. The homework does sometimes feel like busy work, but they do in fact help you get more familiar with both French culture and grammar. And Ericka, my TF, was really friendly and enthusiastic so that made the course so much more enjoyable than it could have been. Overall this course is definitely worth taking if yo are even moderately thinking about taking it.","the more you engage, the more you get out.","French 30 is a very fast-paced course and it has a lot of work, but it is very rewarding as it really helps you improve your language level. I feel that my French level was exponentially increased after taking this course. In addition to that, it is a very interesting course, with really fun projects.","French 30 is a great class if you make the most of what you are given. Go to office hours. Go to the tutoring offered by the department (it's free so there's really nothing to lose). Do all the work assigned to you (even the grammar exercises in the book that aren't really checked--they really help solidify understanding of the grammar). Stay on top of all the assignments. The syllabus is your best friend and will definitely help you know what to expect and when. If you just manage your time wisely with this course, it should be one of the easier courses (in terms of workload) but also really improve your French. It's a great course and the TFs are amazing!!!","The class has good material but it's not the best place to master spoken French as it has such limited meeting time","This class is great for improving your speaking and listening skills, but be prepared to work a lot! They take off points for the smallest errors, but you will see a big improvement in your language skills!","Bergin is amazing! She really does make the class fun and is willing to help you with any problems concerning grammar and\/or papers","French classes are some of the best language classes you can take at Harvard.  The atmosphere in these classes is fun and relatively relaxed.  People who are there are there to learn the language, not for some indirect reason like \"if I learn this language, it will help me in business later on.\"","If you're just beginning French this is the quintessential class that will begin to take your knowledge of French and grammar rules and apply it to real world instances. Using the media as a tool to better our French was perfect, because not only did I learn more about current issues in France but I learned a lot about French culture and feel a lot more confident when speaking French. We made many recordings and even made a video and altogether the course was truly a fun way to improve my French. I recommend this course with enthusiasm and think it's the perfect class to take before a summer study abroad (or semester study abroad) in France!","Professor Bergin really makes learning French so enjoyable. She is always very patient with questions and constantly encourages students when she sees them struggling. This class is very well-designed and the assignments are all very interesting. I definitely feel that my French skills have improved throughout the year.","French 30 is a great class if you want to improve your basic french speaking and grammar. It prepares you to really begin to speak fluently.","This course is amazing! Especially with Franck! He's the best TF I've had yet. It's a lot what you put into it, because you can learn a lot more or less depending on what you do outside of class. If you do the work, it's a blast. If you don't do the work, it definitely won't be as fun. Great class to take after French C.","If you aren't a fan of media involving the news and old movies, then the topic might not be very interesting but it's a great class. The TF is really nice and always does her best to explain any confusions.","This class is great. Yes it does have quite some work but it's all worth it and some of them can be very fun.","Be prepared to speak French!!  If you're rusty, you should probably brush up on listening to French before you get this class so that you can add meaningful comments to the discussion."]},"Fall '14":{"comments":["Prepare yourself for quite a bit of homework, and for some students to seem more fluent than the recommended level. Classes are fun though, and the subject matter is interesting.","This really is a great class if you're starting French here at Harvard (assuming you've taken it before). Personally, I did not take French my senior year and was a little rusty, so this class was perfect. It gives you a throughout review of French grammar, spaced out throughout the semester, so you don't feel overwhelmed. I really enjoyed this class!","This class is a pain. Your homework exercises, where you're supposed to write paragraphs in French on readings and other media, turn into an exercise in listing grammatical constructions in order to fulfill the constraints in the assignment. The scheduling of assignments is nonsensical, so you should probably look ahead in the syllabus over the weekend and not only do the (very short, especially since you have the whole weekend to do it) Tuesday homework, but also the (much longer in spite of only having two days to do it) Thursday homework. Also beware; there are a lot of projects starting in November, that are with partners, so you'll be busy, even around Harvard-yale weekend and Thanksgiving. And be sure to clarify assignments from the syllabus with your teacher, since sometimes it will be wrong or different from what they want. Really be wary of the syllabus in general, since it can be formatted or phrased deceptively, and you might miss readings\/viewings for a class period. Other than these organizational flaws, it is a decent way to practice speaking French for 3 hours a week, and to review grammar (which for this class you should be pretty familiar with standard topics).","It's great to have a class focused on oral expression, but know that graded assignments still heavily skew towards written and grammar-based work. This felt contradictory, and I wish there had been more oral expression outside of class.","Matthieu is a wonderful TF who is very willing to help students, as long as they put in the effort. This course does require a certain amount of work outside of class. As long as you keep up with the grammar exercises and learn the vocabulary, you should be more than prepared for the quizzes. Class discussion is enjoyable and Matthieu encourages participation from everyone. Overall, this course was an enjoyable way to review French language.","Very rewarding class, especially if you can practice speaking outside of class with a French friend or with your TF in office hours. It's all about verbal practice and participation!","The syllabus was often frustrating for me to understand, but the instructor was excellent - I found myself laughing a lot during class! Which was a joy.","I took this course because I was really passionate about learning French. But after this course, I don't even want to take another French course. Be prepared for about five large assignments in two weeks at the end of the semester (while you are trying to study during reading period and the last week of classes). The topics in class are boring, and I really really really really really regret taking this class. It was horrible.","French 30 is a wonderful class. If one looks for a low-stress way to improve one's French in a supportive and fun environment, French 30 will address one's needs excellently. Please actually want to speak French though! Franck was an amazing teacher- cheerful, open and helpful.","Be on top of it because once you fall behind, it's difficult to catch up.","Take this class - never will your tongue have been more seductively charged.","I loved this class - we had a hilarious section group. The continuing patience of our TF in correcting our mangled French was amazing. My speaking and writing improved greatly. The only reservation I have is that this class had an incredible amount of work, which is not a problem in itself - there's no easy way around language learning - but sometimes the specific tasks seemed unnecessarily difficult (for example, writing a grammar composition using 10 different kinds of negation, but while giving a plausible opinion on some article about French teenagers using Facebookâ€¦).","it is a good course if you are seeking a french citation","This was one of my least favorite classes at Harvard.  The material was time-consuming and not very engaging. Your French will definitely improve, but this is a somewhat painful ways to do so."]},"Fall '15":{"comments":["This is on average a genuinely enjoyable French class, though often very disorganized and inconsistent.","This class took my knowledge of French to a whole other level that I didn't think would be possible.  Whatever your reasons for taking French, this class is wonderful because, as long as you put in the time, you will become able to converse in French in a casual or formal situation.  You also can follow the news in French, and you gain lots of insight into French culture, which is interesting and exciting.  Also, Monsieur Yoen is awesome!","French 30 is a very fun class!","Great way to build on your french and start using it in actual practical situations as well as discussions on current events.","French 30 is interesting, fun, and will definitely improve your language skills. We didn't cover much new grammatical material, but I feel much more confident in my ability to apply my knowledge of French when speaking and writing. And I feel much more aware of norms of French society.","This course is really conducted entirely in french (especially if your TF barely speaks english like mine). It's a great course though! Sums up everything I learned in french before college (middle school and high school) in one semester.","This felt like the semester when I finally went from being a total French beginner to having at least a small intuitive grasp of the fundamentals. Gregoire is a terrific teacher - patient, fun, sharp, not too demanding, and encouraging.","Start writing the essays early and don't hesitate to ask your TF questions about grammar or vocab at office hours. Practice speaking as much as possible. GrÃ©goire is a really great TF and makes sure to add variety to the course. We discussed many different topics from politics to literature to music.","That this class is a good introduction to grammar and a refresher on vocab, but that it was kind of slow","A great french course! But you should check the requirements for how much french you should know, as there is a good deal of writing and speaking involved.","Definitely take this class if you're looking to improve your French grammatical and speaking skills. The class depends on your TF and assignment grading is done by him\/her; Professor Knudson visited our class only twice. It's a manageable amount of work and reminded me of my high school French class.","Be weary of the assignments that are due ahead of time. They tend to sometimes just creep up on you","This course was not too hard. They can be a little picky of grammar and spelling in the long compositions, but it's fairly comprehensive, in general. Some of the TFs have accents that can be sort of tricky to understand at first, but you'll come to comprehend them in time.","This course would help you improve your technical French skills a lot, but maybe not as much in everyday spoken colloquial French.","French 30 drops some of the more annoying frills of French Aa and Ab--ie. the pointless assignments and unnecessarily complicated and campy frameworks for the class itself. It feels much more serious, essentially you are having a discussion with a french speaker for a semester, and the french speaker just happens to correct your grammar all the time. Honestly this class was so hard for me but it felt like a worthwhile and enjoyable kind of difficulty. There was definitely a wide range of skill in the class, from people who I was sincerely confused why they even were taking this level course or a language course at all, to folks like me who definitely had to put in work to participate. I also really liked Gregoire, he was both laid back and pretty no-nonsense.","I would recommend this course if you are looking to continue learning French. Though challenging, the course is very interesting and engaging, and all of the projects are fun to complete.","This class was absolutely wonderful; getting to see a wide variety of topics that connected to the modern-day Francophone world was a blast. One piece of advice, though, would be to always make sure to clear up any confusion over which assignments are due and when. In general, the course was really well-taught, and it was a very enjoyable experience.","This is a good course.","It is interesting in that it looks at several elements of the Francophone world.","The course material was good, effective, but dry. If you're ready for it, try and take 40 or above.","Want to take your french beyond the grammar and vocal? Take this course."]},"Spring '16":{"comments":["yoen is leaving this year, so the class may not be as good","It is slightly disorganized but not all that difficult if you put the work in to study the grammar\/vocabulary. it's manageable.","I loved this class. The two days a week keeps you working on your French. Yoen was the best part of the class- he is so personable and engaged in the course. Students definitely feel included and up to speed with Yoen teaching the class.","As with most french classes, the quality of the class is highly dependent on the section leader. I had Yoen and really enjoyed the class! The material is good (although reminiscent of the material taught in French C) and le Mepris is a really good movie (you'll watch it in the last few weeks of the class).","You can do very well in French C and feel pretty lost in this class.","This class is great for strengthening your speaking skills. The course is taught by a student on exchange from l'Ecole Normale Superieure, and they're not much older than we are. It's very easy to relate with them and to have great conversations on the ins and outs of France.","The course is pretty relaxed and unstructured, but that occasionally causes problems when it comes to things that need to be structured, like larger assignments or the overall course trajectory.","Yoen is a great teacher","It was a good class, but it certain aspects were pretty confusing.  Overall, it was a pretty good class and we learned a lot about the french culture.","This course requires few out of class commitments. Lots of homework is finding a media source that discusses a topic in question and presenting it in class rather than watching or reading a particular assignment."]},"Spring '17":{"comments":["Will depend a lot on the teacher but useful to keep up to date with assignments\/French news as it makes class more interesting","Definitely take this class! Caroline was so nice and really informed about modern French culture so she made the class really relevant to us. She was so sweet and made class really fun.","Great opportunity to work on french","It's a manageable and fun course.","French 30 is a intelligent, well-designed course. The theme of media in the 21st century, focussing on France and other francophone countries, is engaging and relevant. We discussed the election often in the first half of the course, and had the opportunity to discuss important questions related to immigration, colonisation, and scandals. There's also some efforts to introduce famous French writers (Boualem Sansal, Charles Baudelaire), artists, singers, and other figures. It's a great course to especially improve writing, speaking abilities and sharpen grammar. Would recommend!","Caroline is a really great TF. Pay attention to feedback to improve.","French 30 is a great class to help you work on your french conversation skills, and Juliette is an AMAZING teacher if you can take the class with her I highly recommend it.","Caroline was a great instructor. Some of the assignments, especially at the end of the semester, took a lot of time and work, but for the most part, this class was good.","Everything about this course is simply incredible. The material is not intimidating, and the TF is absolutely incredible, the BEST TF you will ever have. I STRONGLY recommend you taking this course if you are even remotely considering continuing your French studies. Material was easy to grasp, it wasn't a big time commitment every week. If you just do you the assignments and participate in class you're pretty much guaranteed an A.","This class is great to practice and improve your speaking skills and to refine your grammar. There is not much vocabulary practiced and at times the class can drag on. Caroline was a great section leader definitely have her as your instructor. Caroline was great at giving feedback and working with you."]}},"mostRecentQ":{"overall":"4.30","workload":"3.40","difficulty":null,"recommendation":"4.30","enrollment":"35","response rate":"82.86","QCourseOverall":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"0","2s":"0","3s":"5","4s":"15","5s":"10"},"QDifficulty":{"number":"FRENCH 30","course_id":"4379","cat_num":"36981","1s":"0","2s":"2","3s":"31","4s":"6","5s":"1"},"QWorkload":{"number":"FRENCH 30","course_id":"4379","cat_num":"126942","1s":"4","2s":"22","3s":"2","4s":"0","5s":"1"}},"success":true}