{"scores":{"Fall '13":{"course_score":{"overall":"4.60","workload":"2.50","difficulty":"3.10","recommendation":"4.60","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"GOV 94go","course_id":"2170","cat_num":"19501","1s":"0","2s":"0","3s":"1","4s":"2","5s":"8"},"QDifficulty":{"number":"GOV 94go","course_id":"2170","cat_num":"19501","1s":"0","2s":"1","3s":"8","4s":"2","5s":"0"},"QWorkload":{"number":"GOV 94go","course_id":"2170","cat_num":"19501","1s":"0","2s":"6","3s":"4","4s":"1","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.83","workload":"3.00","difficulty":"3.50","recommendation":"5.00","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"GOV 94go","course_id":"2170","cat_num":"19501","1s":"0","2s":"0","3s":"1","4s":"2","5s":"8"},"QDifficulty":{"number":"GOV 94go","course_id":"2170","cat_num":"19501","1s":"0","2s":"1","3s":"8","4s":"2","5s":"0"},"QWorkload":{"number":"GOV 94go","course_id":"2170","cat_num":"19501","1s":"0","2s":"6","3s":"4","4s":"1","5s":"0"}}}},"comments":{"Spring '13":{"comments":["It was an insightful course where you really got to engage with the topic at hand and take it from all sides. George is great","The course load is heavy, but this class is definitely worthwhile. I would suggest that you do all of the readings because that really improves the quality of the class discussion (and also because they are well-selected and quite interesting for the most part) but be smart about how much time you need to spend on each one and what sorts of notes you want to take down. Since there are no midterms and there's only so much detail that you can incorporate into blogpost(s)\/essays, the readings can feel sort of disconnected from many of the evaluative components of this course. The seminar meetings are the heart of this class and always a highlight of my week: the seminars were entirely discussion-based, and it is beautiful to be able to analyze and debate such intriguing questions with bright minds. Keep in mind that you won't come out of this course with answers, but you will get to explore fascinating questions that are extremely relevant to our world today.","This is a fantastic class to learn about both the religious and political aspects of \"religion and politics\" in Europe. George is a phenomenal instructor and it was a pleasure to learn from him.","Take this class. George is a wonderful teacher and cares not only about the course material, but also about your growth as a student and a scholar.","This course was a great way to engage with issues of religion and politics in a comparative setting.  George is an amazing professor who cares deeply about the material and his students.  Take this course for that alone! Additionally, every week went by quickly because of how great the discussions were and the blog posts provided constant feedback and reflection on what we were learning in a given week.","I would argue that this is one of the best 94s offered by the Government department. The readings are fascinating, George is AWESOME (even if you're not interested in religion and politics, you wouldn't want to miss out on the opportunity to have a passionate, invested, caring, and insightful instructor like George), and the group of people that the course attracts is really excellent. This course will greatly prepare you for your senior thesis (esp. if it concerns religion and politics to some extent). The workload is reasonable (though sometimes the reading load is rather heavy), and if you're willing to dig deep into the material and put aside your assumptions, this investment will go a long way!"]},"Fall '13":{"comments":["The readings are balanced and engaging. I often found myself reading ahead or reading related works by the same authors. The assigned videos are all also very well selected, and I found myself watching those in advance as well. Overall, a really fascinating course.","If you are interested in taking a course that combines religion and politics, then this is the course for you. This is the course that you are not allowed to speak about at the dinner table because it is so controversial. This course presents a constructive platform for students to discuss these two aspects.","Incredible group discussions. Be prepared for a lot of reading, and almost all of it will be covered so rarely is it okay to skip chunks of it. But overall this is course really altered the way I think about politics and I highly recommend it!","George is a great professor and really brings the topic to life. There is a ton of reading, which is pretty hard to get done and the essays are somewhat difficult. If you're interested in the topic though, it's definitely a course to take.","This class is awesome. If you find the topic interesting, you will enjoy this class. It made me really think about some of the most difficult questions regarding religion's role in our society. Throughout the week, I constantly thought about the things we read and discussed in class. I really looked forward to the readings and going to class each week. George is a great guy and very helpful. If you are thinking of taking this class I would recommend doing it.","It's a decent class. Lots of reading, but it's interesting material. I did think in-class discussion could get a little tiresome and stale, especially toward the end of the semester when it was starting to feel like we were re-hashing the same points over and over.","Take this!!! Especially if you are remotely a religious person (or if you at least have strong feelings about religion) and love ethical reasoning\/sociology\/political theory-type classes.  As a religious person interested in government, this was the ideal course for me.","I love this class! I learned so much and it truly changes your perspective on the role religion should play in politics and public life. There is a lot of reading but its interesting! Plus this class will teach you about the importance of framing and teach you to solidify your opinions on these personal matters. An amazing part of this class is that there are people of such different backgrounds and everyone is able to share their opinions without being insulted. Everyone left this class changed and I wish this class didn't have to end. Also Professor Soroka is awesome. He knows so much about the subject matter and is really good at adding the context to each situation. He also helps you define the limits and various parts of your argument.","Take this class!","Definitely take this course if you are interested in religion, politics, and how they interact.  George is a great teacher with a wealth of knowledge on the subject, and also a great person to get to know.  Class discussions were always very enjoyable, although it is important to keep up with the readings in order to participate.  The readings can seem a bit dense in the first couple weeks, but they get better and more manageable as you go on."]}},"mostRecentQ":{"overall":"4.60","workload":"2.50","difficulty":"3.10","recommendation":"4.60","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"GOV 94go","course_id":"2170","cat_num":"19501","1s":"0","2s":"0","3s":"1","4s":"2","5s":"8"},"QDifficulty":{"number":"GOV 94go","course_id":"2170","cat_num":"19501","1s":"0","2s":"1","3s":"8","4s":"2","5s":"0"},"QWorkload":{"number":"GOV 94go","course_id":"2170","cat_num":"19501","1s":"0","2s":"6","3s":"4","4s":"1","5s":"0"}},"success":true}