{"scores":{"Spring '13":{"course_score":{"overall":"4.08","workload":"2.25","difficulty":"3.42","recommendation":"4.08","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"0","3s":"3","4s":"5","5s":"4"},"QDifficulty":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"0","3s":"8","4s":"3","5s":"1"},"QWorkload":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.083","cat_num":"99528","course_id":"1644","year":"2012","term":"2","id":"a8cdcade3f0696e038669e6d336f9a17","first":" Zachary","last":"Sifuentes","InstructorOverall":"4.58","EffectiveLecturesorPresentations":"4.55","AccessibleOutsideClass":"4.33","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"4.44","GivesUsefulFeedback":"4.89","ReturnsAssignmentsinTimelyFashion":"4.67"}]},"Spring '12":{"course_score":{"overall":"4.20","workload":"2.27","difficulty":"3.47","recommendation":"4.13","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"0","3s":"3","4s":"5","5s":"4"},"QDifficulty":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"0","3s":"8","4s":"3","5s":"1"},"QWorkload":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"4.60","workload":"2.27","difficulty":"3.20","recommendation":"4.73","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"0","3s":"3","4s":"5","5s":"4"},"QDifficulty":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"0","3s":"8","4s":"3","5s":"1"},"QWorkload":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Spring '11":{"comments":["It's expos. It's going to be intensive and annoying at times, but honestly,this is probably one of the better expos classes. Zachary is great and he really tries to make it as comfortable as possible. (Plus he's relatively flexible about deadlines.)","This is probably the best expos class to take if you actually want to sharpen and introduce nuance into your writing style.  Zachery is very well prepared for every class, introduces you to great works of poetry and literary and social commentary, and most importantly works with you on what you need to develop.  We worked really hard on some of the thinking and revision parts of the course, so know that the workload might be more than other expos classes, but it is so much more rewarding.","Poetry at the Limit is the best expos class! Expos can be annoying but Zachary was an incredible preceptor and made everything really interesting and worthwhile. I feel like I learned a lot, when I wasn't really expecting to.","This section is a lot of work but it's worth it! You will never regret having Zachary as a preceptor. He is willing to work with you however much is necessary to improve your writing. He's a preceptor who's on your side!","You should definitely consider taking this course, even if you're not that interested in, or experienced with poetry. I was a little intimidated by the course at first, but it was really nice to be outside of my comfort zone and I learned a lot.","AWESOME class! It was my #1 choice and I'm so glad I got it. Having talked to many of my peers, it definitely sounds like I had the best Expos experience. Zachary is young, quirky, exciting, and very eager in class. Class discussions are always a great combination of lighthearted goofiness and fascinating intellectual debate. The readings are easy but you will get the chance to think on a deep level. The heavy-handed structure of Expos as an institution can feel a little stifling at times, especially since I had a very strong background in writing coming into the course, yet this class still taught me new things about how to better approach my analysis and structure in a paper.","This was a great way to get the expos out of the way. While most of my peers hated their expos, I really enjoyed this class. Zachary was great!","This is an absolutely fantastic expos class. It is engaging, challenging, and definitely teaches you to think about writing differently. While some students might be put off because of the course's focus on poetry, I truly believe that this is one of the best--if not the best--expos classes out there. Zachary, the preceptor, is wonderful as well.","If you love poetry and are somewhat familiar with reading it for a class then don't hold back from taking this course.","Most people don't like Expos. My classmates and I are most of the exceptions that I've met.","Something to keep in mind is that an expos class on poetry is going to have a fairly self-selected student pool. I'm fairly sure this class was a \"harder\" choice than other expos classes, both because it involves writing about poetry and because the competition for those elusive A's was tighter. Nevertheless, I feel like Zachary really helped me improve my ability to make academic arguments, and I am glad I got exposure to this type of literary analysis, if only to convince me it's not something I want to focus on in the future.","The course is very well-taught, the readings are fantastic, and it's altogether a really satisfying experience. It was great to engage not only with the concepts of expository writing, but also with the poetry and the idea of witness and atrocity. Really liked this class. Double thumbs.","As far as the expository writing program goes, this class provides you with solid tips and tricks for tackling the structure of an essay.  Also Zachary is flexible,compassionate, and generally awesome.","If you have an interest in poetry, this is a great class, and Zachary is awesome. Come prepared to engage in some really cool discussions.","It's about writing first and foremost, and secondly about poetry. You don't have to be very interested in poetry to take it, but it helps. If it seems really easy sometimes don't take it for granted that you can do all the assignments well, pay attention, it all adds up to help you complete valuable work."]},"Spring '12":{"comments":["\"Poetry at the Limit\" was absolutely and undeniably an incredible Expos class! Zachary Sifuentes is not only a friendly, uplifting, and enthusiastic person, but also a terrific preceptor who really encourages student participation and discussion. The class atmosphere is remarkably dynamic, casual, and non-competitive. And the course material (war poetry, ekphrastic literature, and AIDS poems) is very enjoyable and interesting (not to mention extremely manageable in terms of the reading load). My recommendation: definitely take this class!","The preceptor is really nice and will treat you like an equal as long as you are respectful. Discussions were really swell my year as kids generally were interested in the topics, which really added to this discussion based class. Expect to work hard on papers, but that's a given for expos. I think if you have an interest in poetry, definitely try to take this expos.","Zachary is excellent at teaching writing. He is extremely knowledgeable about the writing process at Harvard and what will be useful for other classes. Although I was surprised about how little we focused on the actual theme of atrocity poetry, I think it was more important to focus on writing skills.","Zachary is a wonderful preceptor, and this class really helps you improve your writing skills. It's helped me think and write effectively. Definitely a fantastic Expos experience!","This is an excellent course. Zachary does a great job structuring the course so that it builds on itself and applies what we learn in class throughout the course. He also is great at mediating in-class discussions, which become a great way to begin to think about and understand the subject of each unit and start considering possible topics for each paper. The assignments (besides the papers) were really helpful in building our arguments and getting us to think critically about the paper topics. Also, Zachary does an excellent job at giving feed back and helping you to articulate your claims. He is always willing to meet as much as necessary and he is very supportive and helpful.","This is a really great Expos class. We have lively and interesting discussions, the reading isn't too heavy, and Zachary is an amazing preceptor. The course really helps not only with learning how to approach a paper in Expos, but also with applying the skills we learn to other courses. I wasn't looking forward to Expos at the beginning of the semester, and while I still feel that a lot of what we did was just a reiteration of things I learned in high school, this class has definitely prepared me for writing in other subjects for the next few years.","This is a wonderful expos class.  The assigned poetry is great and tied into important social issues.  Zachary is always enthusiastic and willing to talk to students about their paper ideas and how to improve and offers really helpful and detailed feedback on drafts. I learned a lot about how to be a better writer,but also a lot about a very interesting subject.  Before I took expos, I'd heard that no one really LIKES their expos class, but I ended up really enjoying Poetry at the Limit.","Be ready","This class was touch and go. I enjoyed the class and its discussions, but at times it felt lagging. Zachary is an awesome preceptor and he gives thorough and helpful suggestions on student writing. However, we often focused on some of the more banal aspects of writing in class and did not actually engage with the material to a degree we could have. Poetry was a bit of a subplot in as we focused more on the generalities of writing. That said, it was a good course,  the students in the class were thoughtful and engaging, and my writing did very much improve.","You should take this class if only to be taught Expos by Zachary.  He is an amazing teacher of writing, who is passionate about helping students become better writers. An interest in poetry helps, but is not necessary, as very few of the classes are actually tuned towards the analysis of poetry and the paper topics extend into realms beyond poetry that are intrinsically interesting.","This is a class that will blow your mind in so many small, everyday ways. Zachary will gradually open your eyes to more and more dimensions of good writing, and he will do it in such a humble and humbling way that makes you want to know more about both the poetry we read and the way in which good academic writing takes place.","I think one thing to keep in mind is that, because this is an Expos class, the class is about writing, not poetry.  The poetry is just a tool that we use to inform our writing, so if you're expecting a poetry class, that's not what you're going to get.  That said, I was surprised by how much I enjoyed this class and how much I took away from it.  Zachary is a great teacher - really enthusiastic, helpful, clear, etc.  The class is well planned and organized - by the end, I think it really does help you become a more aware writer, which makes you a better writer.  I didn't expect to like Expos, and I'm not saying that this class was a blast or anything, but it was a lot more enjoyable than I thought it would be.","The course description is pretty inaccurate, as we read little poetry, instead reading about how to write as well as examples of scholarly essays debating the definitions of specific terms such as ekphrasis. The instructor is very good, but I think that the class as a whole would be more enjoyable if it actually discussed poetry consistently, as implied by the course description (we only received poetry to read on three occasions)."]},"Spring '13":{"comments":["This class is amazing!!! Zachary is truly a fantastic professor; I always tell my peers that I'm learning so much but don't feel like I'm being taught. I've realized that when I have one-on-one meetings with Zachary, he prompts me with questions and helps me get as close to my final idea as possible, then allows me to make the final realization so that I consider it my own organic idea rather than his suggestion on what I should write. The poems we read are stunning and will keep you interested the whole class. Overall one of the best experiences I've had with Harvard courses and instructors so far.","This is a really great expos course; I had reservations coming into it because I was afraid of writing essays about poetry and about literature in general. However, Zachary is a really awesome preceptor who is flexible and helpful with feedback, and while expos still has its difficult times, he made it interesting and even fun at times. I would definitely recommend this course (though I believe there will be a new preceptor next semester, so I can't speak to that) because I personally found the readings interesting (and short) and the I had a great experience in it.","this class won't be taught in the future but I would say its really frustrating, but most of that is because writing is really frustrating. The class itself was pretty good, and the preceptor cares a lot about it."]}},"mostRecentQ":{"overall":"4.08","workload":"2.25","difficulty":"3.42","recommendation":"4.08","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"0","3s":"3","4s":"5","5s":"4"},"QDifficulty":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"0","3s":"8","4s":"3","5s":"1"},"QWorkload":{"number":"EXPOS 20.083","course_id":"1644","cat_num":"99528","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}},"success":true}