{"scores":{"Fall '12":{"course_score":{"overall":"4.00","workload":"1.75","difficulty":"2.25","recommendation":"4.38","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"0","2s":"1","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"2","2s":"2","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"5","2s":"0","3s":"3","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.64","workload":"1.93","difficulty":"3.14","recommendation":"4.64","enrollment":"14","response rate":"100.00","QCourseOverall":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"0","2s":"1","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"2","2s":"2","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"5","2s":"0","3s":"3","4s":"0","5s":"0"}}},"Fall '10":{"course_score":{"overall":"3.83","workload":"1.61","difficulty":"2.78","recommendation":"4.28","enrollment":"19","response rate":"94.74","QCourseOverall":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"0","2s":"1","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"2","2s":"2","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"5","2s":"0","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Fall '10":{"comments":["If you are interested in analyzing religion from a psychological\/theoretical perspective, this is a great course. A heavy emphasis is placed on the psychological processes that have made religion persist within culture- this is not a class that compares differences between Christianity and Judaism, etc.","So this class is fairly easy. The midterm was really difficult but Omar is a VERY generous grader\/curver. He's also the nicest guy ever. But, since the class is literally all student presentations every week, you don't really learn anything at all.","It is a really cool class. The topic is super interesting and Omar is FANTASTIC.","Take the class, but be prepared to do a lot of learning on your own.","Omar is awesome! Definitely take this class if you have any interest in the subject matter. Interesting without being too demanding.","interesting topic, moderate amount of work","If you are good at multiple choice, it will be the best class ever. If you are bad at them, then just be prepared to love the class but not do well on the midterm.","Needs some improvement but overall I learned a lot.","It's an easy class. Take it.","interesting material, not too difficult, professor is super nice","Very interesting topic. Make sure you do your reading. You will get much more out of it."]},"Fall '12":{"comments":["This class had super interesting readings and a very light workload. There was one in-class presentation and a final paper - schedule the presentation away from midterm season and it will be totally fine. Choose a topic you're really interested in for the final paper and that will be similarly straightforward and enjoyable. Omar is such a great professor and very chill. The midterm was easy (if you studied) and he's always available to talk about the paper. On that note, use him as a resource - he gave me about 15 different sources on my topic!","This is one of my favorite courses at Harvard. It's taught in such a relaxed atmosphere and we all loved going to class. Omar is so much fun. He cares so much about the material and about each student. The final paper was fun to research and we were encouraged to write about whatever we loved.","Interesting material, super nice professor. Omar really listens to what students have to say and is willing to work with our schedules and interests to make the class better--plus, he brought snacks to every class! :) This course helps give you insight into the evolutionary and psychological function of religion, but doesn't tell you which religion is best\/correct\/what's true or not, just fyi.","This class was really interesting, or rather, the readings and material were really interesting. The class itself was really fun, a great group, but each day we just went over the readings via. student presentation, which is not my favorite set up. I didn't feel like I was learning when I was in class.","not very labor-intensive but you get to learn a lot \/ explore a lot of new concepts and theories about religion"]}},"mostRecentQ":{"overall":"4.00","workload":"1.75","difficulty":"2.25","recommendation":"4.38","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"0","2s":"1","3s":"1","4s":"3","5s":"3"},"QDifficulty":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"2","2s":"2","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980j","course_id":"4239","cat_num":"48338","1s":"5","2s":"0","3s":"3","4s":"0","5s":"0"}},"success":true}