{"scores":{"Fall '14":{"course_score":{"overall":"4.90","workload":"6.00","difficulty":null,"recommendation":"4.90","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"1","3s":"5","4s":"3","5s":"0"},"QWorkload":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.70","workload":"2.10","difficulty":"3.20","recommendation":"4.40","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"1","3s":"5","4s":"3","5s":"0"},"QWorkload":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.67","workload":"1.89","difficulty":"3.00","recommendation":"4.78","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"1","3s":"5","4s":"3","5s":"0"},"QWorkload":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.71","workload":"1.86","difficulty":"3.00","recommendation":"4.29","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"1","3s":"5","4s":"3","5s":"0"},"QWorkload":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 10.004","cat_num":"41014","course_id":"1583","year":"2011","term":"1","id":"0b8dac7180520a1fe2f2a7fc012ff044","first":"Thomas","last":"Jehn","InstructorOverall":"4.86","EffectiveLecturesorPresentations":"4.86","AccessibleOutsideClass":"4.57","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.43","GivesUsefulFeedback":"4.71","ReturnsAssignmentsinTimelyFashion":"3.71"}]},"Fall '10":{"course_score":{"overall":"4.80","workload":"2.00","difficulty":"2.90","recommendation":"4.80","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"1","3s":"5","4s":"3","5s":"0"},"QWorkload":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Fall '10":{"comments":["I saw the difference in my writing because of this course.","Great transition in to college life.","Expository writing 10 really helped me with my analytical writing and my research and approach to writing.","Even though I was on the fence, between choosing Expos 10 and Expos 20, I am glad that I chose Expos 10 because I have gained many skills, confidence, and a better approach to writing."]},"Fall '11":{"comments":["Brilliant course! Gives you a great insight into how to write academic papers.","It definitely was a great decision to take the class. If you are unsure about whether you should take it or not, take it! :)","one of my best experiences so far. This class has opened my eyes to a world of writing I had no idea existed. I dare say I am a better writer because of the class","If you struggle in writing, then take this class. It will increase you confidence and prepare you for Expos 20."]},"Fall '12":{"comments":["In this class you learn the discrete components to put in an essay.  You learn clearly about the structure of an essay, from summary of text to validation to counterargument, etc.  You know without hesitation how to put your ideas into this structure.  It is a bit rigid though, since I tend to like to write in less predetermined forms (bellatristic essay style, as we learned in class); however, it is good to learn the standard essay, which makes arguments very organized.\r\n\r\nDr. Jehn is a warm, open, bright, caring teacher.  He takes all student ideas seriously, and his almost-weekly one-on-one conferences are inspiring.  He is responsible, takes time in his comments, and is affectionate with his students.  He gives very clear assignment instructions and explains any vocab, ideas that are new or unclear.  You end up learning quite a bit from his overflowing knowledge.\r\n\r\nThe reading are probably tied with the teacher--they are brilliant, fascinating, and very provoking.  You will want to respond with essays!\r\n\r\nGood class, a security in the progression of small responses to draft to essay that you are making development.","It's one of the best decisions I made, I learned a lot in this course and it is extremely helpful even if you have a strong background in writing.","I think Expos 10 is a great way to really learn how to write at a different level. I took a gap year last year and, needless to say, my writing abilities were not up to par. By taking this course, I have been reminded of the various arts to writing and the techniques required to write a strong paper with concrete ideas.","It is an awesome class that prepares you to write on a college level. The individual attention helps you grow as a reader because you are given feedback throughout the writing process.","This is the best introduction that anyone could ever get for academic writing.","Ultimately, this class helps prepare you for college writing, as does Expos 20. Taking Expos 10 is just an extra semester of practice for a skill that is extremely important.","I would tell future students to definitely take this course if they have the option to. It was a fantastic learning experience. In college, it is rare to get as much individual time working with a teacher and getting such specific feedback on how to improve your writing.","This is an awesome course that will definitely benefit anyone who thinks that they need more practice with their writing skills. You will not regret it! Also, Dr. Jehn is awesome!"]},"Fall '13":{"comments":["Even throughout freshman fall, this course helped my writing for other classes and has greatly prepared me for the next 3.5 years and expos 20.","I would highly recommend this class because it provides students with a great opportunity to develop the writing skills that are necessary for academic writing at Harvard.","It's ok to be in Expos 10, and it's one of those classes that helps you ease your way into college. I learned more tips for writing college essays and realized I had more time to experiment as a writer.","This class has given me a totally different framework on how to write papers, and that's coming from an English writing based student from a private high school with an awesome English program. College writing can be very different, and it's worth it taking an extra semester to review and learn writing skills which will help you write college papers more efficiently and effectively.","It will help tremendously if writing was not stressed in high school.","Its a good way to get solid feedback on your writing.","If you're an international student with no prior experience of academic writing, I strongly recommend this course.","Expos 10 really helps you prepare for writing in college. If you feel like you are not prepared it is worth taking it!"]},"Fall '14":{"comments":["Expos 10 is a great class for stregnthing your writing skills.","Students should not wait until the day an assignment is done to start working on it.","The professor is amazing. You will not regret taking this class. Your writing improves tremendously  as well.","If you are not sure about your writing skills, take this class. Even if you are solid in your writing, take it anyway if you want to fulfill a pre-med requirement by taking Expos 10 and then Expos 20.","Expos 10 is a great way to improve your writing, providing you with an opportunity to practice different writing techniques with the support of the preceptor."]}},"mostRecentQ":{"overall":"4.90","workload":"6.00","difficulty":null,"recommendation":"4.90","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"1","3s":"5","4s":"3","5s":"0"},"QWorkload":{"number":"EXPOS 10.004","course_id":"1583","cat_num":"41014","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"success":true}