{"scores":{"Spring '14":{"course_score":{"overall":"4.70","workload":"1.60","difficulty":"2.60","recommendation":"4.80","enrollment":"29","response rate":"62.07","QCourseOverall":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"0","3s":"1","4s":"4","5s":"13"},"QDifficulty":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"8","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"8","2s":"9","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ESPP 90s","cat_num":"53953","course_id":"1575","year":"2013","term":"2","id":"97db06e44842cbfa75968255a1141a45","first":" George P.","last":"Baker","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '13":{"course_score":{"overall":"4.32","workload":"1.68","difficulty":"2.54","recommendation":"4.32","enrollment":"31","response rate":"90.32","QCourseOverall":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"0","3s":"1","4s":"4","5s":"13"},"QDifficulty":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"8","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"8","2s":"9","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ESPP 90s","cat_num":"53953","course_id":"1575","year":"2012","term":"2","id":"97db06e44842cbfa75968255a1141a45","first":" George P.","last":"Baker","InstructorOverall":"4.54","EffectiveLecturesorPresentations":"4.64","AccessibleOutsideClass":"3.65","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.59","GivesUsefulFeedback":"3.15","ReturnsAssignmentsinTimelyFashion":"3.90"}]},"Spring '12":{"course_score":{"overall":"4.62","workload":"1.67","difficulty":"2.48","recommendation":"4.57","enrollment":"24","response rate":"87.50","QCourseOverall":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"0","3s":"1","4s":"4","5s":"13"},"QDifficulty":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"8","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"8","2s":"9","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ESPP 90s","cat_num":"53953","course_id":"1575","year":"2011","term":"2","id":"97db06e44842cbfa75968255a1141a45","first":"George P.","last":"Baker","InstructorOverall":"4.65","EffectiveLecturesorPresentations":"4.71","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.81","FacilitatesDiscussionEncouragesParticipation":"4.65","GivesUsefulFeedback":"3.70","ReturnsAssignmentsinTimelyFashion":"3.00"}]},"Spring '11":{"course_score":{"overall":"4.20","workload":"1.64","difficulty":"2.32","recommendation":"4.64","enrollment":"27","response rate":"92.59","QCourseOverall":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"0","3s":"1","4s":"4","5s":"13"},"QDifficulty":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"8","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"8","2s":"9","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '11":{"comments":["This is a great chance to see what it's like in the \"real world.\" Environmentalism is all well and good, but if it doesn't meet the bottom line, it's not feasible- economically, politically, sometimes even technically. This course will give you real skills to conceive of and evaluate renewable energy projects. You'll learn a lot about specific types of projects and technologies and also get good experience engaging in discussions and debates, working in teams, and doing \"cases.\"","Prof. Baker has had some interesting experiences that can be fascinating to talk about. The readings (if you do them) are interesting, and the final project can be really cool (but get started on it early!). But the class is too large to be a seminar and Prof. Baker insists on treating it as one, so timid speakers beware: this may not be the class for you. With such grade emphasis on class participation, there is are a lot of empty things said which further crushes meaningful discussion. Bring some work to do on your laptop during class - it'll be more bearable.","If you are interested in renewable energy, you MUST take this class.  Classes are engaging and the material makes you very knowledgeable.  The final project gives you a real taste of what it would be like to go into the field for a career.  If you are not interested in energy, this class will probably feel like a waste.\r\n\r\nRegardless, you will find this class to be easy during the year, although the final project will take time.","This course is an excellent introduction to the world of renewable energy, and the economic perspective is a refreshing one for ESPP concentrators. I would definitely recommend this course as a seminar requirement or just for an interesting elective.","If you engage in class and do the readings, you will gain a lot of knowledge on the technology and economic feasibility of various renewable energy sources.","Great course. Really helps you become familiar with key energy-related issues. The readings are good too...no lengthy, dense, jargon-filled reports (well, maybe a couple). Mostly you read news articles and relatively easy to understand material.","Great opportunity to learn about renewable energy first hand from a professor who has experience in the industry. Great for anyone interested in renewables or the energy industry\/ policy in general.","there were too many people in the class, it was tough to participate sometimes because there were so many people","You will learn a lot, but sometimes feel like the conversation can stray away from the topic, but that can be a good thing.","Great class. Prof Baker is an amazingly knowledgeable guy, and everyone will benefit from his insights on the impact of politics and economics on energy development.","This class is particularly beneficial if taken after or in conjunction with ES 6, as it reviews alternative energy technologies in a very similar order. On the plus side, the weekly discussions were good and the final paper (which will take up a lot of your time in the last few weeks of the semester) offers a unique opportunity to really explore the feasibility of a particular alternative energy plant or business. On the down side, the professor has a lot of expertise in wind energy, but not much else in the arena of alternative energy, and the class felt very unstructured in its direction at times.","TAKE THIS COURSE! The question of \"how should we generate electricity in the 21st century\" is the most important question of our generation.  The subject matter covered in this course is both fascinating and profoundly relevant, no matter what your future career path may be.  More than any other course at Harvard, I genuinely feel as though this course has allowed me to grow in wisdom and knowledge; I feel as though I can actually create a list of things I've learned and things I will remember for years to come.","Great class and you learn a lot.  Class discussions are tedious, but you can tune out.  The reading is great.  HAVE A PARTNER or so for the final project!","Fantastic and also very little work required!","If your are an ESPP\/Engineering Sciences\/Environmental Engineering, be wary of this course if it's taught in the same format as this year.  With 30 students all varying in knowledge about renewable\/non renewable energy, the course often found itself to be a lecture instead of a discussion.","If you are curious about how courses at Harvard Business School are taught and have any interest in environmentalism and energy markets, you should definitely take this course. Professor Baker is one of the most enthusiastic and knowledgeable professors I've ever had. He is a seasoned pro at teaching from lecturing for over 20 years at HBS. I learned so much in this course! Definitely try to take this course (it might be lotteried next year.)","Incredible class, only going to get better as he gets used to teaching at the College. Still cool learning in an HBS format about a topic that many find to be one of the most pressing facing the world today.","Speak up, as much as you possibly can, but only when you know what you're talking about.","This was a great seminar to take. Really interesting. It influenced a lot of my views and cleared up my misconceptions of renewable energy. It be comes clear that when talking about renewable energy, you have to talk about technology, public policy, and economics all at once. One of the most real world useful classes you could take.  Baker is a great lecturer. Not a lot of work overall although the final project is kind of time consuming.","ESPP90s will give future energy professionals and concerned citizens alike the foundation in renewable energy technologies that they've always been looking for. We cover a fairly broad range of technologies, tied together in very interesting classroom discussions led by the exceedingly well informed, energetic and enthusiastic Prof. George Baker. The fluidity or perhaps flexibility of classroom discussions and readings, as well as the single final assignment, means that this is not a course for people who don't keep up with readings well--otherwise, at the end, you are going to be overwhelmed by the demands of the final project. I know this class will be expanded to more students next year, but I would recommend that this course not grow too much in size, or otherwise should recruit additional TFs. Prof. Baker did a great job of being accessible inside and outside the classroom, but I think many students would benefit from more guidance (especially if they don't come from a background of energy research\/work). Perhaps the course should consider incorporating an optional section component to discuss readings and technologies in more detail. Overall, this is an interesting course about an important topic, and environmentalists and the uninterested alike will benefit."]},"Spring '12":{"comments":["Great course for discussion, so participate if you want to get as much out of the class as possible. Professor Baker is excellent.","This is a great course for those hopeful to work in the energy industry, and understand the economics underlying the business.","This class was incredible! You must take it if you have any interest in renewable technologies or the environment or economics in general. I learned a ton through case studies and class discussion. Baker is a pro!","Good, not time intensive. TF gave no feedback on response papers so it's very hard to gauge grades.","Great course! Professor Baker knows so much about alternative energy, and you will learn tons just by going to lecture and being engaged. He also has good stories and was actually involved in many projects so you'll hear about experiences you could never learn from a textbook. The class is also close to zero work until the final week\/reading period when you have to do the final project. You will have no idea what your grade is though throughout the semester.","Great class. Professor Baker is one of the best professors I have had. Genuinely interested in the material and helping his students. Perfect combo.","ESPP 90s is an awesome and easy way to jump into the alternative energy industry.  The class runs big, and Professor Baker tends to talk more than the students, so if you're really looking for a seminar this class isn't for you.  Otherwise, this class was extremely easy and a fun way to spend an afternoon every week!","Most useful course I ever took. Made me want to pursue a career in energy","If you are interested in renewable energy, energy policy, or the economics behind energy, this is a great class. This is also the easiest class I have ever taken in terms of workload. You don't get any feedback on anything though.","Best class I have ever taken","Do not be scared away by the prereq. of Economics, I never took it and was completely fine without it. Most topics regarding economics will make intuitive sense and it is not like you are being tested on your understanding. That being said, if you don't know how to do cost\/revenue breakdowns in excel, find a group that does for the final project, otherwise you will be very lost and the final project will be a lot of work. If you are someone that likes to know how you are doing in a course and\/or doesn't like that your whole grade is determined by a final project, you won't love this course. Conversely, if you like having low stress work throughout the whole semester and then just crushing a large final project, then you will really like the structure of the course. Definitely an interesting course if you are thinking about going into the energy field.","This class is truly fantastic. Probably the best I've taken at Harvard. Every week you learn something new and exciting and Prof. Baker is really interesting and fun to listen to."]},"Spring '13":{"comments":["Take this class.  You will learn so much about renewable energy, and finally be able to talk with intelligence about the actual challenges is poses. You will learn so much from this class.  Plus, Prof. Baker's collection of cowboy boots is epic.","Professor Baker is amazingly dynamic. He knows how to take a very complicated topic and make it digestible on multiple levels of analysis. Definitely take this class if you think the subject is interesting to you. The 3 hour format only occasionally feels too long.","Great course that is extremely important given problems with climate change and fossil fuel dependency. The workload is very manageable and the readings and discussions are enjoyable","This class was a great all-around background to renewables (technology, public policy, economics, etc.). If you already have a good knowledge base surrounding renewables, skip it. Also, pray for a different TF.","A good introduction to renewable energy and good chance to read up on different types of technology. More of a survey though, and not too much depth in either policy, technology, or economics.","Be ready to be engaged and to participate in class discussions.","Very interesting topic, easy workload, but class can be very long at times. The final project is a challenge (but fun!) so start early.","Great course to get some basic background in various renewable technologies and not very difficult or work intensive- a fun elective that I would definitely recommend!!!","Great course. Very interesting.","Great course on renewable energy that will teach you a lot about electricity markets among other things. Good blend of economic concepts with technical details about renewable energy.","Hands down the best class I have ever taken at Harvard!!! I love it when learning is this effortless... I honestly doubt I have ever learned so much from any class. George is AMAZING, like mind-blowing amazing, incredibly funny, super knowledgeable and passionate, and just overall a baller person. Also, students taking the class know their stuff and do the weekly readings, which made for great discussions in class. Field trip to biomass power plant was fun as well. Absolutely amazing experience overall - TAKE THIS CLASS!","Great course, you will learn so much interesting stuff about energy.  Definitely a must if you are interesting in economics and energy.","Really good balance of lecturing and discussion - economics, policy, science, etc.  Overall, it was a very well-rounded class and I learned a ton!  Prof Baker is really engaging and the discussions are fun, but be sure to participate as much as you can.  The final project is a bit of a time suck, but as long as you start it well in advance, you should be fine.","Professor Baker is a brilliant guy and a fantastic lecturer, and he makes this course what it is. The topic of renewable energy is incredibly important for students from all disciplines, and this class does a great job of covering lots of material in a painless way. Awesome course. Highly recommend.","An absolute must-take for anyone even remotely interested in energy...or really anyone. Professor Baker really knows his stuff and is super nice, making the material very accessible. Energy policy is also a really interesting topic that impacts so much of our lives. The class is also very low stress and involves a cool field-trip to a biomass plant and a really fun project at the end.","This is a good class that gives an overview over a variety of renewable energy technologies and their issues. Be prepared to participate in class discussions. The workload is manageable. The final project is a cool opportunity to delve into the technology you're most interested in and analyze its potential through the lens of a specific renewable energy technology proposal.","If you're interested in renewables, take this course! Professor Baker is captivating to listen to, and the three hour time frame zooms by. Watch out for the final paper though--it takes longer than you think, and you'll probably think it takes a long time already.","This class is a pretty approachable way to learn about all the aspects of the renewable energy enterprise. Each session doesn't feel particularly productive but by the end you have learned a lot. It's also extremely low-workload until the end of the semester.","Very interesting topics and the final project is what you make of it. Do something interesting and challenging."]},"Spring '14":{"comments":["A hands-on overview of the world's energy challenges and ways to solve them (and not solve them!) with renewable energy sources. The fact that the final paper is closer to a business proposal than an academic paper is invigorating and I felt very useful and real-worldy writing it. Also top grades to Professor Baker's lecturing!","Professor Baker is the BEST. As a senior, this was the one class that I looked forward to. The topics discussed in class are always interesting, and professor Baker has great anecdotes. If you are even slightly interested in energy and renewables, TAKE THIS SEMINAR. I am a neurobio major and found the course both accessible and interesting.","This class analyzed the logistics of real world issues like none I've ever taken before. It was fantastic, and Professor Baker was an excellent discussion leader.","Professor Baker is a really fun professor. He is very fair to both sides of an argument-- a surprising and valuable trait in such a politically charged subject matter.","This was my favorite course at Harvard to date. If you are at all interested in today's energy environment, I highly recommend that you take it. Professor Baker is engaging, and the workload is quite low.","Take this course!! It is a discussion and participation based course so it's lively and really draws you in. It made me passionate about renewable energy.","I would tell them that is an extremely exciting class that puts you at the forefront of renewable energy development. It is very engaging and throwing yourself into the discussion helps you get so much more out of the class. Professor Baker is absolutely great at generating enthusiasm for the subject matter, as he is extremely well-versed in the area and fabulous at answering questions, often stopping his lecture to look up the answer to a question or afterthought he had just had.","It's a relaxed but engaging discussion class that enriches a students understanding of the climate change problem. George Baker is a fountain of knowledge and you leave class of Thursday afternoons simply knowing more!"]}},"mostRecentQ":{"overall":"4.70","workload":"1.60","difficulty":"2.60","recommendation":"4.80","enrollment":"29","response rate":"62.07","QCourseOverall":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"0","3s":"1","4s":"4","5s":"13"},"QDifficulty":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"0","2s":"8","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"ESPP 90s","course_id":"1575","cat_num":"53953","1s":"8","2s":"9","3s":"1","4s":"0","5s":"0"}},"success":true}