{"scores":{"Spring '17":{"course_score":{"overall":"4.70","workload":"2.60","difficulty":null,"recommendation":"4.80","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"0","2s":"0","3s":"0","4s":"4","5s":"11"},"QDifficulty":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"2","2s":"11","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 980K","cat_num":"127535","course_id":"4240","year":"2016","term":"2","id":"e07c2508502f7a5b6cf84fc80db108e9","first":" Deborah","last":"Zaitchik-Samet","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '13":{"course_score":{"overall":"4.70","workload":"1.70","difficulty":"2.00","recommendation":"4.90","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"0","2s":"0","3s":"0","4s":"4","5s":"11"},"QDifficulty":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"2","2s":"11","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 980k","cat_num":"76843","course_id":"4240","year":"2013","term":"1","id":"e07c2508502f7a5b6cf84fc80db108e9","first":" Deborah","last":"Zaitchik-Samet","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Fall '12":{"course_score":{"overall":"4.78","workload":"1.38","difficulty":"2.14","recommendation":"4.88","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"0","2s":"0","3s":"0","4s":"4","5s":"11"},"QDifficulty":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"2","2s":"11","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"4.67","workload":"1.58","difficulty":"2.42","recommendation":"4.55","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"0","2s":"0","3s":"0","4s":"4","5s":"11"},"QDifficulty":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"2","2s":"11","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 980k","cat_num":"76843","course_id":"4240","year":"2011","term":"2","id":"e07c2508502f7a5b6cf84fc80db108e9","first":"Deborah","last":"Zaitchik-Samet","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.58","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.75","FacilitatesDiscussionEncouragesParticipation":"4.83","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"2.88"}]},"Spring '11":{"course_score":{"overall":"4.60","workload":"1.60","difficulty":"2.50","recommendation":"4.50","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"0","2s":"0","3s":"0","4s":"4","5s":"11"},"QDifficulty":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"2","2s":"11","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '11":{"comments":["If you're interested in psychology and development and cognition, this course is a fun intro.","Great seminar, very interesting readings, Deborah is also really nice and just amazing all around!","Professor Zaitchik is soooo nice! This course discussed a really interesting range of topics. It is much more interesting if you have a strong interest in cognitive psychology.","Professor Zaitchik is wonderful!","It's an interesting class with an awesome instructor!","This course charts a fascinating path examining how the study of Alzheimer's and the study of child development can learn from each other. No one could have made this fascinating and truly original argument better than Dr. Zaitchik. \r\n\r\nAnother strength of the course was Dr. Zaitchik's winning personality. She constantly made me laugh and smile broad smiles. I could always tell that she was there for me. She clearly loved talking about psychology and was excited and engaging.\r\nBe warned, however, that though Dr. Zaitchik is a truly wonderful person, she is both forgetful and disorganized. She can sometimes loose track of what she wants to convey in class and may not keep careful track of your response papers.","Professor Zaitchik is a fantastic professor and the strength of the course. She is really nice (and always brings snacks to class!) and is really happy to talk with you about the class\/your interests outside of class. It's also nice because it is really the only developmental course at Harvard that discusses with the later changes in life."]},"Spring '12":{"comments":["This is a fantastic course! Professor Zaitchik is extremely smart and did a great job leading high-level discussions in this class. She was willing to challenge students and the ideas they raised in discussions, making the class really interesting and substantive, but did so in an extremely warm and friendly manner, which I think really helped make people feel comfortable sharing their thoughts and ideas, leading to high levels of student participation. You will learn a lot of really interesting stuff about conceptual development in childhood and aging, and also about cognitive decline, which is not usually covered in a lot of depth in the Harvard psychology department. It's really cool to think about the cognitive architecture that supports human conceptual understanding! The course was not very difficult and didn't require too much work, and the seminar felt very casual and relaxed overall. Also, the professor always brought snacks to class which was really nice!! You should definitely take it!","The discussions are always engaging and who doesn't love snacks in class!","It is an interesting class that requires a lot of concentration and time, reading the articles is not enough...","This class is one of those purely intellectual experiences that you get to enjoy at Harvard. It is less focused on grades and more focused on discussion and raising questions about the subject matter that have not yet been answered. It's an effective, low pressure way of learning.","This class is all about discussion, so come prepared to talk. Debbie is a really great conversation leader, and it never felt like anyone was just talking to talk, or that the conversation just stalled. There are also really small weekly assignments over the reading, so if you struggle in reading for classes like I do, this is a GREAT way to make sure you do them.","Debbie is awesome, class is a gem.","Class readings are very manageable, the professor is very friendly, and the topic is interesting, provided that you are interested in development, aging, and decline of cognition.","This is one of the most enjoyable psychology seminars I've taken!","This was one of those amazing courses where you actually feel like you are contributing and truly learning something. Take this course if you want to really engage with the material and get to know your classmates. Debbie is by far the best professor I've had!"]},"Fall '12":{"comments":["It's a very fun, casual seminar. Yet the topic is focused enough to learn quite a bit while still keeping a relaxed phase. Not to mention, professor Zaitchik is an excellent instructor and a wonderfully warm person.","Take this class if you want an interesting, discussion based seminar on some really cool (and flexible!)topics. Over the entire semester, never once did our discussion run dry- the professor is really good at listening and getting people to voice their opinions.","TAKE THIS CLASS! It's awesome, interesting, not very challenging in the amount of readings it requires, but intellectually stimulating. DEBBIE IS AWESOME. She brings us food every week. There aren't many assignments. This class is a gem and totally worth taking.","This is definitely one of the best classes I have ever taken at Harvard. The atmosphere is extremely relaxed but everyone took the work seriously because it was very interesting. I wish the section time was not 6-8pm on a Thursday - other than that, I have no negative things to say.","the Prof is great and you will likely look forward to going to class. that said, its approach might be a bit too neuro for some - i definitely expected more humanism. i guess thats just my fault","Take this! You barely have to do the reasons to participate in the discussions that are worthwhile and interesting. The professor is amazing, and she brings in food every class. Awesome class.","This is a great introduction to topics in the field of developmental psych in a seminar format, which is superior in my opinion to your standard psych lecture. The readings and studies discussed were excellent, the work load was not overwhelming at all, and discussion was relaxed and productive."]},"Fall '13":{"comments":["Such a wonderful class. The professor is an angel (she brings snacks to every class and is just so cute) and the class is interesting, requires little time, and the topics are so applicable to our lives.  The professor really encourages group discussion and at other times it is just nice to sit back and listen to her because she has so much knowledge on the subjects.","Deborah is an amazing, caring, and intelligent professor who fosters great discussion. The readings are all very doable and the assignments are all about getting your thoughts on paper in order to create later discussion. Very manageable and fun!","This is one of the best courses I've taken at Harvard! Really chill, yet you learn something interesting each week! The professor is also the sweetest person.","This class is truly student-driven and you will get so much out of it if you try and if you are present during the seminar sessions.","This class is amazing! I didn't think I was very interested in cognitive psychology when signing up for this class, but this class is so well thought out that I quickly changed my mind. I like how we started with infant cognition and moving all the way to old age. It is a class that every psychology concentrator should take!","Take this class! You will learn a lot. The concepts in the class are really interesting. There is so much class discussion, from the most academic to the most random topics. Prof Z is so nice, kind, cool, and knowledgeable. She also has a really interesting life story, so you should really get to know her. She also brings snacks to every class!","This is an amazing class!  The professor, Deborah, is very supportive and really cares about each student learning and engaging.  If you have any interest in this subject at all, I highly recommend you take it.  I really looked forward to this class every Monday.","I definitely felt more intimidated to participate at the beginning of the class (and in fact almost dropped it) because Dr. Zaitchik-Samet can be an opinionated person that believes there are right and wrong answers for everything--even opinions. Despite the discouraging start, I'm very glad I stuck with the class. Dr. Zaitchik-Samet is a very insightful and kind researcher, who really cares about the research she is conducting for the intellectual aspect of it. She is also a realist, who speaks her mind (sometimes in a non-PC way) but I really appreciate that because it helped me to learn to speak my own mind regarding the topics we discussed as the class went on. It definitely is more of a slow burn in terms of how engaging it is, but by the end my classmates and I were sad it was over. The class (after the first couple of intro meetings) is taught entirely via student presentations, which I thought was an interesting and surprisingly effective way to learn, with Dr. Zaitchik-Samet providing clarifications and insight when necessary. In-class participation never felt forced (no \"section kids\") and we always ended up laughing and learning something really innovative and interesting occurring with research in various topics. Finally...Dr. Zaitchik-Samet brings a variety of snacks to every class! That's worth an extra point in of itself, because it shows how thoughtful she is of her students to bring food during a class that runs during part of dinner:) In terms of workload, this class requires very little work--very short weekly responses (~100-150 words) that she assigns just to make sure that you've done the reading and have something interesting to say about it; the 2 hour in-class presentation (don't worry about filling time though--we always ran over and had to fast forward through later slides because class discussion was really robust); and a final paper. Very little structural guidance is given (i.e. there are no rubrics for the assignments or presentation, and I had no idea what my grade in the class was until the end) but Dr. Zaitchik-Samet makes up for this by giving us more creative freedom in our assignments (e.g. I was allowed to discuss an extra paper in my presentation that was relevant to the presentation topic). Overall, I recommend this course!","This is a great class that challenges you to think on your own and introduces you to topics that are really relevant in your own life.  Dr. Zaitchik brings great enthusiasm to the course and is very fun which makes participating in class so much easier.","TAKE THIS CLASS IF YOU CAN!!! It was one of my best classes I've taken @ Harvard. Debbie is the sweetest lady in the entire world and I've done some of the deepest thinking and considerations about the mind & brain and behavior in this course.","I loved this class. The material was really fascinating, and if you've ever liked interacting with kids or senior citizens, you should take this class. Everything from theory of mind, to philosophical questions of what it would be like to be immortal, this class is a great chill class.","This class was great. It was great to learn in a pressure free environment and I thought the class discussions were really good."]},"Spring '17":{"comments":["Take this class! You will learn SO much about cognitive changes in aging. The small class size makes it an incredible environment to engage and discuss with your peers. Professor   Z is probably my all time favorite professor at Harvard. She is so incredibly knowledgable, always willing to help, and just an all around great person.","Deborah is an absolute gem who is incredibly knowledgable about the subject matter and genuinely cares about her students. Discussion was always comfortable, interesting, and humorous.","Amazing course! The layout of the course was one of the most unique and powerful aspects. Reading scientific papers and then hearing the writers of the papers speak was really interesting, and gave you the most expert dive possible into each topic. Not to mention the course material was awesome. There wasn't one weak that I wasn't excited for.","Great class. Professor Zaitchik is one of the kindest, most approachable professors I have met at Harvard. She really has allowed for an educational environment that promotes learning from each other and learning about our specific interests. She has also led this class in a way that allows us to get out of it what we would like to by allowing us to pursue individual interests and keeping assignments flexible. Highly recommend this class!","I absolutely loved this class.  The readings are fascinating and thought-provoking, the classes and discussions are equally fascinating and conversation usually evolves into whatever students are most interested in, and Professor Zaitchik is a great person and an even better teacher.  Recommend 10\/10.","This course is awesome! Professor Zaitchik is incredible. She is so intelligent and engaging and is truly passionate about the topics, and will make you passionate about them as well. The course is not stressful at all and is structured in a way that you can learn the material simply for the sake of learning it. Discussions were engaging and I always looked forward to class.","Take this course! It was honestly one of the best courses I've taken. Dr. Z does an AMAZING job with the class - the readings are always super interesting, the assignments are always very fair, and the discussions are always lively.","This is a fun and very relaxed, easy class. Professor Zaitchik is the sweetest professor you will ever encounter. She's extremely chill, kind, and shows a true passion for what she's teaching. Extensions are easy to get, though there's hardly any work so you won't need one. If you want a relatively interesting class with next to no work, this is the class for you.","This is awesome"]}},"mostRecentQ":{"overall":"4.70","workload":"2.60","difficulty":null,"recommendation":"4.80","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"0","2s":"0","3s":"0","4s":"4","5s":"11"},"QDifficulty":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"2","2s":"11","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 980k","course_id":"4240","cat_num":"76843","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}},"success":true}