{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"2.50","difficulty":"3.20","recommendation":"4.80","enrollment":"5","response rate":"80.00","QCourseOverall":{"number":"RELIGION 2800","course_id":"11491","cat_num":"34351","1s":"0","2s":"0","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"RELIGION 2800","course_id":"11491","cat_num":"34351","1s":"0","2s":"0","3s":"3","4s":"1","5s":"0"},"QWorkload":{"number":"RELIGION 2800","course_id":"11491","cat_num":"34351","1s":"0","2s":"2","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Spring '14":{"comments":["This class was a great class in providing exposure to the different genres in Islamic Studies with sources and methods that were very useful. Some of Professor Ahmed's suggestions were terrific and he has some great insights. We did exercises with tafsir, biographical dictionaries, lexicons, and hadith, for instance (as well as reading some reference works such as about manuscripts and the Arabic book). \r\nIt would have been better if we had more time in the class, even mandatory office hours, to go over some of the assignments that we were assigned, but not everyone in the class was able to present in order to get feedback on their work and to get Prof. Ahmed's priceless feedback. Being able to research, find, peruse, and work with these primary sources in hands on fashion was a much needed and excellent experience that I would recommend to students of Islamic Studies.","This class provides exposure to materials and ideas that are key to doing work in Islamic Studies but may not feature in other Harvard classes.","This class is incredibly difficult and incredibly rewarding. Be prepared to sweat, and to grow as a scholar. This process is painful but worth it."]}},"mostRecentQ":{"overall":"4.20","workload":"2.50","difficulty":"3.20","recommendation":"4.80","enrollment":"5","response rate":"80.00","QCourseOverall":{"number":"RELIGION 2800","course_id":"11491","cat_num":"34351","1s":"0","2s":"0","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"RELIGION 2800","course_id":"11491","cat_num":"34351","1s":"0","2s":"0","3s":"3","4s":"1","5s":"0"},"QWorkload":{"number":"RELIGION 2800","course_id":"11491","cat_num":"34351","1s":"0","2s":"2","3s":"2","4s":"0","5s":"0"}},"success":true}