{"scores":{"Spring '13":{"course_score":{"overall":"4.00","workload":"1.89","difficulty":"2.56","recommendation":"4.33","enrollment":"13","response rate":"69.23","QCourseOverall":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"0","2s":"0","3s":"1","4s":"7","5s":"1"},"QDifficulty":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"0","2s":"4","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"2","2s":"6","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1755","cat_num":"88786","course_id":"165","year":"2012","term":"2","id":"886455c990c0e74970ef28649059ac61","first":" Edward Akintola","last":"Hubbard","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.22","AccessibleOutsideClass":"4.56","GeneratesEnthusiasm":"4.89","FacilitatesDiscussionEncouragesParticipation":"3.62","GivesUsefulFeedback":"3.38","ReturnsAssignmentsinTimelyFashion":"3.88"}]},"Spring '12":{"course_score":{"overall":"3.88","workload":"1.65","difficulty":"2.59","recommendation":"4.18","enrollment":"20","response rate":"85.00","QCourseOverall":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"0","2s":"0","3s":"1","4s":"7","5s":"1"},"QDifficulty":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"0","2s":"4","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"2","2s":"6","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1755","cat_num":"88786","course_id":"165","year":"2011","term":"2","id":"886455c990c0e74970ef28649059ac61","first":"Edward Akintola","last":"Hubbard","InstructorOverall":"4.06","EffectiveLecturesorPresentations":"4.06","AccessibleOutsideClass":"4.06","GeneratesEnthusiasm":"4.41","FacilitatesDiscussionEncouragesParticipation":"3.73","GivesUsefulFeedback":"3.45","ReturnsAssignmentsinTimelyFashion":"3.00"}]},"Spring '11":{"course_score":{"overall":"4.20","workload":"1.92","difficulty":"2.72","recommendation":"4.44","enrollment":"28","response rate":"89.29","QCourseOverall":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"0","2s":"0","3s":"1","4s":"7","5s":"1"},"QDifficulty":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"0","2s":"4","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"2","2s":"6","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '11":{"comments":["Pretty interesting, very fun. Laid back teaching, and assignments are graded fairly easily.","Although the class was wonderful, I felt as though students that were Creole or had been\/were from Creole countries definitely had a leg up in the course, in terms of contributing to general discussions based on their experiences.","This class is very interesting and enjoyable!","Such an awesome course!! The pop icons are so interesting and cool. Professor Hubbard is fantastic and hilarious and he is so chill and cool. You get to study such cool people like Bob Marley and Nicki Minaj while also understanding how creole has been viewed and has evolved over time. Super interesting and engaging and fun!","If one is looking to learn about creole pop from an anthropological standpoint, this course does an\r\nincredible job.","TAKE THIS CLASS. No midterms, final exam, or written assignments until the final essay. Plus, you actually learn a lot. You can't lose with this class.","Do your reading! Akim cold calls! But besides for that, I have absolutely loved this class, and wish I could take it again. You also might not enjoy the class unless you are interested in the subject matter, but if you are at all interested in creole culture it will be a fantastic experience.","This class is definitely an interesting one.  The subject matter was so engaging, and the student presentations were a great addition to the class in order to provide background on each of the creole pop iconographies.  However, the structure and organization of this class may diminish the appeal of the subject matter.  I am certain though that the class will only improve over time, so I definitely recommend taking this class.","How often do you get to listen to Nicki Minaj mixtapes during lecture?","Interesting material, but lack of structure makes it difficult to commit to."]},"Spring '12":{"comments":["This course is insanely specific. It's really only about theories of creolization, not much else (sadly). I enjoyed it at times because of the cultural icons selected, but I also felt left out due to my race and lack of a creole background.","Really interesting material and using music as a lens for discussing social phenomena was innovative and stimulating. I hope the course becomes better organized, because the course's main flaws (lack of organization, unclear expectations, uneven thematic flow, etc.) can all be improved.","It was a great course, and I learned so much about creole culture through inventions in music, art and other forms.","This was a great class. It was a fairly light workload, but we still learned a lot about some really interesting topics.","Akin is great. The class is laid back, but you learn quite a bit. I loved the music component of the course. If anything, you'll have an amazing playlist and an increased awareness of how truly diverse our world is.","Easy and interesting enough.","Take any of Dr. Hubbard's classes!  He is an enthusiastic professor, and students can't help but get excited about the material and engage in spirited discussions in class.","If you are at all interested in the Caribbean, take this class."]},"Spring '13":{"comments":["This course is very interesting and the professor is very knowledgable and engaging. I really enjoyed learning about his research and work through class discussion, and I was happy to have taken the class for that reason. The assignments are not very difficult and the reading is manageable, however sometimes the organization of the class and of the class discussions can be a bit unclear.","This was a fun class with interesting material. Not always clear what the objectives for learning were though.","This is a very fun, extremely interesting class. You can bring in your life experiences and think about really important issues of globalization and race. The professor's excitement about the issues is contagious!","I have always felt that every student should take a course like this. The material is extremely interesting, and you learn about cultures unlike your own (given that you're a person of non-Caribbean descent, and even if you're not, the Caribbean is large enough to encompass multiple cultures - take your pick!). This course reminds you that the world is both large and small, and makes you conscious of your place in it.","This is wonderful course that clearly reflects the care that Akin put into. It's as interesting as it is insightful. You will be exposed to so much and will certainly expand your knowledge of \"world music.\"","An easy going class but sometimes the sections veer off the main topic depending on what people are interested in talking about. It definitely helps to have a background on Creole and\/or Caribbean societies.","This is a great class. The topics are great for anyone with an interest in music in particular. The directions for the response papers are vague, but the professor provides feedback along the way","take this class if Professor Hubbard is teaching it! I had no previous experience with history\/art of the Caribbean and West Africa but I did not feel unprepared. Really fun seminar. I was exposed to a lot of history, art and music that I had not learned about before.","Prof. Hubbard is very enthusiastic about the material he teaches, and this makes for a fun class. He is however wildly opinionated which takes away from a class that is supposed to be discussion based. The feedback you receive on your work will not be substantive and you will feel that part of every assignment is guessing what the professor's opinion would be."]}},"mostRecentQ":{"overall":"4.00","workload":"1.89","difficulty":"2.56","recommendation":"4.33","enrollment":"13","response rate":"69.23","QCourseOverall":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"0","2s":"0","3s":"1","4s":"7","5s":"1"},"QDifficulty":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"0","2s":"4","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"ANTHRO 1755","course_id":"165","cat_num":"88786","1s":"2","2s":"6","3s":"1","4s":"0","5s":"0"}},"success":true}