{"scores":{"Fall '15":{"course_score":{"overall":"4.70","workload":"2.80","difficulty":null,"recommendation":"4.90","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":"MBB 980f","course_id":"3528","cat_num":"40379","1s":"4","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.50","workload":"2.80","difficulty":null,"recommendation":"4.50","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":"MBB 980f","course_id":"3528","cat_num":"40379","1s":"4","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.10","workload":"1.60","difficulty":"2.00","recommendation":"4.20","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":"MBB 980f","course_id":"3528","cat_num":"40379","1s":"4","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MBB 980f","cat_num":"40379","course_id":"3528","year":"2013","term":"1","id":"1af36f76d42e3b8eb7b8d64c532a3985","first":" Florian","last":"Engert","InstructorOverall":"3.30","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Fall '12":{"course_score":{"overall":"4.77","workload":"1.85","difficulty":"2.23","recommendation":"4.77","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":"MBB 980f","course_id":"3528","cat_num":"40379","1s":"4","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MBB 99z","cat_num":"40379","course_id":"3528","year":"2012","term":"1","id":"1af36f76d42e3b8eb7b8d64c532a3985","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Fall '11":{"course_score":{"overall":"4.08","workload":"1.62","difficulty":"2.31","recommendation":"4.08","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":"MBB 980f","course_id":"3528","cat_num":"40379","1s":"4","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MBB 99z","cat_num":"40379","course_id":"3528","year":"2011","term":"1","id":"1af36f76d42e3b8eb7b8d64c532a3985","first":"Florian","last":"Engert","InstructorOverall":"4.00","EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null},{"number":"MBB 99z","cat_num":"40379","course_id":"3528","year":"2011","term":"1","id":"25e60a78f09e624056c9388c2da9fd84","first":"Shelley H.","last":"Carson","InstructorOverall":"3.85","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.83","GeneratesEnthusiasm":"4.08","FacilitatesDiscussionEncouragesParticipation":"4.08","GivesUsefulFeedback":"3.23","ReturnsAssignmentsinTimelyFashion":"2.77"}]}},"comments":{"Fall '11":{"comments":["I enjoyed the readings for this course greatly-- I would definitely recommend this course for anyone inherently interested in the question of creativity. Section enjoyment is directly related to the interest the students have in that particular lecture. Thus, an engaged set of students promote awesome discussion.","I really loved this class! I learned a lot about various aspects of creativity in a short period of time.","A very interesting topic that covers a wide variety of dimensions and approaches.  It's hard learning about a field in its infancy, but this class does a good job of framing it.","It isn't as intellectually challenging as I would have hoped.","Take it, it's awesome.","A great seminar that provides good reading material for an interesting topic. As someone not in MBB or neurobiology track, it can be intimidating, but I have enjoyed the course immensely. It is not difficult to follow so don't be discouraged by the fact that it's an MBB tutorial!"]},"Fall '12":{"comments":["This is an awesome class and everyone should take it!","This is a fascinating class that anyone would get a lot out of. Everything covered is really applicable to every field, and it provides a truly unique way of looking at the individual.","It was wonderful and interesting!","Fantastic class and a very interesting subject in neuroscience!","Classes could feel a bit long, since they were mostly powerpoints for 2 hours, but the material is interesting and Dr. Carson was wonderful- so pleasant and interesting! Pretty laid-back course to balance out a tough semester, but you can certainly get more out of it if you want.","This is a great course: the content was interesting, the professor was dedicated, and the assignments were painless.","This class was so interesting and fun. Studying a creative luminary throughout the semester really allowed us to learn more about someone through the lens of what we learned in class.  It was great to learn about creativity in so many ways! Probably my favorite class this semester.","A great way to study creativity from a biological perspective in a low stress and interactive environment"]},"Fall '13":{"comments":["If you are planning to take an MBB seminar, whether for academic requirements or personal enrichment, this class on Creativity Research is a great choice!  Dr. Carson knows a great deal about the testing of creativity and related factors like mental illness.  The weekly class meetings were two hours long, but I left each one feeling inspired by what I learned.  The assignments, aside from readings, include a series of short papers based on the biography of a chosen creative luminary, an in-class presentation, and a term paper analyzing a topic related to creativity. As a History and Science student, I felt this class provided good opportunities to explore the connections between my concentration and MBB material.","This seminar was an interesting and fun class. There was minimal required reading and the topics were really cool! Take it if you need something to balance an intense workload!","AWESOME COURSE!!!","So this is an easy psych seminar, and if that's what you're looking for, it's a good option.  The material is pretty interesting, but Dr. Carson manages to make a lot of it pretty bland and repetitive by just reading off slides.  The work consists of reading a biography and writing 5 response-style papers on it over the course of the semester, and then a class presentation with a partner and a 15-page final paper about basically anything.  The work isn't bad, but it's not negligible either.  Be forewarned that you will not receive any grades on any of your work all semester... as I write this in December after finals, I have not gotten anything back in the class at all.  The class is small, so it's relatively communal and friendly, and you do some neat in-class activities.  Plus, you don't have to do any of the readings ever.  But the majority of the time class is 2 hours of either Dr. Carson or your fellow students reading off slides about creativity.  Surprisingly uncreative if you ask me.....","This class is really a gem. The material can get a little dry, but the class itself is fairly interesting and low stress. There isn't much work outside of the 15 page final paper, which you can write about any topic related to creativity (anything). The assignments and readings are interesting and it was really exciting to learn them from a pioneer in the field. It's always funny to read a paper and see Dr. Carson's name all over the references page! She is really enthusiastic about the material, and fosters some interesting discussions.","This class is was you put into it.  We went over some really interesting concepts, but it's easy to skate by and not take advantage of them.","Very cool class and a lot of opportunity to learn about the process of creativity, the correlation of creativity and mental disorders, how creativity can be inhibited\/stimulated, and many more. Professor Carson is really cool and leads discussions well, but it is also very much on the individual student to take initiative in order to get the most out of this course. The readings that are assigned each week are very interesting and worthwhile, but one can easily get by without doing the readings. While this reduces your workload, it also makes it a much less enriching course if you're not prepared to engage during discussion."]},"Fall '14":{"comments":["Take this class! The workload is extremely manageable and the creative luminary project was really fun! Definitely start the term paper in advance because 15 pages will be brutal if left to the last minute.","This course is amazing. I looked forward to participating in section each week, and Shelley does an excellent job of creating a positive space for students to share their opinions about course material. I honestly looked forward to reading and writing about my creative luminary, and it was really interesting to hear about others' luminaries in class in comparison to my own. The final paper was a bit daunting, but Shelley offered excellent support to get through it, and I was very proud of my final paper. The only thing that I did not like was the lack of feedback on assignments. I did not receive all of my grades on my writing assignments and also never received my presentation score. Sitting here the day after finals have ended, I also have not received my final paper. While this should not deter someone from taking the course, it is something to consider if this kind of thing gives you anxiety.","This class is an absolute gem. It is fascinating and low-key, but every assignment is interesting. You get to choose any creative luminary you want to study for the whole semester, so you have a huge amount of say in what you are writing about and studying. Professor Carson is great. The material is incredibly relevant to daily lives, and all super super interesting. If you are looking for a class that is low-key, but (more importantly) absolutely fascinating, this class is by far the best option. I loved it.","Creativity is a fascinating topic and one that demands teaching by an expert like Shelley. Class discussions are fun and it is a wonderful learning environment.","This class is interesting, laid-back, and very enjoyable. Take it if the topic interests you."]},"Fall '15":{"comments":["Take this class! Dr. Carson is very knowledgeable, and the material is really interesting.","great class, definitely take","This is a really fun class! Prof. Carson is wonderful, and the material is really interesting--you'll learn a lot about creativity!","One of the most interesting class Ive taken at Harvard. Shelley knows absolutely everything about creativity.","This class is a good introduction into understanding creativity and the many aspects that contribute to it."]}},"mostRecentQ":{"overall":"4.70","workload":"2.80","difficulty":null,"recommendation":"4.90","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":"MBB 980f","course_id":"3528","cat_num":"40379","1s":"4","2s":"5","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"MBB 980F","course_id":"3528","cat_num":"128215","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}},"success":true}