{"scores":{"Fall '15":{"course_score":{"overall":"3.10","workload":"2.30","difficulty":null,"recommendation":"3.10","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"0","2s":"2","3s":"2","4s":"3","5s":"0"},"QDifficulty":{"number":"MBB 980e","course_id":"3521","cat_num":"91901","1s":"2","2s":"6","3s":"4","4s":"3","5s":"0"},"QWorkload":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"4","2s":"3","3s":"0","4s":"0","5s":"0"}}},"Spring '15":{"course_score":{"overall":"3.60","workload":"3.00","difficulty":null,"recommendation":"3.70","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"0","2s":"2","3s":"2","4s":"3","5s":"0"},"QDifficulty":{"number":"MBB 980e","course_id":"3521","cat_num":"91901","1s":"2","2s":"6","3s":"4","4s":"3","5s":"0"},"QWorkload":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"4","2s":"3","3s":"0","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"3.70","workload":"1.50","difficulty":"2.50","recommendation":"3.80","enrollment":"17","response rate":"94.12","QCourseOverall":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"0","2s":"2","3s":"2","4s":"3","5s":"0"},"QDifficulty":{"number":"MBB 980e","course_id":"3521","cat_num":"91901","1s":"2","2s":"6","3s":"4","4s":"3","5s":"0"},"QWorkload":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"4","2s":"3","3s":"0","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"3.57","workload":"1.43","difficulty":"2.14","recommendation":"4.00","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"0","2s":"2","3s":"2","4s":"3","5s":"0"},"QDifficulty":{"number":"MBB 980e","course_id":"3521","cat_num":"91901","1s":"2","2s":"6","3s":"4","4s":"3","5s":"0"},"QWorkload":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"4","2s":"3","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Spring '12":{"comments":["It's an interesting class and Cariani is super helpful, flexible, and easygoing on deadlines and assignments. You should definitely have some neurobiology background though.","Cariani is a terrible teacher -- but if you want to learn stuff on the topic it may be worth it","This course was enjoyable and complete survey of topics relating to music psychology. If you are interested in music and the effects on the brain, I would strongly recommend this class.","interesting and light work load. seminar format is excellent and allows for a lot of flexibility","The class has very interesting topics, but it is taught in a way in which it hard to pay attention and is a little boring, however the coursework is easy because you just have to write a summary each week.  And the essay you write at the end of the semester is easy to write because you choose your topic so you will therefore be very interested in what you're writing about. He gives you a lot of help on it too which is great.","It's very dense and a bit of a challenge to keep up for a freshmen, but you learn about one of the coolest aspects of social life: music!","It provides a good overview of music psychology, although sometimes the material is a bit dry and esoteric. The workload is very manageable and you are done with the course early on, which is very helpful at the end of the semester."]},"Spring '14":{"comments":["Great overview course of music psychology but you have to be self-motivated to get the most out of it.","Easy class, but a bit boring. Take it if you are interested in combination of music and neurobiology.","The presentations are a little scattered and difficult to follow, but the material itself is very interesting. Dr. Cariani is a very kind and understanding professor, and is always willing to give extra help sessions and extensions. The final paper, on whatever topic related to music and psychology you want, is a really fun project.","This class was very straightforward, and required very little engagement outside of attending class. The final project gave a lot of leeway, allowing students to pursue topics they enjoyed. The professor was very helpful, providing extensions for extenuating circumstances and gave constructive feedback on the final paper.","The class is low time commitment but lectures are really dry. The class is as much or as little as you make it. There is a lot of freedom for the final paper, which is nice, and professor Cariani gives very thoughtful comments. He is pretty flexible and obviously very knowledgeable. i just wish he put more organization and thought into his lectures.","This class is a low-key survey of music psychology. If you already have serious grounding in the fields of music theory or neurobiology, you are not likely to gain as much from the course.","Interesting subject, very disorganized and distracted lecturer.","The course is quite interesting but does require a bit of self-motivation.  It is very self-directed, with the term paper topic being entirely up to the student.  As long as a student is interested in music and its role in psychology already, this course is very worthwhile and educational.","If you are at all interested in the unique connections of music to the human brain and components of psychology, this course is a must!!!","Great!! So relevant to our lives-- we always listen to music and taking this class makes you more critical about that process!","Interesting material, but becomes redundant after a few classes.","This course provided an excellent survey of the neuropsychology of music. The readings were interesting, and Professor Cariani's lectures complemented them well. The final project allowed you to explore and delve deep into a topic of your choice, and Professor Cariani is willing to provide guidance, useful resources, and thorough feedback throughout this process.","I really enjoyed taking this course, and Dr. Cariani is a fantastic teacher - highly recommend it!!"]},"Spring '15":{"comments":["This is a great way to knock out a Neuro elective, and as a Neuro concentrator with no formal Psychology background, I still found the course material manageable. Professor Cariani is a great lecturer and is very approachable, which is important when it comes time to think about the final research project. Other than the weekly response papers, the research project is the only major assignment, one that requires much planning and time spent writing. This was overall a low-stress class to take in senior spring while still feeling like you learned something substantial. Take it!","The material is cool but you would get just as much out of buying the textbook and doing the research by yourself.","Be prepared to do a lot of independent work to figure out the topics since the lectures can be confusing .","If you're interested in how we perceive music and how it affects us, you'll want to take this seminar. With a light workload, two hours of lecture a week, and a term paper due at the end of the semester, it makes for a perfect senior year course or possibly a fifth course."]},"Fall '15":{"comments":["This course was almost painfully easy, but be prepared for the most disorganized course you've ever attended.","This course gives you an opportunity to think about music and its significance in our daily lives in a way that you never even imagined.","Great class if you are genuinely interested in the various aspects of music and the brain","The material that you cover is pretty interesting, and you get to choose what topic to you want to research for the term paper, so if you are really interested in the subject, it's probably worth taking. However, class itself could sometimes be a drag, even though it was only 2 hours per week. It just wasn't that engaging.","This course was not satisfactory.  Prof. Cariani's teaching style can be undirected and rambling.  His grading is too generous; students stop trying, which is bad enough in any class, but extremely deleterious in a class predicated on student co-learning.  I'd say leave this class alone unless you are really, really, like going to grad school and thinking about a PhD really interested in the subject matter."]}},"mostRecentQ":{"overall":"3.10","workload":"2.30","difficulty":null,"recommendation":"3.10","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"0","2s":"2","3s":"2","4s":"3","5s":"0"},"QDifficulty":{"number":"MBB 980e","course_id":"3521","cat_num":"91901","1s":"2","2s":"6","3s":"4","4s":"3","5s":"0"},"QWorkload":{"number":"MBB 980E","course_id":"3521","cat_num":"128214","1s":"4","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}