{"scores":{"Spring '13":{"course_score":{"overall":"4.87","workload":"3.60","difficulty":"3.40","recommendation":"4.87","enrollment":"16","response rate":"93.75","QCourseOverall":{"number":"ENGLISH 90dw","course_id":"1493","cat_num":"38035","1s":"0","2s":"0","3s":"0","4s":"2","5s":"13"},"QDifficulty":{"number":"ENGLISH 90dw","course_id":"1493","cat_num":"38035","1s":"0","2s":"0","3s":"9","4s":"6","5s":"0"},"QWorkload":{"number":"ENGLISH 90dw","course_id":"1493","cat_num":"38035","1s":"0","2s":"1","3s":"7","4s":"4","5s":"3"}}}},"comments":{"Spring '13":{"comments":["One of my favorite classes at Harvard. Challenges you to think deeply and uniquely about the material presented.","Take this course. Take it! Take it! Take it!\r\n\r\nDFW will change your life.","Sorry you missed such an awesome class. Great professor, collaborative atmosphere, amazing literature.","This class challenges you to think seriously about contemporary literature after Infinite Jest-- where is it going, who is doing it well, and why. It gives you the power to judge and predict the current state of American literature.","The reading list is great and Prof. Kelly is extremely knowledgable about this literature.  No background in Wallace is necessary, although Infinite Jest is quite a daunting task if you haven't read it before and are reading on a deadline!","An incredible course if you can get in. The texts are amazing, Professor Kelly knows exactly how to keep productive discussions going, and everyone in the class is equally enthusiastic about the material. I don't think I've ever felt as satisfied with the discussions in any of the seminars I have taken in my four years here. Unfortunately, I think Professor Kelly might be leaving before he teaches it again, but I strongly recommend it if anything like this is ever taught again.","Fantastic, though really would be most fantastic if it were 100% DFW.","The reading list is amazing (for the most part) and Professor Kelly is knowledgeable and kind. The reading load is huge, so go in knowing that."]}},"mostRecentQ":{"overall":"4.87","workload":"3.60","difficulty":"3.40","recommendation":"4.87","enrollment":"16","response rate":"93.75","QCourseOverall":{"number":"ENGLISH 90dw","course_id":"1493","cat_num":"38035","1s":"0","2s":"0","3s":"0","4s":"2","5s":"13"},"QDifficulty":{"number":"ENGLISH 90dw","course_id":"1493","cat_num":"38035","1s":"0","2s":"0","3s":"9","4s":"6","5s":"0"},"QWorkload":{"number":"ENGLISH 90dw","course_id":"1493","cat_num":"38035","1s":"0","2s":"1","3s":"7","4s":"4","5s":"3"}},"success":true}