{"scores":[],"comments":{"Fall '15":{"comments":["Take this course for something that you can't experience in many of the other music courses. Yosvany and Sarah were so great and so sensitive to how to introduce students to the new traditions.","TAKE IT!","If you're looking for an in-depth analysis of West African music traditions and their influence on musical movements of north\/south americas, I'm not too sure you'll find it here.","Music 142r is a very interesting course. Using African chants and rhythms, you learn about the importance of West African musical tradition's influence on modern music. Readings on the history of African and Caribbean musical traditions help provide context and a better understanding of the material, and hands-on assignments like the final composition help to solidify the material through application. I enjoyed the course a lot.","Very fun with a great atmosphere","participate as much as you can! the more you get into the music, the more enriching the class will be.","This is an incredibly enjoyable and low workload that expands your way of thinking about music!  You will learn a lot, but what you will learn will not be that concrete and definite.  The course will probably not teach you about jazz harmony to a thorough degree, and you won't leave being an expert on West African culture either.  However, you will develop new skills in listening and thinking critically, and you'll probably have a unique musical experience that you may not find anywhere else on campus.","this class is interesting, interactive, and super chill.  yosvany is great, and so is sarah (if she's still TFing).  hopefully the class will get a little more organized in its second year.","This class was really easy, which means that it might be made much harder in the future. We really didn't have many assignments (though the ones we did were very difficult).","The course won't be the same next time it's taught, so that's worth keeping in mind as you look at the q.","If you want to understand the complexity of African music and learn to appreciate this fantastic world, take the course. However, it is a little unorganized and chaotic and although the work requirement is minimal the lack of structure may create some stress."]}},"mostRecentQ":null,"success":true}