{"scores":{"Spring '17":{"course_score":{"overall":"4.40","workload":"5.40","difficulty":null,"recommendation":"4.40","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"BCMP 213","course_id":"2944","cat_num":"141859","1s":"0","2s":"0","3s":"0","4s":"2","5s":"3"},"QDifficulty":{"number":"BCMP 213","course_id":"2944","cat_num":"4782","1s":"1","2s":"0","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"BCMP 213","course_id":"2944","cat_num":"141859","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"BCMP 213","cat_num":"141859","course_id":"2944","year":"2016","term":"2","id":"14a07a4ae2b9653f6fc13f16e31b4530","first":" Brian D","last":"Kangas","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"},{"number":"BCMP 213","cat_num":"141859","course_id":"2944","year":"2016","term":"2","id":"b3591ec7aed7d7adb7b31c1aeb965989","first":" Jack","last":"Bergman","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '16":{"course_score":{"overall":"4.60","workload":"5.00","difficulty":null,"recommendation":"4.60","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"BCMP 213","course_id":"2944","cat_num":"141859","1s":"0","2s":"0","3s":"0","4s":"2","5s":"3"},"QDifficulty":{"number":"BCMP 213","course_id":"2944","cat_num":"4782","1s":"1","2s":"0","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"BCMP 213","course_id":"2944","cat_num":"141859","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"BCMP 213","cat_num":"141859","course_id":"2944","year":"2015","term":"2","id":"14a07a4ae2b9653f6fc13f16e31b4530","first":" Brian D","last":"Kangas","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"3.70","ReturnsAssignmentsinTimelyFashion":"4.00"},{"number":"BCMP 213","cat_num":"141859","course_id":"2944","year":"2015","term":"2","id":"b3591ec7aed7d7adb7b31c1aeb965989","first":" Jack","last":"Bergman","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '14":{"course_score":{"overall":"5.00","workload":"1.50","difficulty":"2.00","recommendation":"4.50","enrollment":"2","response rate":"100.00","QCourseOverall":{"number":"BCMP 213","course_id":"2944","cat_num":"141859","1s":"0","2s":"0","3s":"0","4s":"2","5s":"3"},"QDifficulty":{"number":"BCMP 213","course_id":"2944","cat_num":"4782","1s":"1","2s":"0","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"BCMP 213","course_id":"2944","cat_num":"141859","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Spring '14":{"comments":["This class is an excellent introduction to behavioral testing in pharmacology. The course focusses heavily on examining different behavioral studies, and it would therefore be beneficial to have some background in psychology. The class is very manageable if you do all of the readings and ask questions during class. Other than the readings, there are no psets, and the final evaluation is a ten page paper on a topic of the student's choice. Professors Bergman and Kangas are excellent, and I would highly recommend this class.","If you are looking for a chill elective to take, and you are interested in pharmacology, take this class! It's very laid back. We had two students (and two professors), so the small-group setting allowed for a lot of in-depth discussion on papers whose topics ranged from basic principles of behavioral pharmacology to the different drug types. I took this course during my senior spring as an elective, because I had taken Psych1201 (Your Brain on Drugs: Psychopharmacology) in the fall and really enjoyed the topic. It's a great class to take."]},"Spring '16":{"comments":["It was good, otherwise I wouldn't have gone all the way to Cambridge. However, the final paper at the end can be time consuming, so graduate students should consider that.","In this course, you get a chance to survey a broad array of topics in behavioral pharmacology throughout history, from addiction to antipsychotics. The most impressive aspect is that class meetings are largely discussion-based, allowing us to critically evaluate primary research articles and propose potential experiments\/future directions. The professors are engaging and knowledgeable. However, the downside of this course is that there are very few assessments (2 short quizzes, final paper) making it difficult sometimes to retain information from previous weeks and bring them up in lecture. I recommend taking notes on readings in order to refer to them in later weeks, because the concepts are cumulative.","This was my favorite course this semester! The professors are amazing, and a 2 faculty: 5 student ratio in the class was perfect for discourse! The material was fascinating, and the professors made sure that everyone participated in every class session. The main work involved in the course is reading scientific articles, and it is really important that you do all of the readings because you will discuss all of them in detail each class session. I really enjoyed this class and learned so much from Professor Bergman and Professor Kangas. I highly recommend this class!","BCMP 213 was a great dive into the field of behavioral pharmacology. Drs. Bergman and Kangas make the course material accessible from day one. The small class (5 our year) makes for lively discussion each session. Because it is a small size, it is run more like a section or journal club than a traditional course, so be prepared to invest time in preparing for discussion each day. Readings can be time-consuming if they cover new assays or are highly technical, but the course tries to make everything manageable. The final paper can be a difficult assignment because you have so much freedom, but you are allegedly graded based on how you respond to feedback (we shall see if this is true when I get my mark back!) so it becomes manageable."]},"Spring '17":{"comments":["This course is a gem of Harvard courses open to undergrads. The professors are very knowledgeable and patient in unpacking the material. As someone who didn't have too much experience reading scientific papers, I've learned so much and developed the skills to read papers critically as a scientist. The course is very relevant especially for those interested in pharmacology, drug development, animal models and research. The fundamentals of behavioral pharmacology are very well taught and reinforced over the course of the semester.","Great and engaging class. In Spring 2017, the class was composed solely of undergrads, but we all enjoyed discussing each week's readings in a seminar style that was truly graduate-level. I left each class feeling like I had learned so much more than I expected.","Although the course load is on the heavier side with 5 papers on average each week to read, you will get so much out of it -- a sufficiently adequate review of the different drug classes (opioids, psychomotor stimulants, analgesics, etc), tolerance, addiction and drug dependence.","Most Definitely."]}},"mostRecentQ":{"overall":"4.40","workload":"5.40","difficulty":null,"recommendation":"4.40","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"BCMP 213","course_id":"2944","cat_num":"141859","1s":"0","2s":"0","3s":"0","4s":"2","5s":"3"},"QDifficulty":{"number":"BCMP 213","course_id":"2944","cat_num":"4782","1s":"1","2s":"0","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"BCMP 213","course_id":"2944","cat_num":"141859","1s":"1","2s":"4","3s":"0","4s":"0","5s":"0"}},"success":true}