{"scores":{"Fall '12":{"course_score":{"overall":"4.50","workload":"2.39","difficulty":"3.11","recommendation":"4.50","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"0","3s":"3","4s":"3","5s":"12"},"QDifficulty":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"0","3s":"16","4s":"2","5s":"0"},"QWorkload":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"11","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 62","cat_num":"37743","course_id":"1488","year":"2012","term":"1","id":"5803a5a34ebf6e53757c113ac97051c0","first":"John","last":"Stauffer","InstructorOverall":"4.76","EffectiveLecturesorPresentations":"4.67","AccessibleOutsideClass":"4.22","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"4.53","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"3.72"}]},"Fall '10":{"course_score":{"overall":"4.16","workload":"2.58","difficulty":"2.92","recommendation":"4.12","enrollment":"29","response rate":"89.66","QCourseOverall":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"0","3s":"3","4s":"3","5s":"12"},"QDifficulty":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"0","3s":"16","4s":"2","5s":"0"},"QWorkload":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"11","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 62","cat_num":"37743","course_id":"1488","year":"2010","term":"1","id":"5803a5a34ebf6e53757c113ac97051c0","first":"John","last":"Stauffer","InstructorOverall":"4.31","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.16","GeneratesEnthusiasm":"4.38","FacilitatesDiscussionEncouragesParticipation":"4.42","GivesUsefulFeedback":"4.27","ReturnsAssignmentsinTimelyFashion":"4.38"}]},"Spring '10":{"course_score":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":null,"response rate":null,"QCourseOverall":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"0","3s":"3","4s":"3","5s":"12"},"QDifficulty":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"0","3s":"16","4s":"2","5s":"0"},"QWorkload":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"11","3s":"7","4s":"0","5s":"0"}}}},"comments":{"Fall '10":{"comments":["Excellent professor. Genuinely enthusiastic, loves to hear from students. This class will make it easier to speak up in other classes. Interesting texts and themes. Opportunity for extra credit.","I think this is an excellent class for someone who is interested in English or Hist and Lit, but hasn't yet taken a course. The readings are interesting, the pedagogy is encouraging, and it is not very difficult. If you've taken a few English classes, you might not take away much from the class itself, though both Professor Stauffer and Kaye are excellent resources one-on-one.\r\n\r\nMy main complaint is that the class is a little to large to sustain real discussion, though if they add a true section component to the course I think this would change.","A truly enriching class, a great way to read lots of great American literature with a teaching staff that actually enjoys it.","its slightly frustrating how Stauffer encourages people in the class to say any unrelated tangential comment in discussion.","This class kind of reminded me of the books I read in AP English in high school, but they were so much fun to revisit, and the teaching was great!","This course was really not for me, but English students have to fulfill a requirement.  Great books, great teacher, unfortunate format.","A lot of reading, but great books.","Not to be missed. Professor Stauffer is incredible, supportive, and highly knowledgeable and passionate about literature.","This is a good way to fulfill your diffusions requirement, but not my favorite course. It's a good course, you've probably read a few of the books already. However, it's definitely an American literature course, which I can't help but feel is a myopic way to examine the diverse way that English literature has spread into the modern world. I don't know if Castaways and Renegades quite lives up to its name.","This class is fantastic! Prof Stauffer is brilliant and humble, and he cares so much about the literature. Speaking of which, we read some great books, and we have really great discussions about them. Highly recommended!","the fact that professor stauffer is a caring and kind instructor does not make up for the lack of substance in much of the discussion of the materials in the class","It's a lot of work. Be prepared for that. But it's an awesome course, with wonderful reading materials and a passionate, eloquent lecturer and intelligent, helpful, insightful TF and you should take it anyway...as long as you love to read! The essays especially can be a bit dense, so be a fast reader, too.","This class was wonderful! Professor Stauffer and Kaye were so helpful and interesting; a class like this is the reason I love Harvard so much.","This course involves a lot of reading and writing, but Professor Stauffer is fantastic, and the assignments are well worth it. Make the effort to get to know the professor and TF - they're great and really helpful.","I only found this class easy because I was taking three courses. Otherwise, the workload would probably have been much tougher to handle.","TAKE THIS CLASS!  John Stauffer is brilliant, Kaye is so sweet and brilliant, and the reading is amazing.  Seriously, take this class."]}},"mostRecentQ":{"overall":"4.50","workload":"2.39","difficulty":"3.11","recommendation":"4.50","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"0","3s":"3","4s":"3","5s":"12"},"QDifficulty":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"0","3s":"16","4s":"2","5s":"0"},"QWorkload":{"number":"ENGLISH 62","course_id":"1488","cat_num":"37743","1s":"0","2s":"11","3s":"7","4s":"0","5s":"0"}},"success":true}