{"scores":{"Spring '15":{"course_score":{"overall":"4.90","workload":"4.20","difficulty":null,"recommendation":"4.90","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"PSY 980S","course_id":"12585","cat_num":"156040","1s":"4","2s":"5","3s":"6","4s":"4","5s":"1"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980S","course_id":"12585","cat_num":"156040","1s":"9","2s":"7","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Spring '15":{"comments":["Justin is incredible! If you have the opportunity to take this course - TAKE IT. Cyborg Psychology is a new and advancing field of study, and all the readings were engaging and fascinating!","I would highly recommend this course if it is offered again - not too much work and lots of interesting readings and discussion about the future of psychology and technology. Taking the class will help you learn the science underlying future trends and will also get you thinking about the relevant ethical and philosophical issues.","Fantastic class!!!! It was entirely manageable workload wise (the readings take a long time especially if you don't have much neuro background, but they're really interesting), and the discussions were extremely interesting and made me think. I learned a lot and there was very little stress, really the perfect class. The final projects were so much fun to do and I also learned a lot from doing them. Justin is a fantastic teacher.","This class was incredible, such a gem! Justin is probably one of the best professors I've ever had and this was one of my favorite classes at Harvard. The discussion component really changed the way I think about a broad range of topics and how humans interact with technology. The class was super relevant to where the world is heading, how human intelligence\/cognition may be changing, etc. It also did a great job at improving my ability to think critically and think about the different technologies in context (e.g. what are the ethical considerations that go with this technology? How might this technology affect human relationships? etc). Justin also is super passionate about teaching students and empowering them to learn for knowledge's sake. He's such a great professor and very accessible outside of class. A very supportive and effective educator. I know this class isn't being offered next year but if it were I'd say make sure you take it! I hope Justin finds a way to teach others about these the importance of these themes and topics through his other roles. I very much enjoyed this class.","This is a great seminar class that exposes you to the exciting intersection of psychology, neurobiology, and technology. The articles we read and discussed each week have blown my mind - there's this very frequent feeling of amazement in turning sci-fi into reality. I really hope this course will be offered next year!","While Justin is leaving Harvard next year, in Cyborg Psychology he has created a much needed course in the psych department. There was not a day this semester that one of the readings (whether about brain-to-brain interfaces, neural prosthetics, or even cognitive enhancement) didn't come up in conversation. Some of the readings felt like sci-fi, but that was why they were so fascinating and thought provoking to discuss. The class was easy in terms of workload, but really made you think. Unfortunately, there was very little feedback on performance or work conducted and the final project was a bit difficult to sift through, but it was a great course overall. Also, hopefully whoever teaches it next year also has a mix of Psych, VES, CS, Hist of Sci, and other concentrators...it made the course even more interesting.","So thought provoking, relaxed, but intense education at the same time, you get as much out of it as you put into it, engaging with classmates will make it all the more meaningful. If you are interested in cyborg psychology or the future of the technology-human relationship at all, you should take it."]}},"mostRecentQ":{"overall":"4.90","workload":"4.20","difficulty":null,"recommendation":"4.90","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"PSY 980S","course_id":"12585","cat_num":"156040","1s":"4","2s":"5","3s":"6","4s":"4","5s":"1"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980S","course_id":"12585","cat_num":"156040","1s":"9","2s":"7","3s":"3","4s":"0","5s":"0"}},"success":true}