{"scores":{"Fall '15":{"course_score":{"overall":"4.40","workload":"6.30","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"NEUROBIO 105A","course_id":"12561","cat_num":"156051","1s":"0","2s":"0","3s":"1","4s":"5","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"NEUROBIO 105A","course_id":"12561","cat_num":"156051","1s":"0","2s":"7","3s":"4","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.00","workload":"4.70","difficulty":null,"recommendation":"4.10","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"NEUROBIO 105A","course_id":"12561","cat_num":"156051","1s":"0","2s":"0","3s":"1","4s":"5","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"NEUROBIO 105A","course_id":"12561","cat_num":"156051","1s":"0","2s":"7","3s":"4","4s":"0","5s":"0"}}}},"comments":{"Fall '14":{"comments":["Do take this if you are interested in computational neurobiology--it's one of the only opportunities to be introduced to the field at the undergraduate level, and it's a well-designed survey of various major topics.","Recommended only for people genuinely curious about the computational part of neuroscience! This class is a way to jump in the deep end for those who don't have much experience with math, and a wonderful way to explore neuro for those who do. Alexander and Ashesh are amazing individuals and super approachable, but we still need to work out a way to balance the class between the math experts and the novices.","A tough class, but you'll learn a lot more than any other Neuro class I've taken so far.","This is a great introduction to computational neuroscience!  Ashesh and Alex are both really cool, and the material is very interesting.  There were a couple of aspects of the course that may have been slightly suboptimal, such as spending a little too much class time talking about programming assignments and student presentations and not enough time covering new material.  However, in general this course is quite good, particularly considering this is the first time this course is offered.  I highly recommend it.","Great class! The small class, led by Alexander and Ashesh who are really knowledgeable and also very caring, will allow you to learn a whole lot."]},"Fall '15":{"comments":["Be prepared to work more than is usually expected for a tutorial.","A wonderful and informal way to engage with researchers on the subject of what they do!","If you haven't taken programming, be prepared to spend a lot of time coding. Coding assignments will take more than 2 hours.","The instructors are great, the material is interesting, but you might leave feeling unsatisfied because it's not entirely clear what you're supposed to get out of the class.","This is one of those classes where you take out what you put in. Read the required readings, try to understand the math and logic behind the problem set problems and ask for help when you are stuck. It's an incredible class, and the material is really interesting. It's not going to come easily-- work hard and you will learn a lot.","I LOVE THIS CLASS! I took this class because I was hoping to develop a more quantitative background for my research, so I was a little intimidated at first. But with lectures, MATLAB, informative homework assignments, and accessible professors, I have learned so much. I feel so confident tackling quantitative problems in neuroscience, and it's so empowering."]}},"mostRecentQ":{"overall":"4.40","workload":"6.30","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"NEUROBIO 105A","course_id":"12561","cat_num":"156051","1s":"0","2s":"0","3s":"1","4s":"5","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"NEUROBIO 105A","course_id":"12561","cat_num":"156051","1s":"0","2s":"7","3s":"4","4s":"0","5s":"0"}},"success":true}