{"scores":{"Spring '15":{"course_score":{"overall":"4.20","workload":"6.20","difficulty":null,"recommendation":"4.20","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '15":{"comments":["Margaret is the main reason to take this class - an amazing, enthusiastic and very accessible and devoted preceptor! However much I disliked expos, she allowed to alleviate the pressure from it.","My favorite class of the year--this is an anomaly because most students dread expos writing!  One of the most intellectually-driving courses I've had thus far in my Harvard career.  The preceptor actively seeks to accommodate your personal needs--always willing to meet outside of class to discuss aspects of the writing process that you may be having trouble with.  Did I mention that she occasionally brings us sweet treats?","This class requires you to be very invested in your writing and truly care aboutt it in order to succeed.","Margaret is a fantastic preceptor!!! She is so accommodating and understanding of students.  She will give you extensions, advice, meet-ups, whatever you need within reason.  She genuinely cares about us and wants us to succeed in the class.  The class itself was very enjoyable and I looked forward to it. The essays are interesting enough-- you write about freedom, and get the opportunity to choose exactly what subtopic within that you want to write about. The readings (short stories, no novels) are good too. You get to see a lot of movies.","Margaret is a great preceptor, who really tries to make your expos experience a great one and, as such, I definitely recommend this class.","This class is already includes some interesting course material, but Margaret makes the class what it is. She is fun and engaging, making the course something to look forward to.","This is a great course! This should definitely be your absolute top choice!","The material you have to the opportunity to engage with is very fun; I would definitely recommend this course to any prospective student.  However, I would be aware that this course will certainly hold you to task to incorporate all of the elements of the academic essay that are taught.   Even good writing can sometimes fall second place to fulfilling the guidelines set forth by the course and preceptor.","This class is fun and one of the best Expos classes from what I've heard of! The topic of breaking the rules itself is very interesting and the course is structured very well."]}},"mostRecentQ":{"overall":"4.20","workload":"6.20","difficulty":null,"recommendation":"4.20","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}