{"scores":{"Fall '12":{"course_score":{"overall":"3.73","workload":"1.45","difficulty":"2.64","recommendation":"3.36","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"FRSEMR 37z","course_id":"1848","cat_num":"1725","1s":"1","2s":"1","3s":"2","4s":"3","5s":"4"},"QDifficulty":{"number":"FRSEMR 37z","course_id":"1848","cat_num":"1725","1s":"0","2s":"4","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 37z","course_id":"1848","cat_num":"1725","1s":"6","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 37z","cat_num":"1725","course_id":"1848","year":"2012","term":"1","id":"ac78e49932a94b4b4ac4422d4e70a2da","first":"Russell Edward","last":"Jones","InstructorOverall":"4.27","EffectiveLecturesorPresentations":"4.45","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.82","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"3.70","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Fall '06":{"course_score":{"overall":"3.70","workload":"1.40","difficulty":"2.40","recommendation":"3.70","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"FRSEMR 37z","course_id":"1848","cat_num":"1725","1s":"1","2s":"1","3s":"2","4s":"3","5s":"4"},"QDifficulty":{"number":"FRSEMR 37z","course_id":"1848","cat_num":"1725","1s":"0","2s":"4","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 37z","course_id":"1848","cat_num":"1725","1s":"6","2s":"5","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '12":{"comments":["You better have a large interest in just sitting around a table discussing Socratic dialogues for two hours a week if you are considering taking this seminar. Honestly, this class put me to sleep every single week and the readings were long, tedious, and boring. The essays weren't bad and the work itself isn't that overwhelming, but it is only tolerable if you like to write. There are definitely way better seminars out there. I felt like a wasted a class. You'd be much better off taking a gen ed than this seminar.","The seminar introduces you to some of the fundamental points associated with Socrates through the dialogues and provides you with alternative perspectives on the same issues through the other readings. The workload is light. The quality of the class really depends upon the students' willingness to participate intelligently in the discussions each week.","Be prepared to have a great time reading some of history's most praised philosophers. The course isn't streamlined around any one particular aspect of philosophy; rather, it samples from many of its different branches.","This course is a reading-discussion based course that looks at a lot of topics but still manages to treat them with consideration and a certain level of detail. I would recommend this class if you are interested in matters of philosophy, because you will end up doing a lot of reading and a lot of discussion. If you lose interest with discussions and cannot stomach philosophy in considerable quantities, I would not recommend the course. You'll be most satisfied with the course if you can enjoy doing both. The professors and knowledgable and love to talk about the issues at hand. \r\n\r\nThe weekly workload is not terribly heavy. You'll have a reading or two per week and a short response paper due before each class, with some longer papers scattered throughout. Rorty and Jones are constructive but critical graders, so don't think you'll be able to get away with half-baked papers.","I would say that this class definitely has the potential to be very interesting and engaging, depending on how much initiative you and classmates take."]}},"mostRecentQ":{"overall":"3.73","workload":"1.45","difficulty":"2.64","recommendation":"3.36","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"FRSEMR 37z","course_id":"1848","cat_num":"1725","1s":"1","2s":"1","3s":"2","4s":"3","5s":"4"},"QDifficulty":{"number":"FRSEMR 37z","course_id":"1848","cat_num":"1725","1s":"0","2s":"4","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 37z","course_id":"1848","cat_num":"1725","1s":"6","2s":"5","3s":"0","4s":"0","5s":"0"}},"success":true}