{"scores":{"Fall '14":{"course_score":{"overall":"4.80","workload":"5.90","difficulty":null,"recommendation":"4.80","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.258","course_id":"12326","cat_num":"74574","1s":"0","2s":"0","3s":"0","4s":"3","5s":"10"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EXPOS 20.258","course_id":"12326","cat_num":"74574","1s":"2","2s":"8","3s":"0","4s":"1","5s":"1"}}}},"comments":{"Fall '14":{"comments":["A great class with interesting reading materials","If you're interested in literary analysis, the themes of War, good books, war films, or really good discussions, take this course. Maggie's feedback is outstanding and you will learn a great deal about academic writing and argumentation. One warning: if you can't stand pure literary analysis or if writing an essay that requires you to develop a prompt\/ analytical question yourself sounds nightmarish, consider other options.","Though expos is never the best class, War Stories made it the best it could be. Maggie is an engaging and enthusiastic teacher, who really helps you learn a lot about writing. The course material is also interesting.","It's not an easy course, but structured pretty well and covers interesting books. Preceptor is pretty good.","The work is interesting and the writing is engaging.","War Stories was a fantastic class -- It made Expos fun! Maggie is a fantastic instructor, the workshops and assignments helped me learn to craft longer arguments, and the workload was less than that of other Expos classes (from what I have heard). There was not much work on writing style, and at times I felt like I was writing for the teacher; choosing my arguments based on what she liked at our draft conferences. However, that seems to be a general trend in Expos courses. The readings in War Stories are also great. Even if you have already read the books, you won't be disappointed!","War Stories seeks to impart on the students an understanding of the true depth of warfare spanning a century of our history. Through a study of literature and film it covers a comprehensive list of often ignored aspects of war that affect society, human interaction, and the human psyche. 9\/10 would recommend.","Dr. Doherty is awesome.","This is a great class where you will really learn about the act of writing.","Great choice for expos. Stimulating readings and a solid step by step approach to what we should focus on in our papers.","I couldn't have hoped for a better expos class. I was surprised with how much I enjoyed it!"]}},"mostRecentQ":{"overall":"4.80","workload":"5.90","difficulty":null,"recommendation":"4.80","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.258","course_id":"12326","cat_num":"74574","1s":"0","2s":"0","3s":"0","4s":"3","5s":"10"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EXPOS 20.258","course_id":"12326","cat_num":"74574","1s":"2","2s":"8","3s":"0","4s":"1","5s":"1"}},"success":true}