{"scores":{"Spring '15":{"course_score":{"overall":"5.00","workload":"5.40","difficulty":null,"recommendation":"4.90","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '15":{"comments":["This course is special because the instructor genuinely wants to teach you the craft of a historian, focusing on research and writing.","Shane is an amazing teacher. Take a course with Shane. It will be hard, but it is why you came to Harvard. Who cares about a grade? One grade. He will work you hard, so hard, but it is so worth it. I am a better researcher, speaker, writer, and scholar because of Shane's course. I cannot say that about most of the history courses I have taken at Harvard. If Shane teaches this class again, take it. It will be even cleaner and more orderly. The dude gets it. He really gets it.","If this course is ever offered again, you absolutely should take it, but only if it is being taught by Shane. He is brilliant, smart, nice, and will work you a bit like a dog but it's worth it because it will prepare you to write a thesis. You should take it as a junior or a sophomore because there's zero point in learning these skills if it's too late to have it help you out academically. The readings are long, and the assignments are not a joke but if you do it right and Shane is teaching you the end result will be an amazing class that you will really appreciate and you will write a knock out paper. Shane's genius is not to be missed.","One of the best classes at Harvard, a history tutorial you should not miss the opportunity to take","I enjoyed the subject material of this class. It was interesting to learn about history from the perspective of groups of people. I took this class for the instructor, however. Shane is one of the brightest and most helpful people I have ever met. He has offered me great advice and taught me a lot. Honestly, I would have taken his course regardless of the subject material.","A great seminar class with interesting material and a lot of relevance to current events even though its scope extends to Antiquity and the Middle Ages. The most rigorous research expectations I have experienced at Harvard so far. Shane is uncompromisingly strict in his grading, and he demands a standard of excellence that might catch many people off guard.\r\nStill, Shane's demands pushed me to a new level of work, and his critiques, while deep-cutting, were always constructive. Shane really cares about his students, even going out of his way to put on extra writing\/research lessons outside of class. This class showed me what I think the History sophomore tutorial should be, ideally. I feel like I learned a lot of interesting information while also gaining confidence and practical experience. The class was intense but rewarding.","Shane is one of the best instructors that I've had at Harvard, and this class is one of the most fruitfully and productively challenging that I've ever taken. Take it to learn about the history of the crowd, take it learn about how to be a good historian or just a scholar in general. As long as you are conscientious and are willing to invest in it (go to office hours, do the readings, spend the time on the assignments), you will get a lot out of it."]}},"mostRecentQ":{"overall":"5.00","workload":"5.40","difficulty":null,"recommendation":"4.90","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}