{"scores":{"Fall '14":{"course_score":{"overall":"4.20","workload":"4.60","difficulty":null,"recommendation":"4.40","enrollment":"32","response rate":"75.00","QCourseOverall":{"number":"SOCIOL 173","course_id":"12639","cat_num":"20952","1s":"0","2s":"2","3s":"3","4s":"7","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SOCIOL 173","course_id":"12639","cat_num":"20952","1s":"5","2s":"11","3s":"4","4s":"0","5s":"0"}}}},"comments":{"Fall '14":{"comments":["Take this class","Awesome class","This class will teach you amazing theories that you will ACTUALLY use in other classes. I constantly referenced theories that I learned in this class in other classes.","One of my favorite classes in 4 years at Harvard. Watch a bunch of classic movies (from the Godfather to the Wolf of Wall Street), write a few short papers, and then make a movie as your final exam. What's not to love?","Great course with interesting films and readings as well as great section discussion, which is rare. Films and topics covered a range of contemporary issues with classic must-see films. I felt like this course was an even better introduction to important topics in Sociology than my sophomore tutorial. It helps to work on the summary parts of the unit papers while doing the readings for the week, otherwise you have to go back later and reread to remember what the articles were about. Start the final project early and film short pieces throughout the semester. Definitely recommend this class and would take it again if I had the chance!","Great course that was both interesting and informative.","Even if you don't think you will religiously watch the movies (most people didn't) it is pretty fun analyzing things like the Godfather and Avatar for once. A very laid back, fun course.","This class is a great way to gain a comprehensive view of the world of sociology. It is very interesting to tie the theorems of sociologists to modern films such as Avatar and The Wolf of Wall Street. Finally, the final project is incredibly fun and interesting.","Definitely take this class if you have even the slightest interest in integrating film and academic disciplines. This is a very chill class (assignments are simple and do not take long to complete), and the course content is really interesting. Plus, you get to watch fantastic films and shows (i.e., The Wire, House of Cards, The Godfather, The Social Network, Psycho, The Wolf of Wall Street, 12 Years a Slave, There Will Be Blood...need I say more?)","A great interactive course that you can be creative in as well.","This class was approachable and fun, particularly if you are interested in learning more about people and how they interact on different scales.","Great films! Interesting idea, but the lectures and sections weren't great.","This was THE easiest class I've taken at Harvard, extremely basic and not at all stimulating discussion in lecture and section, lecture was really unnecessary, never needed to pay attention. It was all breadth, no depth. Teaches like 25 different topics in sociology, but none of them really offered anything worth remembering. If you've taken even one sociology course before, this will pale in comparison. Barely learned a thing, least challenging course at Harvard.","Take this class if you like the plot content\/message of movies.","This class is a great course surveying a variety of themes in sociology. However, the class is primarily focused on sociological arguments, not film or visual analysis. This might not appeal to a student interested in film studies or VES, but would be a good introductory course for students interested in pursuing sociology.","Fun way to view sociology and sociological concepts through movies, TV shows, and other readings and papers"]}},"mostRecentQ":{"overall":"4.20","workload":"4.60","difficulty":null,"recommendation":"4.40","enrollment":"32","response rate":"75.00","QCourseOverall":{"number":"SOCIOL 173","course_id":"12639","cat_num":"20952","1s":"0","2s":"2","3s":"3","4s":"7","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SOCIOL 173","course_id":"12639","cat_num":"20952","1s":"5","2s":"11","3s":"4","4s":"0","5s":"0"}},"success":true}