{"scores":{"Fall '14":{"course_score":{"overall":"4.30","workload":"5.70","difficulty":null,"recommendation":"4.30","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.275","course_id":"12343","cat_num":"80449","1s":"0","2s":"0","3s":"3","4s":"5","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EXPOS 20.275","course_id":"12343","cat_num":"80449","1s":"1","2s":"8","3s":"2","4s":"1","5s":"0"}}}},"comments":{"Fall '14":{"comments":["It's an interesting course where you learn a fair amount about both the topic and how to improve your writing.","If you are interested in the theory of democracy and technological innovations in government, take this class. However, the readings and essay questions are pretty specific about the topic. Yascha gives great feedback on essays and your writing really does get better over the course.","Yascha is awesome, and the topic is very interesting. He is also very accommodating, and for me, it never seemed like Expos deadlines interfered with deadlines for other classes. Some of the people I've talked to in other Expos classes have complained about when their assignments were due.","Unlike some expos courses, Yascha manages to make Democracy in the Digital Age an overall pretty engaging course. Although the first 2 or 3 weeks are medium levels of interesting (depending on how fascinating you find reading the Constitution, and the Federalist Papers), from then on pretty much all of the readings\/documentaries are actually a worthwhile read. It helps that Yascha is a passionate, humorous, and pretty chill guy in class, so class discussions with him are actually productive and interesting. Made my experience in expos much more positive than I expected.","While I initially did not like the course, I now realize its value every time I work on an academic paper. The topic is interesting and relevant, and many of the readings after the first unit are contemporary.","Great teacher, leads classrooms discussions well, offers informative feedback","Great introduction to writing at the college level. Readings, gradings, and feedback were all reasonable and helped encourage stronger writing. Yascha was a great preceptor and did a good job preparing for and furthering class discussion. My favorite class this semester.","I really enjoyed this class. The first unit was a bit boring because a lot of it was the Founding Fathers' political theories, but the second and third units were fascinating -- I learned so much about government and technology that I hadn't even considered before. In terms of the writing aspect of the course, it will help if you have a strong background already in writing clear, well-structured, well-argued papers but this course does provide a lot of leeway for those who improve throughout the course (the final paper counts a lot more than the first ones). By the end of the course you will become a better academic argument writer. Yascha is a great discussion leader and provides excellent, detailed feedback on your papers. Take this course if you are interested in government\/democracy, it is quite enjoyable if you allow yourself to be absorbed by the material.","This course is really helpful for writing gov-related essays in the future. The readings are slightly heavy but hugely rewarding. Yascha is a fantastic instructor.","Absolutely recommend this course. It greatly improved my writing and the preceptor is extremely helpful.","It's an okay expos course, and it's ultimately helpful in bettering your writing, but I don't know how much it's better than another expos course. The professor is good, but a little strange, and gives some very helpful advice on writing. I thought it would be more of a media and journalism class, but it's literally about democracy proposals that utilize e-voting and stuff. Just be aware that it's all about systems of government and takes a while to get to the \"digital age\" part.","This is a fantastic course if you're interested in CS, government, or both (like I was). Yascha is a great preceptor, the essays are really tough but really formative, and you become a much stronger thinker and writer - and, honestly, a much smarter person.\n\nBeyond just the writing itself - which was a strong opportunity for growth - the subject matter was fantastic, which is much more than I can say for other Expos classes. It's great learning about the intersection of two very important and very interesting fields.\n\nThere's plenty of freedom to explore whatever you want, especially on Essay 3. For all the essays, you can really choose whatever position you want and Yascha will buy it. There's no right answer. There's plenty of opportunity for independent exploration, and you can learn tons about how democracy and government work and how technology can play into that. It's more a government class than a CS class - it's a government class with a technical angle, which I found really fascinating.\n\nThis was easily my most difficult course of the semester, but it was worth it. TAKE IT if you like either of the subjects! 100%.","Great combination of writing and studying the democracy of the US."]}},"mostRecentQ":{"overall":"4.30","workload":"5.70","difficulty":null,"recommendation":"4.30","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.275","course_id":"12343","cat_num":"80449","1s":"0","2s":"0","3s":"3","4s":"5","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EXPOS 20.275","course_id":"12343","cat_num":"80449","1s":"1","2s":"8","3s":"2","4s":"1","5s":"0"}},"success":true}