{"scores":{"Spring '16":{"course_score":{"overall":"4.30","workload":"4.70","difficulty":null,"recommendation":"4.80","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"GOV 94YM","course_id":"12415","cat_num":"156446","1s":"0","2s":"0","3s":"1","4s":"4","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94YM","course_id":"12415","cat_num":"156446","1s":"0","2s":"7","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 94YM","cat_num":"156446","course_id":"12415","year":"2015","term":"2","id":"78c4d3ebd4575dd79822d996529422df","first":" Yascha","last":"Mounk","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '15":{"course_score":{"overall":"4.20","workload":"4.00","difficulty":null,"recommendation":"4.30","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"GOV 94YM","course_id":"12415","cat_num":"156446","1s":"0","2s":"0","3s":"1","4s":"4","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94YM","course_id":"12415","cat_num":"156446","1s":"0","2s":"7","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Spring '15":{"comments":["This is one of the best classes at Harvard. I would recommend it to anyone who wants to learn more about climate policy or just government generally. The workload is manageable (though you should start the final paper early), the readings and discussions are some of the most engaging I've ever had, and Yascha is an incredible resource.","This class presents the political, economic, and ethical dimensions of addressing climate change. It will likely make you more certain about how to jumpstart climate action than when you entered, but you will be far more informed about the different perspectives that one can bring to this issue. For example, the balance between economic growth and environmental limits, the needs of present and future generations, the responsibility for past and present harm.","Yascha is great a leading discussions, and has a way of explaining things in meaningful and interesting ways. I think, if the course is repeated, some fo the material could be shifted to place a little focus on renewable energy and its politics.","If you're interested about climate change, especially regarding the politics of it, this will probably be a great class for you to take. The major assignments for this class this year included an optional short paper and a longer end of the semester paper. Course material covered everywhere from the economics and ethics of climate change, to geoengineering.","Really great class. Yascha is an amazing teacher and does a great job facilitating discussion and organizing the class well. The readings and workload are very manageable, even fun sometimes.","This is a great class if you want to think critically about actually addressing climate change. Readings can get a bit heavy, although you can occasionally get away with not doing all of them or just skimming (you do get one free pass to net do the readings at all). Pretty laid back atmosphere, but you definitely learn a lot.","It's a laid back environment at Yascha is a cool guy.  Learned a lot about climate change and it wasn't too much work.","Yascha is awesome and there is potential for great debates in class so don't shy away from that.","Gain a good understanding of the issues surrounding climate change","Awesome course, a good overview of climate politics, and a chance to explore one topic further in a paper!"]},"Spring '16":{"comments":["The class gives you a thorough understanding on multiple aspects of the debate on climate change. The readings are very updated and related to current issues. Yascha also moderates the discussion really well and makes us think further on related concepts. Definitely take this class if you're interested to holistically know the problem behind climate change.","A lot of reading, but fantastic class.","A great seminar with engaging discussions and great leadership.  Will add very little stress to your semester as you learn a surprising amount about the various political difficulties in climate change.","If you are passionate about climate change, take this class!","This is a fantastic class. Yascha is an amazing professor and cares deeply about his students. He also cares deeply about politics, and this is evident in daily discussions. He mostly let us run the show, and he moderated from time to time, but let us debate the ideas for ourselves and come to our own conclusions. The material is also fantastic, and there was never a dull moment. Essays are informative, and very easy to do if you take the time and put in the effort. The research paper is honestly my favorite paper I've written at Harvard - also the most challenging. The course takes time and effort, but every bit of it is worth it.","This course was an excellent foray into the theoretical and philosophical basis of the politics of climate change. If you're interested in government and climate change, it is the perfect course for you!","It was great! Take it!"]}},"mostRecentQ":{"overall":"4.30","workload":"4.70","difficulty":null,"recommendation":"4.80","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"GOV 94YM","course_id":"12415","cat_num":"156446","1s":"0","2s":"0","3s":"1","4s":"4","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94YM","course_id":"12415","cat_num":"156446","1s":"0","2s":"7","3s":"2","4s":"0","5s":"0"}},"success":true}