{"scores":{"Spring '16":{"course_score":{"overall":"4.40","workload":"4.20","difficulty":null,"recommendation":"4.20","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"GOV 94PT","course_id":"12412","cat_num":"156448","1s":"0","2s":"0","3s":"0","4s":"3","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94PT","course_id":"12412","cat_num":"156448","1s":"0","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 94PT","cat_num":"156448","course_id":"12412","year":"2015","term":"2","id":"bcf69869fedef92f6ba14eb13214470d","first":" Colin M.","last":"Brown","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Spring '15":{"course_score":{"overall":"4.70","workload":"4.20","difficulty":null,"recommendation":"4.60","enrollment":"13","response rate":"76.92","QCourseOverall":{"number":"GOV 94PT","course_id":"12412","cat_num":"156448","1s":"0","2s":"0","3s":"0","4s":"3","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94PT","course_id":"12412","cat_num":"156448","1s":"0","2s":"5","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Spring '15":{"comments":["This is an amazing seminar on a particularly interesting topic if you are stimulated intellectually by elections and campaigns.  Dr. Brown's attention to detail in the course was noteworthy and I can't say enough to praise his dedication both to his well-prepared syllabus and his students.","Was a pretty good seminar for a first-year seminar. Dr. Colin is super nice and engaging and he goes over readings at a manageable pace. The subject matter is political party systems and the theories that underpin them, but the course will certainly be of interest to anyone with an interest in important political institutions and how they adapt and evolve over time.","This was the first year this course was offered and the syllabus definitely has a few kinks to be worked out, but Colin's a fantastic teacher who really cares about student learning and I have complete faith that this class will be even better in years to come.","I learned a lot, and am glad that I chose this as opposed to other seminars.","This course is a fantastic junior tutorial.  Gov students should definitely take it into consideration.  Colin is an amazing political scientist and teacher!","Great Junior Seminar.  Colin is passionate about what he does, albeit soft spoken, but if you have any interest in political parties around the world this is an interesting class."]},"Spring '16":{"comments":["This was a really interesting class to take at a time like now, with the current election cycle proving very interesting at the level of party politics. I learned a ton about parties and how intricate and involved everything associated with them can be. The class provided a ton of opportunity to explore non-US political parties as well, which was super fascinating and worth knowing.","Take this! This is an interesting seminar about an urgent topic- political parties- currently taught by a someone with extensive knowledge of the literature. A good balance of political science-based and contemporary politics-based discussions. The assignments were manageable, but make sure to budget your time properly to handle all the response papers. Overall, I would recommend this class to anyone interested in parties, populism, and\/or Western European politics generally.","Colin is a great seminar leader, and if you're interested in the theory and practice of parties then I would highly recommend this as a seminar (Should it be taught again. I'm guessing it won't be though)."]}},"mostRecentQ":{"overall":"4.40","workload":"4.20","difficulty":null,"recommendation":"4.20","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"GOV 94PT","course_id":"12412","cat_num":"156448","1s":"0","2s":"0","3s":"0","4s":"3","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94PT","course_id":"12412","cat_num":"156448","1s":"0","2s":"5","3s":"0","4s":"0","5s":"0"}},"success":true}