{"scores":{"Fall '15":{"course_score":{"overall":"4.30","workload":"4.00","difficulty":null,"recommendation":"4.20","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"PSY 980U","course_id":"12587","cat_num":"156563","1s":"0","2s":"0","3s":"1","4s":"4","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980U","course_id":"12587","cat_num":"156563","1s":"1","2s":"7","3s":"0","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"4.70","workload":"4.50","difficulty":null,"recommendation":"4.50","enrollment":"16","response rate":"87.50","QCourseOverall":{"number":"PSY 980U","course_id":"12587","cat_num":"156563","1s":"0","2s":"0","3s":"1","4s":"4","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980U","course_id":"12587","cat_num":"156563","1s":"1","2s":"7","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '14":{"comments":["Sarah put her heart and soul into this course. It shows.","one of my favorite 980 classes. The teacher is very nice and straight-forward and easy to contact for help","Take this class! It's very fair in terms of workload, you will learn a lot, and the professor is the best!!!","This is an extremely interesting course. You'll learn a lot about how complicated the many risk factors around adolescent and emerging adult development can be. The readings are interesting and the discussions are engaging. Easy to apply to your own life.","This is a really interesting psychology seminar, with a professor who really understands and cares about the material. The workload is very manageable, and the expectations are exceedingly clear, which is nice.","This is a really great class. Interesting subject matter, a great teacher and it has a manageable workload. Dr. Erb is very kind and I always felt relaxed and comfortable going to this class on Wednesday evenings. The course consists of weekly response papers on interesting articles which are discussed in this small seminar setting. If you put in the effort, Dr. Erb takes notes and really helps her students do well by giving us great feedback and is very transparent throughout the course about our grades and how we can improve!","Use this opportunity to practice writing publishable papers and learn now how to format APA citations."]},"Fall '15":{"comments":["Very manageable class with interesting readings\/topics. The work was manageable throughout the semester and Sarah gives a ton of very useful feedback on everything I turned in. I think my psychology writing improved from taking this course. Class discussions, however, weren't always as interesting as they could have been.","This is a great seminar with a great professor. Taking this class was a very rewarding experience.","This is a great class. Very low stress but also interesting. If you are interested in abnormal psychology at all, this will probably be interesting to you.","Class was great! Very small and on Thursday night but only met once a week. Professor was amazing and was so understanding and helpful throughout the semester. Definitely a great seminar to take even if you're not a psychology major.","One of my favorite classes, a great chance to work with a professor in an intimate class setting, lots of autonomy, incredibly detailed and constructive feedback given, and able to study interesting and relevant themes for our own lives. Take it if psychopathology in adolescents interests you in the slightest!","Sarah is AMAZING. I truly enjoyed being in her class. She's such a warm, caring person who understands that students have lives outside of class, and that sometimes unforeseen events happen that students shouldn't be penalized for. I wholeheartedly recommend this class; it was one of the top advanced psych courses I've taken during my time here. Sarah is just SO knowledgeable on the subject, and openly admits when she doesn't know something well enough to give an accurate answer or explanation.","Although a very enthusiastic and passionate professor with interesting topics, the class if held on Thursday night can be quite difficult to concentrate in. The environment was not as engaging as hoped and oftentimes quite quiet with lengthly readings discussed but more so holistically. However, this class is still very interesting and Dr. Erb does a great job portraying her passion and depth of knowledge for the field."]}},"mostRecentQ":{"overall":"4.30","workload":"4.00","difficulty":null,"recommendation":"4.20","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"PSY 980U","course_id":"12587","cat_num":"156563","1s":"0","2s":"0","3s":"1","4s":"4","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980U","course_id":"12587","cat_num":"156563","1s":"1","2s":"7","3s":"0","4s":"0","5s":"0"}},"success":true}