{"scores":{"Fall '15":{"course_score":{"overall":"4.70","workload":"4.00","difficulty":null,"recommendation":"4.70","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"RELIGION 1444","course_id":"12700","cat_num":"156521","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RELIGION 1444","course_id":"12700","cat_num":"156521","1s":"1","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Fall '14":{"course_score":{"overall":"3.50","workload":"3.20","difficulty":null,"recommendation":"3.20","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"RELIGION 1444","course_id":"12700","cat_num":"156521","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RELIGION 1444","course_id":"12700","cat_num":"156521","1s":"1","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"RELIGION 1444","cat_num":"77836","course_id":"12700","year":"2014","term":"1","id":"9af766e9a9bdeace97087597540b06eb","first":" Harvey","last":"Cox","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Fall '14":{"comments":["The topics discussed in this class were super interesting to me and would likely be very interesting to many people. The class is not difficult, but there is a good challenge at the end with the final paper. Some of the details about what material is taught in this class will still be worked out after the class' first year, I imagine. At this point, some material was great and some was less great, but it always made for interesting class discussion.","This course opens an interesting and wide-ranging dialogue about the role of Judeo-Christian religion to speak to how our economy should be structured. The course (at least in its this year's version) does not build a consistent, thematic story like some other classes might, and it's less focused on lecture. Instead, it delves into a range of topics broadly related to God and money, and Professor Cox frequently opens the discussion for student input. In some ways this is a plus, since you are exposed to a lot of different thoughts. In other ways, the scattered nature of the course may not be what you are looking for if you want a course that clearly progresses through topics with clear connections between each one. A strength of this course is that students come from several Harvard schools including the divinity school, business school, and college, so there is room for a range of opinion."]},"Fall '15":{"comments":["This applies to any Harvey Cox class. TAKE IT. They are wonderful opportunities to take a class from a leading professor who has taught more than 100 semesters at Harvard. His classes can best be described as an intellectual project. He engages with his class in a lively fashion. This is because he uses the class to get inspiration and feedback for his own intellectual work.","Prof Cox is a legend. This course made me view the world differently.","Take this class if you're interested in getting a Divinity School perspective on money, but perhaps not if you're just interested in God and Money. While the readings are interesting and diverse, the class can be a bit moralizing, and Professor Cox clearly has a defined worldview about this subject."]}},"mostRecentQ":{"overall":"4.70","workload":"4.00","difficulty":null,"recommendation":"4.70","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"RELIGION 1444","course_id":"12700","cat_num":"156521","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RELIGION 1444","course_id":"12700","cat_num":"156521","1s":"1","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}