{"scores":{"Spring '15":{"course_score":{"overall":"4.70","workload":"4.10","difficulty":null,"recommendation":"4.70","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"HIST 60K","course_id":"12803","cat_num":"156650","1s":"0","2s":"0","3s":"0","4s":"0","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 60K","course_id":"12803","cat_num":"156650","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Spring '15":{"comments":["Great way to get through a large number of essential historical readings for Central Asia, puts you in a excellent position to comprehend more recent Central Asian history and contemporary situations, especially with regards to culture","It's a lot of reading, but this course is fascinating and extremely informative. You won't regret taking one course on Central Asia, one of the least known regions of the world, during your time at Harvard.","The readings, concepts, and events in this class often seem so foreign and exotic, yet turn out to be immensely useful for thinking about how societies form and the logic that governs them - totally relevant and helpful for anyone in the social sciences. Kathryn is an extremely considerate and able instructor, and the seminar atmosphere is really special.","Obviously, a kind of esoteric topic. Kathryn, however, is terrific, and I certainly learned quite a bit.","An extremely interesting course that helps shed light on a fascinating and often overlooked region during a historical moment of profound transformation. Expect to turn a critical eye to many accepted paradigms of Central Asian history and gain a more genuine and nuanced understanding of the region under Russian rule.","This was a great history class! I enjoyed learning about a relatively unknown part of the world while also weaving in themes of the Russian and then Soviet empire's control of them. If you have an interest in this part of the world, Russian imperialism, or just want to learn about a unique part of the world, you'll enjoy the discussion and texts in this class.","This is a course worth taking only if you have a particular interest in the region."]}},"mostRecentQ":{"overall":"4.70","workload":"4.10","difficulty":null,"recommendation":"4.70","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"HIST 60K","course_id":"12803","cat_num":"156650","1s":"0","2s":"0","3s":"0","4s":"0","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 60K","course_id":"12803","cat_num":"156650","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"}},"success":true}