{"scores":{"Spring '15":{"course_score":{"overall":"4.30","workload":"4.80","difficulty":null,"recommendation":"4.40","enrollment":"25","response rate":"84.00","QCourseOverall":{"number":"SCRB 169","course_id":"12842","cat_num":"156733","1s":"0","2s":"2","3s":"6","4s":"7","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SCRB 169","course_id":"12842","cat_num":"156733","1s":"1","2s":"4","3s":"8","4s":"2","5s":"4"}}}},"comments":{"Spring '15":{"comments":["This is a great class that allows us to consider how scientific experimentation has developed into what it is today.  It's in its early stages and will surely see great development in the coming year or two.","amazing class! very relaxed and you learn a lot. Prof. glass is very kind and fair. an absolute gem","This course is very laid back which can be nice in terms of work but means there is little feedback given on what is wanted in the course\/how you are doing. This is kind of nice though because you can just focus on learning the material and you should be fine. The readings are long but most are interesting. Professor Glass gives interesting lectures that help sum up the readings and make them relevant to the course.","This is an important class to take for those interested in going into scientific research as a career. We discussed a number of important considerations to experimental design, and many problems underlying the current system of funding and experimentation.","Tl;dr: I was inherently very interested in the material and plan on entering the field after graduation, so I found the course an overall positive experience. However, if you have any reservations about the material and are looking for an easy course to fulfill a requirement or even just a fun elective, this is NOT the course for you.\r\n\r\nPROS: The course did a great job of building upon previous material as it accumulated throughout the semester, resulting in a coherent theme, which is always nice. I feel like I have learned SO much that will be applicable to my eventual career. He also brought us Swiss chocolates! :)\r\n\r\nCONS: Not for senior thesis writers, or anyone with a strong disinclination toward reading 17th century texts.\r\n\r\nProfessor Glass did not indicate at the start of the semester that he would require weekly response papers with a one page minimum and often extending beyond 2 pages (depending on the complexity of the prompt), including for the weeks when a longer paper was also due (there were 4 longer papers in total, which were announced at the start of the course). Because the reading was so comprehensive and dense, I would have appreciated knowing the workload that the course would require in advance of the semester.\r\n\r\nThe course was also pretty disorganized at times. Assignments and paper topics were distributed in a very haphazard manner; sometimes prompts were listed on the last slide of the previous lecture, sometimes they were emailed directly to us, and sometimes they were posted on the course website. Due to the lack of consistency, many students found that they were not aware an assignment was due until the day it was due.","If you are at all interested in philosophy or would like to become a researcher take this class, its a great introduction to method","This class gives a whole new insight into hypothesis design research. It is helpful for future research that you may do!","This class is great in explaining the development of good experimental design. It is a low-maintenance, interesting course. I highly recommend it.","The course is very good for its first iteration and would recommend to all science concentrators interested in bettering their methodology.","This course is fun, not stressful, and you learn a lot. You may not agree with all of the ideas thrown at you over the course of the class, but you will learn about new perspectives and develop a broader appreciation for scientific methodology, how it came about, and how far from perfect our methods are today. Be aware that there are a lot of assigned readings, and while you don't need to do an extremely in depth reading of everything to do well in the class, you'll get more out of the class if you are able to dedicate time to the readings. They're very interesting, and you'll read a lot of classic philosophers, scientists, and thinkers, as well as review the good and bad methods in some well known experiments. Assignments are low-stress. Take this course if you are interested in the evolution of our experimental method, both in academia and clinical medicine.","This class is simply brilliant. David's lectures are engaging and informative, and I can genuinely say this is one of the few classes that has given me a relevant and impactful take home message. It has changed how I view scientific research, and I plan to put the suggestions I learned in class into practice in my own life.","This class has changed my life. I mean this in the sense that it has helped me realize so much about how to improve the way I think and design experiments and it also combined three of my favorite subjects into one class: philosophy, history, and science. I think that every person especially thesising seniors, should take this course in order to learn the theory behind experimental design and the background behind how it works. Phenomenally taught class as well. David is a great lecturer and does a great job at getting people to participate in class. I recommend this class 200%!","A wonderful, thought-provoking class that is invaluable for aspiring physicians, researchers, and philosophers alike, so long as you're interested in HOW we know what we \"know\". One thing to check on - the course is currently in a open lecture format (you can interrupt and comment \/ question), but it's not a seminar-style course even though the material would fit that model wonderfully. If it has been adjusted to further emphasize discussion, I would consider that a major improvement to an already outstanding course. I recommend the class in the strongest possible terms - this is a course that Harvard needs more of!","This class is interesting in that it provides you a means of understanding how we ended up at our present scientific method.  It's not always clear how\/why we do what we do in science, and so it was cool to gain a better understanding of the history of the scientific method! There wasn't too much work, and the class was always enjoyable; I'd definitely recommend the class if you're interested in learning about the reasoning behind scientific reasoning!","If you are interested in how to evaluate research and learn proper methods, this is the course. SCRB 169 offered the perfect balance between biology and philosophy through a historical discourse, one that is not very easy to find. While the readings may seem daunting, you will come out a very educated person if you interact with the course through the readings and responses. I'd recommend to everybody who wants to go into research."]}},"mostRecentQ":{"overall":"4.30","workload":"4.80","difficulty":null,"recommendation":"4.40","enrollment":"25","response rate":"84.00","QCourseOverall":{"number":"SCRB 169","course_id":"12842","cat_num":"156733","1s":"0","2s":"2","3s":"6","4s":"7","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SCRB 169","course_id":"12842","cat_num":"156733","1s":"1","2s":"4","3s":"8","4s":"2","5s":"4"}},"success":true}