{"scores":{"Fall '15":{"course_score":{"overall":"4.80","workload":"21.10","difficulty":null,"recommendation":"4.60","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"SCRB 152","course_id":"12881","cat_num":"156937","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SCRB 152","course_id":"12881","cat_num":"156937","1s":"0","2s":"0","3s":"1","4s":"1","5s":"8"}}},"Spring '15":{"course_score":{"overall":"4.80","workload":"16.20","difficulty":null,"recommendation":"4.80","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"SCRB 152","course_id":"12881","cat_num":"156937","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SCRB 152","course_id":"12881","cat_num":"156937","1s":"0","2s":"0","3s":"1","4s":"1","5s":"8"}}}},"comments":{"Spring '15":{"comments":["If you want to keep up with any biological research these days, you should take it.","This class is fantastic. You will learn a lot, and it is very, very useful","A fantastic hands-on approach to learning RNA-seq analysis. Eran and Adrian walk you comprehensively through best practices and common pitfalls for every step of the pipeline; you will practice data analysis, figure creation and problem solving in a very realistic research setting; by the end of the class you will be fully equipped to not only understand and critique analysis of sequencing data presented in the literature, but play around with it yourself and produce the same quality conclusions and figures for your own data. Super useful, exciting and interesting course!","Best class I've taken at Harvard--if you have the opportunity to take it, don't hesitate. Although it will prepare you for first-rate RNA-Seq research, it also serves as a springboard into computational biology more broadly. The teaching is excellent--Adrian and Eran communicate better than and care more about students than any other teaching staff I've had, and extremely knowledgeable about the field.","We learn a lot of very cool material! I felt extremely comfortable with Python as well as basic bash commands by the end of the semester, despite starting out without any knowledge of Python. However, psets are time consuming, be sure to budget that in when you consider the class.","This was the first year SCRB 152 was offered, and it was AMAZING! Adrian and Eran have put together a fantastic course that rigorously covers the methods, variations, and applications of RNA-Seq. My favorite part of the course was working through two recent, original papers that use RNA-Seq in their work. The small, seminar format of the course was fantastic for discussing the key steps of these papers, coming to thoroughly understand them ourselves, and coming up with our own extensions.\r\n\r\nBesides the main biological narrative behind the course that covers RNA-Seq, students also gain an understanding of many of the related concepts in math, statistics, and computer science behind RNA-Seq. I found this component just as valuable for my own growth. Some examples: linear algebra and principal components analysis, hierarchical clustering algorithms, multiple hypothesis testing, linear regression, high-performance computing on Odyssey, and Python libraries (numpy, pandas, matplotlib).\r\n\r\nAdrian and Eran are fantastic instructors who devoted a lot of time to pulling this course together. The class environment is incredibly close, and this is a really valuable skill to know. I would highly recommend this class!!!","Really challenging class but totally worth it. The grad students are awesome the hw's are long and hard but really rewarding. I definitely recommend. Was the first time they offered it so there were some speed bumps but it will get way better.","one of the best courses at harvard, cool material in a problem-solving focused way, you understand the why as well as the how","Loved this class.  It was a lot of work but I feel like I learned so much.  It was really cool being able to understand how RNA sequencing data analysis actually works.  While I don't feel entirely comfortable analyzing data entirely on my own yet, I do feel like I have a solid understanding, and I would know how to do an intial analysis as well as how to find spots where my analysis would be weak.","There is no other class offered like this at the undergraduate level. If you are interested in bioinformatics, even remotely, I would strongly recommend taking this class. Eran and Adrian are amazing and cover a variety of topics that ensure you understand RNA seq and other associated techniques. While a basic understanding of statistics\/linear algebra and programming are recommended, I had limited experience with the pre-requisites, but the class was so well taught that any void of knowledge was quickly filled. I learned a lot more than I expected to from taking this class. The problem sets are often long and comparable to the time commitment of CS50, but the payoff is truly amazing.","This class is taught mostly by the two TFs, Eran and Adrian. They're both some of the smartest guys you'll ever meet and they're incredibly knowledgeable about the course material for this course as well as about science in general. This course is a great introduction to computational biology and it teaches you really useful skills for lab work in addition to improving your ability to critically read and evaluate research papers. Be aware that it is quite a bit of work, especially if you don't have any programming experience already. But it's definitely worth it for all the practical science skills you learn!"]},"Fall '15":{"comments":["This course was amazing. You will learn a lot! These guys are great; really smart and super friendly. Definitely a worthwhile course!","This is one of the more 'worth-it' classes I have taken. If you have any interest in using RNA-Sequencing, this course is a must have, will teach you Python and bioinformatics along the way. However, Be prepared to work a lot (~20 hours per week), especially if you have a weak programming background like I did (only R, self-taught). I couldn't recommend taking this course along with a really busy schedule already full of lots of after-hours work. But given the time to dedicate, definitely worth it.","This is an amazing class if you are 1. interested in how computer science intersects with biology 2. interested in rna seq (for research or for fun) 3. interested in how math\/statistics intersects with biology! Otherwise, this probably isn't the right class for you. The workload is pretty intense, with each week's psets taking around 10-20 hours to complete (especially the first one). In terms of computer science background, you should be comfortable with creating non-trivial programs, or the psets will take forever to finish. The math\/stat background is helpful, but it's a limiting factor if you're willing to put in the work. All in all, this is an amazing class that two md\/phd students (go Eran and Adrian :D) have spent hours perfecting. You'll come out of the class with a better understanding of RNA seq, sequence alignment, finding differential expression, cluster, PCA, and more! You'll also become very familiar with python and the pandas library too! Side note, the material in the class sort of overlaps with cs109 and uses the same tools, so they could be good classes to take concurrently. Good luck to the next year students!","Really consider whether you have the background to take this course. If you have little coding experience and are missing another suggested subject only take the course if you're willing to spend 20-40 hours a week on this class.","This was one of the best classes that I've taken at Harvard.  It's also the class that I've put the most time into (e.g. actually 10-12 hours\/week in terms of the problem sets and projects, but the assignments are relatively fun, so it's not as if it ever feels annoying to have that much).  So I would only really recommend this if you are able\/willing to put that time into the course, but if you are, then you will get a tremendous amount out of it.  Though it's helpful to have a strong background in coding, I don't think it's really necessary, because it's possible to pick up Python relatively quickly as long as you are genuinely interested in it.  So even if you don't think you have a lot of background in computational biology, as long as you're interested in learning it, don't feel afraid to take this course.  But this is a fantastic course, I think anybody with any interest in biological research should take it!","Take this class! In addition to learning RNA Seq, you will go away with the basic skillset to do data mining.","A very interesting course that combines an understanding of how RNA-seq works with actual explanations of how to do analysis with it. This gives me so much more perspective with I read comp bio papers using RNA-seq. I highly recommend this course to people interested in this topic!","The work is a lot. You need to spend lots of time sitting down with a computer coding and implementing all the programs. But what you learn from this is really valuable, especially if you are working on RNA-seq related work. The two instructors, both MD\/PHD students are awesome, teach better than most profs.","This is a wonderful class. Eran and Adrian are enthusiastic and passionate. They are really helpful and show interest in the students."]}},"mostRecentQ":{"overall":"4.80","workload":"21.10","difficulty":null,"recommendation":"4.60","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"SCRB 152","course_id":"12881","cat_num":"156937","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SCRB 152","course_id":"12881","cat_num":"156937","1s":"0","2s":"0","3s":"1","4s":"1","5s":"8"}},"success":true}