{"scores":{"Spring '16":{"course_score":{"overall":"4.50","workload":"7.10","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"NEUROBIO 105B","course_id":"13872","cat_num":"159699","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"NEUROBIO 105B","course_id":"13872","cat_num":"159699","1s":"1","2s":"3","3s":"7","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["As someone who came into this class having no prior programming experience at all, the learning curve for using MATLAB was rather steep, but once you get past the initial hurdles, it gets much easier and more fun. The instructors are absolutely phenomenal and some of the best people you will meet!","I would recommend conditional on students being prepared with the prerequisites and have a schedule that allows them to really take their time to struggle through every pset","You need to know MATLAB beforehand to save your sanity.","This class is a relaxed way to learn about neural nets, machine learning, and the foundations of computational neuroscience. If you have never used Matlab before, you will spend a decent amount of time understanding the problem sets, but Alex and Ashesh are extremely helpful. They are brilliant and very willing to re-explain concepts and their applications. Matlab is a tremendously useful skill that will carry over into many domains of science. This is a great way to learn it. The math behind the topics is often complex, but it leads to fascinating results. This is the most rigorous but also most rewarding of the tutorials.","This is the ONLY class where you get to implement computational neuroscience models in MATLAB. TAKE THIS CLASS. Big Data and machine learning are the future of neuroscience and this class is the only one where you get to engage with data sets, computation, and probability to understand neural data.","If you don't know matlab, be prepared to invest a lot of time. It's worth the investment, but be prepared for it.","This course is an excellent introduction to computational neuro. I highly recommend it.","This is a challenging course but extremely rewarding if you put the work in. Alex and Ashesh are very smart and want to help their students understand the material. If you are struggling to understand something, go to office hours. This is very much a class where you take our what you put in. You most likely will never again have the opportunity to learn this fascinating and very relevant material in a low-stress environment where you're not constantly thinking about your grade. I highly recommend you take this class and take it seriously and you will be so thankful in the end.","Ashesh and Alex are great and know a ton, but this is mostly a you get what you put in type of class. It's pretty chill, and you are accountable for yourself, since homework is not checked. You read a lot of papers and get a sense for what computational neurobio entails.","A gem of a course- the course heads are great, the subject matter is fascinating (there's something for everyone!), and you have a great deal of freedom to apply what you learn to your own project at the end of the semester."]}},"mostRecentQ":{"overall":"4.50","workload":"7.10","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"NEUROBIO 105B","course_id":"13872","cat_num":"159699","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"NEUROBIO 105B","course_id":"13872","cat_num":"159699","1s":"1","2s":"3","3s":"7","4s":"0","5s":"0"}},"success":true}