{"scores":{"Spring '16":{"course_score":{"overall":"5.00","workload":"5.00","difficulty":null,"recommendation":"5.00","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"NEUROBIO 104B","course_id":"13858","cat_num":"159698","1s":"0","2s":"0","3s":"0","4s":"0","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"NEUROBIO 104B","course_id":"13858","cat_num":"159698","1s":"0","2s":"6","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["This is the coolest class I have taken at Harvard. Johanna is a phenomenal professor, and she really pushed us to learn and engage with the material. The workload is very manageable , and the topics discussed are fascinating. If you have any interest in addiction or pharmacology, this is the perfect course for you!","This class has been one of my absolute favorites. Johanna is such an amazing professor. She really pays attention to the students and makes sure that everyone is engaged and improving as a student. This class helped me feel prepared for writing a thesis and also was just a lot of fun. The papers are interesting, the topic is one that your friends will want to ask about, and Johanna is the best mentor.","Johanna is an awesome professor! The class is super interesting and prioritizes actual learning over fact regurgitation. The midterm and final papers are relatively straightforward and you get a lot of heads up on it. Johanna is very supportive and open to helping\/meeting if needed!","This is a great class. Johanna is an incredible professor and the small size of the class leads to great discussions. The material was really interesting and extremely relevant, and 1-2 papers per week and one presentation per semester was definitely manageable. Johanna also gives great feedback on the yearlong paper. One of my favorite classes at Harvard.","This course is great if you want to thoroughly learn the mechanisms of addiction and potential treatments for various drugs.","Take this tutorial! Be prepared to handle the beast of a grant proposal\/final paper, though.","It is a great way to learn about how the brain's reward system works. Johanna is fantastic and the ambiance she creates in the class makes participation easy and fun."]}},"mostRecentQ":{"overall":"5.00","workload":"5.00","difficulty":null,"recommendation":"5.00","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"NEUROBIO 104B","course_id":"13858","cat_num":"159698","1s":"0","2s":"0","3s":"0","4s":"0","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"NEUROBIO 104B","course_id":"13858","cat_num":"159698","1s":"0","2s":"6","3s":"1","4s":"0","5s":"0"}},"success":true}