{"scores":{"Spring '17":{"course_score":{"overall":"4.50","workload":"5.50","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"RUSS AB","course_id":"13479","cat_num":"159620","1s":"0","2s":"0","3s":"1","4s":"4","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RUSS AB","course_id":"13479","cat_num":"159620","1s":"1","2s":"8","3s":"8","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.60","workload":"6.30","difficulty":null,"recommendation":"4.60","enrollment":"22","response rate":"77.27","QCourseOverall":{"number":"RUSS AB","course_id":"13479","cat_num":"159620","1s":"0","2s":"0","3s":"1","4s":"4","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RUSS AB","course_id":"13479","cat_num":"159620","1s":"1","2s":"8","3s":"8","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["The grammar and oral section preceptors were excellent at getting the class engaged and excited about new language topics.  Honestly my class felt like a family by the end.  The material was very well presented at a great pace and evaluations felt fair and appropriate.  Russian is a difficult language and they made it manageable and super interesting at the same time.  Sarah is an angel!","I mean, it's a language class.  It's fun to know the concepts, but the process of learning them can be a bit tedious.","Take this course. Just do it. Seriously, this is one of the best courses that I have taken at Harvard. Natalia makes learning fun, Jenya is the nicest person ever, and Laura is so sweet. All of the instructors are amazing and they make Russian seem more approachable.  10\/10","Take it!","Take this class!! Whether you need to fulfill your language requirement or you want to learn a language before you graduate or you think Russian is beautiful or whatever, this is an AMAZING class. Russian A was, hands-down, my absolute favorite class this semester (and the last). The workload is very reasonable, and the amount that you learn is really incredible.","This course is amazing and it will most likely cause you to become interested in Russian. This course is essential in strengthening your beginner level Russian skills.","It's a really effective Russian course. The faculty is great (I love Natalia Georgievna). Essentially, you get as much out of the course as you put in.","It is hard at first, then fun, but then it gets a bit overwhelming.","The material is really good and its so rewarding to learn Russian. My one concern with the class was the inconsistency with quality of instruction from TF to TF. Some of them were remarkably good teachers and the others not so much. However, I still highly recommend this class because there is nothing quite like learning a foreign language so drastically different to English as Russian. You honestly learn the underlying structures of English better too!","Everyone who teaches this class has a personal mission to make sure everyone learns all the topics and feels confident speaking\/writing in russian","You will not find a better set of teachers in any language department.","Really fun teaching staff. Make sure that you are committed to studying a lot. Russian is not easy, but is definitely interesting.","If you need to take a language, ABSOLUTELY take Russian.  The TF's are amazing, the department is wonderful, professors will jump at opportunities to meet with you, and you will have the opportunity to get close with your class.  This language is a lot of work and it meets five days per week, but this is really reflected in how much you learn over such a short time.","It's a great class! The teachers and enthusiastic and willing to help, and you'll definitely learn a lot of Russian.","A great class with a lot of fun, but can be stressful at times as there is a lot to get used to and not a whole lot of time to adjust."]},"Spring '17":{"comments":["Russian was by far my favorite course this semester. The teaching staff are all very friendly and passionate about the language. The class prepares you very well for using the language, and my abilities in Russian have improved tremendously. After just two semesters of study I'm surprised at how much I can understand when listening to Russian music, media etc. \r\n\r\n I chose not to take Russian my freshman year because I was concerned about the difficulty. However, I realize now that was a huge mistake as the class is structured to reward genuine effort. Anyone who puts in the effort will not need to worry about receiving a poor grade in the course. Additionally, the staff do a great job of teaching the material so the difficulty of the language is no reason to be deterred from taking Russian at Harvard.","Take this and stick with it if you're committed to getting a citation or going for something in Slavic languages and\/or a citation","This is an incredibly rewarding class if your definition of reward is gradually getting more adept at a difficult foreign language.","This is a great Russian class run by excellent TFs."]}},"mostRecentQ":{"overall":"4.50","workload":"5.50","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"RUSS AB","course_id":"13479","cat_num":"159620","1s":"0","2s":"0","3s":"1","4s":"4","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RUSS AB","course_id":"13479","cat_num":"159620","1s":"1","2s":"8","3s":"8","4s":"0","5s":"0"}},"success":true}