{"scores":{"Spring '16":{"course_score":{"overall":"4.50","workload":"4.80","difficulty":null,"recommendation":"4.40","enrollment":"29","response rate":"68.97","QCourseOverall":{"number":"MATH 157","course_id":"12899","cat_num":"159934","1s":"0","2s":"0","3s":"2","4s":"6","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MATH 157","course_id":"12899","cat_num":"159934","1s":"2","2s":"11","3s":"5","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["Every person with a concentration anywhere near math would love this class!! It is so good and the content is so important and presented in such an original way. TAKE IT!!!!","Fun","Very laid-back class.  'lecture' is more of a problem solving session, and is very fun.","Great class to gain a great breadth of knowledge about mathematics and the practice subjects it tackles.","Good class. Francesco is a baller.","Good if you want a more relaxed math class","Good course, very helpful for interviews.","This course is a gem. I expect it to gain popularity in the coming years. Fun elective! GREAT preparation for quant interviews. Light workload. Tom is teaching it next year, and he's a really nice guy.","It's a lot of fun and you practice real-world skills!","Very chill class! You'll be exposed to some cool math without too much pressure of grades. The psets are very manageable (1-3 hours) and are pretty fun. You'll also have the opportunity to learn some python along the way! Stat 110 and cs knowledge helps a lot with the second half of the course. The final project is really fun too (basically pick a topic, read about it, and write a summary). Definitely recommend as a 5th class \/ chill class","Fun, interesting math problems. Going to this class is like going to math club in high school. You just work on problems and it is good fun, with no stress.","Probably the best class I've ever taken! I simply loved the enthusiasm, and the exciting problems coming to class entailed. Francesco did a great job, and Tom, who'll be taking over next year, is also very good. Take this class. The problems are so exciting that I promise you, you won't regret it."]}},"mostRecentQ":{"overall":"4.50","workload":"4.80","difficulty":null,"recommendation":"4.40","enrollment":"29","response rate":"68.97","QCourseOverall":{"number":"MATH 157","course_id":"12899","cat_num":"159934","1s":"0","2s":"0","3s":"2","4s":"6","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MATH 157","course_id":"12899","cat_num":"159934","1s":"2","2s":"11","3s":"5","4s":"0","5s":"0"}},"success":true}