{"scores":{"Spring '16":{"course_score":{"overall":"4.50","workload":"4.30","difficulty":null,"recommendation":"4.80","enrollment":"7","response rate":"57.14","QCourseOverall":{"number":"HIST 60T","course_id":"13620","cat_num":"160192","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 60T","course_id":"13620","cat_num":"160192","1s":"0","2s":"3","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["This class is great!!! Although I am a senior, this was my first time taking a seminar class and I was really nervous about having to speak so much in class, but it totally wasn't a problem! Carla is super friendly and does an awesome job of creating a class atmosphere that makes you feel comfortable sharing your thoughts and ideas--every class session honestly felt like we were just having regular conversation. She does a really good job of directing the discussion to be relevant to what we read about, but also what we seem to be interested specifically in for each topic. The material itself is super interesting: You really learn how important food and hunger has been in history and how hunger has really been overlooked as a driving force in many situations. I would recommend this course to anybody who is looking for an interesting class to take, regardless of their concentration. I was the only person in the class who wasn't a History concentrator, but I didn't feel behind at all. There are only a few assignments and then a final paper, but the guidelines are extremely clear, there are assignments that build up to the final paper, and Carla's feedback along the way is super, super helpful. Bottom line: Take this class! :)","This is a fantastic seminar. It is hands on, engaging, and the readings are very interesting and applicable to our lives. Carla is fantastic!","This is an excellent history seminar, which I would recommend with enthusiasm to history concentrators\/secondaries as well as those interested in taking the class for an elective. Professor Cevasco is an excellent teacher. Her skill manifests itself in a number of ways. To begin with, the materials for the class are chosen and organized in a really intuitive and enriching way. Each week focuses on a particular aspect of hunger -- race, gender, war, etc., which allows you, over the course of the semester, to gain a far reaching understanding of the topic without feeling overwhelmed. The material is always interesting, and the length of the readings is perfect. The assignments for the class are well timed and helpful. They set you up well for your final paper, which mean that you aren't scrambling to get it done during reading period. Professor Cevasco was incredibly helpful throughout the process (and the course as a whole), always providing comprehensive feedback. She also facilitated great discussion, that focused both on the nitty gritty of the historical detail and also on the bigger picture moral, ethical, and historiographical questions. In general, Professor Cevasco is the one who makes the course as awesome as it is. I came in with a healthy interest in the topic, but in the hands of another instructor I could have quickly lost interest. Professor Cevasco made the course and the course work exciting, engaging, and enriching. I learned to think about the history of hunger, and about history as a discipline, in ways I never had before. I would highly recommend taking this course, and any other that Professor Cevasco teaches!"]}},"mostRecentQ":{"overall":"4.50","workload":"4.30","difficulty":null,"recommendation":"4.80","enrollment":"7","response rate":"57.14","QCourseOverall":{"number":"HIST 60T","course_id":"13620","cat_num":"160192","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 60T","course_id":"13620","cat_num":"160192","1s":"0","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}