{"scores":{"Fall '15":{"course_score":{"overall":"4.30","workload":"5.80","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"HISTSCI 194V","course_id":"13134","cat_num":"160191","1s":"0","2s":"0","3s":"2","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HISTSCI 194V","course_id":"13134","cat_num":"160191","1s":"1","2s":"5","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Fall '15":{"comments":["A must for science fiction fans at the College. One of the most fascinating courses available, in my humble opinion!","It is a great class to take if you are interested in science fiction","This class is a great way to engage with themes of science fiction and science future in a seminar setting, which sets it apart from similar seeming courses offered this semester. It is a low-stress, very fun way to read and watch lots of great works of science fiction, and work through really fascinating, constantly pertinent ideas. Dr. B is  great and supportive, but the class is especially great if you're willing to do the large amounts of reading, or else you may not get as much out of it.","This was a really fantastic seminar. Doctor Baldwin is a great professor to get to know, she has created a really thorough overview of the history of science fiction in the class, and so long as you're interested in the material the amount of work is totally worth it. Definitely try to keep up with the readings as much as possible, the weeks of seminar I enjoyed the least were the ones I was least prepared for."]}},"mostRecentQ":{"overall":"4.30","workload":"5.80","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"HISTSCI 194V","course_id":"13134","cat_num":"160191","1s":"0","2s":"0","3s":"2","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HISTSCI 194V","course_id":"13134","cat_num":"160191","1s":"1","2s":"5","3s":"2","4s":"0","5s":"0"}},"success":true}