{"scores":{"Fall '15":{"course_score":{"overall":"5.00","workload":"6.30","difficulty":null,"recommendation":"5.00","enrollment":"3","response rate":"100.00","QCourseOverall":{"number":"HIST 60U","course_id":"13020","cat_num":"160190","1s":"0","2s":"0","3s":"0","4s":"0","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 60U","course_id":"13020","cat_num":"160190","1s":"0","2s":"1","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Fall '15":{"comments":["This course was amazing. If you have an interest in India, history in general, or becoming better at writing and researching this class should be considered. I came in without any knowledge of India and now am aware and knowledgeable on a fascinating part of the world. My writing was improved and I have engaged with research in a way I had not before at Harvard. I feel more confident in my research because of this class.","If you want to learn about the politics in India, you should definitely take this class. Indian society and politics is still very much influenced by religion and this class is a great way to understand the intricacies of how Indian society and politics work, and what motivations people have. This class was also a great way to rethink many of the national narratives India and Pakistan have about partition, and how colonialism shaped Indian society and politics. Even if the subject doesn't interest you greatly, I'd still recommend this course for anyone wanting to learn how to study history, deal with primary sources, and research well.","Take this class hands down. Excellent reading materials, excellent preceptor -- all round win."]}},"mostRecentQ":{"overall":"5.00","workload":"6.30","difficulty":null,"recommendation":"5.00","enrollment":"3","response rate":"100.00","QCourseOverall":{"number":"HIST 60U","course_id":"13020","cat_num":"160190","1s":"0","2s":"0","3s":"0","4s":"0","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 60U","course_id":"13020","cat_num":"160190","1s":"0","2s":"1","3s":"2","4s":"0","5s":"0"}},"success":true}