{"scores":{"Spring '16":{"course_score":{"overall":"4.10","workload":"3.10","difficulty":null,"recommendation":"4.10","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"PSY 980M","course_id":"13766","cat_num":"160162","1s":"0","2s":"1","3s":"2","4s":"4","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980M","course_id":"13766","cat_num":"160162","1s":"7","2s":"4","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["Fascinating content from an academic perspective and a great way to probe deeper into current events and politics.","I absolutely loved this course! Sasha is the kindest and most patient instructor ever. As a huge political junkie, I loved every week's unit and I felt like I was contributing to the class. The assignments were also super fun and chill (e.g., we made a podcast).","This class is a gem-- short readings and a lot of discussions. At times it was frustrating since discussions seemed to go in circles where people would inevitably just talk about \"the political divide\" a bunch. Sasha is super nice and wants to help, though","Interesting class. Gets a bit repetitive. Having a good group for the project can make or break the class for you.","Take this class! It was appropriately challenging, not too much work, but I definitely learned a lot and was not stressing out about it.","This is a great course with a low work load. Really interesting discussion based format.","Do not take this class. The topic itself is not a sufficient motivation to fill all of the weeks of the course with substantive discussion. You will be bored. You will not get feedback. Sasha frequently makes changes to expectations for assignments, and her instructions are vague in the first place. The course itself just does not have enough research to support it as a full semester class (should be a couple lectures \/ unit instead) and lends itself to anecdote sharing during discussion. If you can avoid taking this class, do so.","Gem psych seminar!  Great subject material and really engaging discussions that will change the way you think about politics.  Can get repetitive about halfway through, you'll feel like you're repeating yourself in discussions.  Very low key, easy assignments.  The end of the semester can sneak up on you with the podcast assignment and the final group presentation.  Would recommend!"]}},"mostRecentQ":{"overall":"4.10","workload":"3.10","difficulty":null,"recommendation":"4.10","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"PSY 980M","course_id":"13766","cat_num":"160162","1s":"0","2s":"1","3s":"2","4s":"4","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980M","course_id":"13766","cat_num":"160162","1s":"7","2s":"4","3s":"1","4s":"0","5s":"0"}},"success":true}