{"scores":{"Fall '15":{"course_score":{"overall":"4.70","workload":"6.10","difficulty":null,"recommendation":"4.90","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"GOV 94AP","course_id":"13086","cat_num":"160372","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94AP","course_id":"13086","cat_num":"160372","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Fall '15":{"comments":["The discussions we had in class were awesome and the readings are not too much. You should do the readings. Amanda is a great facilitator of discussion and gives useful feedback on assignments. You will get what you put into this class, and you can learn some really interesting theory and history on African politics.","This class helped me to gain a better understanding of the way that politics work in Africa.","This is a great course. The discussions were the highlight of my week and provided me with a chance to learn from classmates. Everyone brought knowledge about African politics to the table, which made the debates all the better. Because it's a small seminar, though, you can't get away without participating. \r\n\r\nThe readings can be dense, but that's the nature of the discipline. The final paper and participation basically determine your grade, so don't wait till the last minute to start writing it. Overall, though, it was a very manageable workload throughout the semester.","Sub-Saharan African political history and science is pertinent to this emerging world order are witnessing and is an amazing way of looking at the successes and failures and possible solutions to African continental problems. It's important to take this course.","This seminar is very interesting and engaging. Many of the readings are fascinating. The course provides a pretty comprehensive of post-independence Sub-Saharan Africa. Amanda is very helpful outside of class and via email. The final project is also reasonable and you have enough time to complete it. I would definitely recommend this course.","TAKE IT!"]}},"mostRecentQ":{"overall":"4.70","workload":"6.10","difficulty":null,"recommendation":"4.90","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"GOV 94AP","course_id":"13086","cat_num":"160372","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94AP","course_id":"13086","cat_num":"160372","1s":"0","2s":"4","3s":"3","4s":"0","5s":"0"}},"success":true}