{"scores":{"Spring '17":{"course_score":{"overall":"3.70","workload":"2.90","difficulty":null,"recommendation":"3.80","enrollment":"27","response rate":"77.78","QCourseOverall":{"number":"MUSIC 142R","course_id":"13734","cat_num":"160642","1s":"0","2s":"0","3s":"3","4s":"5","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 142R","course_id":"13734","cat_num":"160642","1s":"6","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 142R","cat_num":"160642","course_id":"13734","year":"2016","term":"2","id":"fa2235e6129daa5379cbee20e2f47e97","first":" Yosvany","last":"Terry","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.10","AccessibleOutsideClass":"3.20","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Spring '16":{"course_score":{"overall":"4.50","workload":"3.30","difficulty":null,"recommendation":"4.60","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"MUSIC 142R","course_id":"13734","cat_num":"160642","1s":"0","2s":"0","3s":"3","4s":"5","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 142R","course_id":"13734","cat_num":"160642","1s":"6","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 142R","cat_num":"160642","course_id":"13734","year":"2015","term":"2","id":"fa2235e6129daa5379cbee20e2f47e97","first":" Yosvany","last":"Terry","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Fall '15":{"course_score":{"overall":"4.20","workload":"2.40","difficulty":null,"recommendation":"3.90","enrollment":"21","response rate":"71.43","QCourseOverall":{"number":"MUSIC 142R","course_id":"13734","cat_num":"160642","1s":"0","2s":"0","3s":"3","4s":"5","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 142R","course_id":"13734","cat_num":"160642","1s":"6","2s":"6","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '15":{"comments":["participate as much as you can! the more you get into the music, the more enriching the class will be.","This class was really easy, which means that it might be made much harder in the future. We really didn't have many assignments (though the ones we did were very difficult).","This is an incredibly enjoyable and low workload that expands your way of thinking about music!  You will learn a lot, but what you will learn will not be that concrete and definite.  The course will probably not teach you about jazz harmony to a thorough degree, and you won't leave being an expert on West African culture either.  However, you will develop new skills in listening and thinking critically, and you'll probably have a unique musical experience that you may not find anywhere else on campus.","If you're looking for an in-depth analysis of West African music traditions and their influence on musical movements of north\/south americas, I'm not too sure you'll find it here.","this class is interesting, interactive, and super chill.  yosvany is great, and so is sarah (if she's still TFing).  hopefully the class will get a little more organized in its second year.","If you want to understand the complexity of African music and learn to appreciate this fantastic world, take the course. However, it is a little unorganized and chaotic and although the work requirement is minimal the lack of structure may create some stress.","Take this course for something that you can't experience in many of the other music courses. Yosvany and Sarah were so great and so sensitive to how to introduce students to the new traditions.","The course won't be the same next time it's taught, so that's worth keeping in mind as you look at the q.","TAKE IT!","Music 142r is a very interesting course. Using African chants and rhythms, you learn about the importance of West African musical tradition's influence on modern music. Readings on the history of African and Caribbean musical traditions help provide context and a better understanding of the material, and hands-on assignments like the final composition help to solidify the material through application. I enjoyed the course a lot.","Very fun with a great atmosphere"]},"Spring '16":{"comments":["Excellent practice for any instrumentalist looking to expand their repertoire and skill set","Know that if you're a good jazz player, you should be ready to take Vijay Iyer's class instead... You may find this class slightly boring, and you do not learn technical jazz harmony, while also playing standards and charts with a reputation for being difficult.","you're gonna have a lot of fun in this class playing a lot of great music. both Yosvany and Nick are fantastic jazz teachers, and I really loved taking this class","This was an awesome class beginning to end. As someone with little experience playing jazz, this class really helped me improve my chord voicing and improvisation. The teaching staff is amazing, and the fact that the class is centered around performing really gets everyone playing a lot.","This class is most enjoyable if you already have extensive jazz experience, but if you don't have experience\/don't play a traditional jazz instrument that definitely shouldn't deter you! No matter what background you have, everyone ends up learning a lot. The readings and famous guest artists really complement the playing, too!","The faculty are AMAZING and it's a great opportunity to take this course just to work with them (that's why I did it!). Yosvany has such a warm and generous attitude towards music-making as well as a lifetime's worth of very cool experiences, and I really learned so much from just being around his energy and capabilities. Through his expertise, the class is founded on a love for Art Blakey's music and its contribution to jazz, so you don't have to be an expert on Art Blakey in particular, but you should have a love for jazz and a conception of how the sound of this music is close to your heart. This class is a place to improve your playing and musicianship with the opportunity to study with people who really have a deep knowledge. It's not an opportunity to miss!","Even if you're not a fan of Jazz, you should take this course. It will open up your eyes to a whole new world in music."]},"Spring '17":{"comments":["If you want to have more experience with performing Jazz or learn extensively about Jazz artists then this is the class to take.","Really chill and fun class. I hope they change it in future years so that there is more of a focus on improvisation and performing. Yosvanny and Nick are amazing musicians with so much to offer and guest lectures were really great","very chill class, great teachers. Ideal for someone who comes in with little to no knowledge on the subject matter, as you'll likely be frustrated if you come in expected rigorous study of the subject.","If you are looking to dip your toes into jazz, this course will give you an appreciation and grounding in the basics! You will get out of it what you put into it.","This course is a unique chance to work with other students in a jazz ensemble and also to learn about both the history of jazz and also the theories and philosophies held by its most influential figures. The lectures involve reading discussions and (allegedly) playing instruments in combos (we rarely got to that because of how often the discussion went too long). The section component is awesome because you get to spend it solely playing pieces with your combo (your section mates). It was great to focus on playing and developing jazz ability for real rather than just exploring it intellectually.","If you like playing jazz, this class is a good one for you.","Really cool class.  Yosvany is great (though he does cold call).  Nick is a wonderful TF, who adds a lot of structure to the class.","Don't expect it to be anything like your other courses in terms of structure and goals. It's a space for us to talk about music and play music in the context of the Messengers. A lot of fun overall, but don't take it if you do not deal well with the absence of structure.","It's DOPE.  It's chill work, but it's super interesting and fun.  You basically learn about\/listen to\/play awesome jazz tunes, and then all of the sudden the end of the semester rolls around and you go \"Whoa!  I feel like I put no work into this class, but I can jazz now!\"  and you're not the world's best jazz musician or anything but you learned a whole lot and had a great time and it was chill.  At least, that's what happened to me.","If you want a class with no work, take this. But you could literally buy a Real Book and the 2 books we read over the course of the semester and get the same education. The only thing I took from this course were a few blues licks that I can use in soloing now.","This class is a lot more reading and discussion based rather than playing-based. I thought I was going to play and perform a lot more, but playing mostly happened in section, which was one hour a week. Although my understanding of Jazz has improved, I don't think my playing or improvising has very much.","Fun if you're committed to the project of becoming a better improv musician, but very disorganized class. The work didn't match the syllabus at all","This class was perhaps the biggest disappointment of my Harvard career. We spent every lecture immersed in lecture that did not improve my musicianship nor pique my interest. Students seldom participated and discussion was very stilted. If you're looking for a class that'll help you become a better musician by actually playing, you're better off forming a band in your free time.","if you play music and play or are interested in jazz, this is a course you must take"]}},"mostRecentQ":{"overall":"3.70","workload":"2.90","difficulty":null,"recommendation":"3.80","enrollment":"27","response rate":"77.78","QCourseOverall":{"number":"MUSIC 142R","course_id":"13734","cat_num":"160642","1s":"0","2s":"0","3s":"3","4s":"5","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 142R","course_id":"13734","cat_num":"160642","1s":"6","2s":"6","3s":"0","4s":"0","5s":"0"}},"success":true}