{"scores":{"Spring '17":{"course_score":{"overall":"5.00","workload":"4.20","difficulty":null,"recommendation":"4.90","enrollment":"26","response rate":"73.08","QCourseOverall":{"number":"MUSIC 15B","course_id":"13612","cat_num":"160660","1s":"0","2s":"0","3s":"0","4s":"1","5s":"15"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 15B","course_id":"13612","cat_num":"160660","1s":"4","2s":"7","3s":"1","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.90","workload":"3.60","difficulty":null,"recommendation":"4.90","enrollment":"21","response rate":"76.19","QCourseOverall":{"number":"MUSIC 15B","course_id":"13612","cat_num":"160660","1s":"0","2s":"0","3s":"0","4s":"1","5s":"15"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 15B","course_id":"13612","cat_num":"160660","1s":"4","2s":"7","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["HGC is amazing. The Harvard Glee Club is an incredible group of people and musicians. It has been fantastic learning and singing with them for the last few years.","Glee club has been one of my best experiences freshman year, and I encourage any incoming newies to join Glee club. Through Glee club, I have found a space where I can not only grow as a musician, but also as a person. I have found some of my best mentors, guides, and confidantes in this group of outstanding individuals, and I truly feel at home with the Harvard Glee Club.","Join Glee Club. Just do it. www.harvardgleeclub.org","The Glee Club is great, but make sure you can commit yourself fully to it time-wise. You'll get more out of it that way, and besides, a lot of the singers take the Glee Club really seriously and may judge you for missing rehearsal.","Glee Club is great!","The Glee Club is a great experience. If you want a great way to learn and perform great music and join a great community, this is the way to do it.","Join Harvard Glee Club!!! Best decision I made in Freshman Year.","Glee Club is the best! Definitely audition!","The Harvard Glee Club has opened my eyes to a beautiful learning. A single melisma tells a story."]},"Spring '17":{"comments":["DO IT","The Glee Club is incredible. Why not get credit for it.","This is a wonderful way to take a class that doesn't feel like a class, and introduces you to a lot of interesting types of choral music. Develops your skills as a group musician, with potential for solos and management\/leadership education as well.","SING WITH US\r\nWE ARE NOT A CULT I SWEAR\r\nWE ALSO HAVE BALLER TOURS","\"Just to clarify, as long as you can make rehearsal, you don't have to do shit\" - Mike Patterson T2 '17","Joining Glee Club was the single best decision I made in college. It completely transformed my view of Harvard and gave me a wonderful community. I cannot recommend auditioning enough.","Glee Club is a family that you do not want to miss out on becoming a part of. Not only is the group bound musically, but socially. While a large chunk of your time will be spent with Glee Club, every minute will be worth it.","This is one of the best decisions I've made at Harvard. Amazing community, lovely and diverse people, fun social experiences. Compelling and diverse music, of all ages and genres, a great way to practice theory and musicianship. Unbelievable experiences like Tour and other concerts."]}},"mostRecentQ":{"overall":"5.00","workload":"4.20","difficulty":null,"recommendation":"4.90","enrollment":"26","response rate":"73.08","QCourseOverall":{"number":"MUSIC 15B","course_id":"13612","cat_num":"160660","1s":"0","2s":"0","3s":"0","4s":"1","5s":"15"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 15B","course_id":"13612","cat_num":"160660","1s":"4","2s":"7","3s":"1","4s":"0","5s":"0"}},"success":true}