{"scores":{"Spring '16":{"course_score":{"overall":"4.80","workload":"3.00","difficulty":null,"recommendation":"4.70","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"PSY 980W","course_id":"13821","cat_num":"160666","1s":"0","2s":"0","3s":"0","4s":"1","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980W","course_id":"13821","cat_num":"160666","1s":"2","2s":"4","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["Take this class!!! I've taken both of Mariska's courses and they're both great, but this one is incredible. It is so interesting. There is not a ton of work, and class is great.","This class was excellent. The readings were really interesting, and the discussions were always thought provoking. Mariska is a great instructor, an expert in the field, and clearly passionate about the subject matter and its real-world application. Take it!","TAKE THIS!  This course approaches social justice issues (sexism, racism, classism), but without the ranting.  Everything is grounded in theory, and discussions are very level-headed while still focusing the issues.  It's a real gem.","This is an excellent course and Mariska is an incredible teacher. She's really passionate about the subject and cares about her students. Also the subject matter is very interesting.","Mariska is great, and this course covers some really interesting and relevant information about social hierarchies. It gets you to question the structures and forces at play in our own society, which is really important, and we engaged a lot with current events."]}},"mostRecentQ":{"overall":"4.80","workload":"3.00","difficulty":null,"recommendation":"4.70","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"PSY 980W","course_id":"13821","cat_num":"160666","1s":"0","2s":"0","3s":"0","4s":"1","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 980W","course_id":"13821","cat_num":"160666","1s":"2","2s":"4","3s":"0","4s":"0","5s":"0"}},"success":true}