{"scores":{"Spring '16":{"course_score":{"overall":"4.60","workload":"3.90","difficulty":null,"recommendation":"4.80","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":"TDM 149DA","course_id":"13611","cat_num":"160652","1s":"0","2s":"0","3s":"0","4s":"6","5s":"11"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"TDM 149DA","course_id":"13611","cat_num":"160652","1s":"3","2s":"12","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["Wonderful class! Thomas is a tango aficionado. His expertise along with an impressive set of guest artists, professors, and lecturers made the class a complete and immersive experience. Would recommend 10\/10","This class is amazing! In how many classes do you get to spend at least an hour every week dancing? It is a lot of fun, and the academic portion of the class is also interesting. The readings are engaging, although a lot of the reading is front loaded so that the first few weeks of class feel overwhelming with the amount of reading required. But once you get past that, it's great (and those readings are interesting, even if they are a lot). What it comes down to is that this class is a great way to combine theory and practice, learning about the history and culture of tango and then getting to actually do it every week.","I had a phenomenal time in this class. The workload is limited and when it does pick up, the readings are interesting and the creative projects are a blast, if you put in the effort. The class is certainly and exclusively about tango, as a dance, literature and history. You will dance a lot (hopefully with others who are equally inexperienced) and you will truly get better. Plus, this year the class was full of fascinating guest lecturers and dancers. It was, for me, a true tour-de-force, and I could not more highly recommend it. I am thrilled to have taken it, I really enjoyed learning from and getting to know Tom, and I am also happy to have put this onto an otherwise difficult courseload, as it was remarkably manageable.","Take this class.  You will never in your time here find a class so fascinating, so brilliant, taught by a professor who is equally fascinating and brilliant but who also cares so much about you as a student.  Absolutely incredible.  Take it.","This class was extraordinary. As someone with an interest in Latin American history and culture as well as an interest in music but zero dance class experience, I really enjoyed getting the chance to get physically involved with the subject I was studying. And I really did learn to dance tango in this class. I also got to engage with a great group of people more than classes often afford. Take this class, you won't regret it.","TAKE THIS COURSE. It absolutely blew me away. Don't dance? Doesn't matter. Never heard of the tango? Who cares. Think the dance is incredibly sexy? It is. What the hell is a Milonga? Find out. \r\n\r\nBottom line, you will gain so much from taking this course. I am the last person one would think would take this kind of class, but I did and I am grateful for the experience. Dancing the Tango is one of the most intimate, confidence-enhacing things you could ever do for yourself a a student and just as a person. Equally important, be prepared for some serious readings that will teach you the history of tango that only serves to add to the significance of what you yourself will be doing in class.","A great way to learn about tango and dance! Tom brought in a bunch of amazing famous dancers and lecturers so that was a really cool experience!","Must take this course if you have an interest in Argentina, tango, music, history, and\/or dance","This was the most incredible course. Prof. W was phenomenal and the course was so well organized. I couldn't believe the amount of tango culture, history, and practice I learned, and especially having prior knowledge of Argentina, I was so happy with how much more I learned in this course.","You get to dance a lot and really understand everything about tango and its history. A ton of guest artists.","SUCH A GREAT CLASS. And you learn to tango, so yeah.","After college this is one of the classes you'll likely remember most. You will have the opportunity to do rigorous academic work about the dance, which is an uncommon opportunity here.","I think this is an opportunity for Harvard students to get out of their comfort zones and try physical learning. You would be surprised how much you improve in such a short period of time and how wonderful it is to learn about a cultural form and actually apply it!","TAKE THIS CLASS! Even if you think you don't have time to."]}},"mostRecentQ":{"overall":"4.60","workload":"3.90","difficulty":null,"recommendation":"4.80","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":"TDM 149DA","course_id":"13611","cat_num":"160652","1s":"0","2s":"0","3s":"0","4s":"6","5s":"11"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"TDM 149DA","course_id":"13611","cat_num":"160652","1s":"3","2s":"12","3s":"1","4s":"0","5s":"0"}},"success":true}