{"scores":{"Spring '17":{"course_score":{"overall":"5.00","workload":"3.90","difficulty":null,"recommendation":"4.90","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"MBB 980M","course_id":"13582","cat_num":"160759","1s":"0","2s":"0","3s":"2","4s":"2","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MBB 980M","course_id":"13582","cat_num":"160759","1s":"2","2s":"7","3s":"0","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.40","workload":"3.30","difficulty":null,"recommendation":"4.30","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"MBB 980M","course_id":"13582","cat_num":"160759","1s":"0","2s":"0","3s":"2","4s":"2","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MBB 980M","course_id":"13582","cat_num":"160759","1s":"2","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MBB 980M","cat_num":"160759","course_id":"13582","year":"2015","term":"2","id":"1bfc4e89ee288b7f5b06a660b88dfa39","first":" David A","last":"Silbersweig","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Spring '16":{"comments":["David is the best. So sweet and kind and really wants you to understand the material. He loves the field he is working in and it is so evident that he loves teaching as well. The class is very casual, with one assignment per week that is graded very leniently. Loved this class -- not stressful, easy 5th, and you get to explore some really exciting\/innovative topics","Dr. Silbersweig is so knowledgable and kind. Both he and Marie-Christine create an encouraging environment where you are not afraid to share your ideas or ask any question. Every week we were asked to read a few scientific articles and write a summary paragraph and a paragraph of \"best questions\" (total <2 pages). This format allowed us to practice distilling the articles to the central argument and challenged us to think about the implications of the research. The final was a research paper on a topic of your choice (8 pages, 1.5 spaced), which was really enjoyable to write. This is a super interesting course that makes a great elective as it is not particularly demanding time-wise!","It's a very interesting and chill class. David and Marie-Christine are phenomenal and complementary to each other in terms of teaching styles. Discussions are fun. You are exposed to the issues in neuropsychiatry and the difficult questions still out there.","This course was a low-stress, manageable yet extremely interesting and informative class. I learned quite a lot about neuropsychiatry and major concepts without having to ever be stressed over this class.","If MBB 980M is offered again, take it! No background in neuro\/psych required. This is one of those courses that you take to get to know the people teaching it, and because it will be useful throughout life as you or people you know face neurologic\/psychiatric health problems, and to understand how society functions in general. David and Marie-Christine are two of the most caring educators I've encountered at Harvard, and they balance each other out very well.","David and Marie Christine are both wonderful and the premise of the class is an incredibly interesting and important topic to discuss.  However, I felt as though the topic was almost too broad to be able to really attack specific issues in enough depth.  I enjoyed the class and it helped me think about neuroscience in a different way, but I think the structure and the readings of the class may need to be restructured. I did, however, like the weekly \"best questions\" assignment as it really forced you to best summarize and condense the readings but also forced you to ask questions that extended beyond the readings that then helped you realize the limitations of the papers\/readings, etc."]},"Spring '17":{"comments":["This class is an amazing opportunity to learn from two of the best! David and Marie-Christine are extremely knowledgeable and always facilitate great conversations during class. You will learn so much about mental disorders as well as imaging techniques without even feeling like you are putting in too much work. The assignments are fair and help you get a better grasp of the material.","Take this course, especially given that it's a low workload but still meaningful and engaging. You'll tackle materials in a new way.","very interesting and mind-opening topics","The small seminar style of this course leads to such interesting and engaging discussion--Marie-Christine and Dr. S make such a good team. They give such helpful feedback and moreover genuinely care about this course and the students in it. It is an amazing class to take, requires not too much work, but still lots of thought. It will make you question many debates and issues in neuroscience, psychology, ethics, etc. Going to class does not feel like going to your average college class, but more like an opportunity to talk to really cool and interesting people about cool and interesting things!","Professor Silbersweig and Marie-Christine are fantastic and really care about their students. We also got to attend a psychiatric patient interview at Brigham and Women's, which was an amazing experience. I would just say to start your final paper earlier than I did!","This is truly a unique course where you have the opportunity to explore the intersections of neuropsychiatry and philosophy with a teaching team who is very knowledgable and supportive. I would absolutely recommend the class  to someone who is interested in the field.","Wonderful, kind professors who are interested in bringing out your best ideas and having fascinating discussions. Watching a patient interview was an amazing experience. If you like making big conceptual connections and having fun, important, sometimes personal discussions about the brain, self, society, technology, and more, this is a great class. I knew very little about the subject matter besides having taken SLS 20, but found it totally manageable and it was one of my favorite classes!"]}},"mostRecentQ":{"overall":"5.00","workload":"3.90","difficulty":null,"recommendation":"4.90","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"MBB 980M","course_id":"13582","cat_num":"160759","1s":"0","2s":"0","3s":"2","4s":"2","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MBB 980M","course_id":"13582","cat_num":"160759","1s":"2","2s":"7","3s":"0","4s":"0","5s":"0"}},"success":true}