{"scores":{"Spring '17":{"course_score":{"overall":"4.60","workload":"3.00","difficulty":null,"recommendation":"5.00","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"OEB 104","course_id":"13986","cat_num":"161184","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"OEB 104","course_id":"13986","cat_num":"161184","1s":"1","2s":"2","3s":"0","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"4.50","workload":"3.70","difficulty":null,"recommendation":"4.80","enrollment":"8","response rate":"50.00","QCourseOverall":{"number":"OEB 104","course_id":"13986","cat_num":"161184","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"OEB 104","course_id":"13986","cat_num":"161184","1s":"1","2s":"2","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Spring '16":{"comments":["So it's new. And like most new things, the risk-aversion of humanity provides you with a golden opportunity. Would I say this is your sparkling opportunity to get into a brilliant course? God no! Would I say this is your sparkling opportunity to get into the best course you could possibly wish to get into? Yes. It cannot be understated how marvellous our dr-professors were. Don't be a bloody idiot, take this course and enjoy your semester.","OEB 104 is a truly great class. Learning about mouse biology\/comparative medicine from two experts currently working in the field was excellent. The various ways in which the course leveraged the professors' access\/connections (access to the BRI facility, great guest speakers, course materials from the veterinary records, availability of live mice) constituted particular strengths of the course. The professors were both fantastic-- approachable, good teachers, and leaders in the field. The project-based structure of the course also allowed us to dig quite deeply into a chosen topic and then present to the rest of the class, which was a blast and allowed us to do some serious research. The class was refreshingly interdisciplinary- in addition to learning about biology and veterinary medicine we also tackled public speaking, teamwork, design software. I would highly recommend it.","I bet you had no idea there was so much to learn about mice! This class is useful for those looking to pursue careers in biomedical research, ecology, evolution, behavioral research, etc.","This is not a difficult course, and is a great opportunity to learn about the ins and outs of mouse research, which is important because of how extensively mice are used in research. As such it is a relevant topic to almost anyone, even you don't exactly study biology. At the same time the course will only be as good as what you put into it--it doesn't necessarily have to mean extensive hours, but genuine enthusiasm and engagement makes it a much better experience for everyone involved. Definitely a worthwhile class, will be interesting to see how it hopefully develops in the future!"]},"Spring '17":{"comments":["This class is great as an elective! It doesn't require too much work but you get to learn a lot about how nice are perceived and used in science. The big assignment of the entire semester is a group presentations. The professors work really hard to make you a well rounded team player and presenter, which is useful in all fields of work!","This course is terrific! Dr. Niemi and Dr. Pritchett-Corning are an excellent team, and lectures and discussions throughout the semester were really engaging. Topics ranged from ethics to evolution to physiology to gene editing techniques to socioeconomics. This course emphasizes real-world skills, and the workload was consistently reasonable and the readings were always interesting. We worked on a semester-long project, and project prompts are wide ranging and allow for many different approaches. Working on my team's project was a highlight of the class. The smaller mini research prompts throughout the semester were also really interesting, such as asking us to come up with a novel and creative solution to a real-world issue in mouse research. The three guest lecturers were great as well. Definitely take this class!","Phenomenal class! Take it!","TAKE THIS CLASS. You can be an oeb major, a ves major, or a social studies major, as long as you are even remotely interested in mice you should definitely take this class. Very straightforward and easy A, you just have to have enthusiasm for you final project, but they're all super fun topics to chose from so it should be easy to pick one you'll like doing.","If you want a low stress course with just a final project, take this class. Great for OEB concentrators\/secondaries","Everyone should take this class! It ended up being one of my favorite classes at Harvard. The professors are really cool and the material is quite inter-disciplinary and interesting. The workload is also very manageable because you work on one project the entire semester.","Take this course!"]}},"mostRecentQ":{"overall":"4.60","workload":"3.00","difficulty":null,"recommendation":"5.00","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"OEB 104","course_id":"13986","cat_num":"161184","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"OEB 104","course_id":"13986","cat_num":"161184","1s":"1","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}