{"scores":{"Spring '17":{"course_score":{"overall":"4.00","workload":"2.30","difficulty":null,"recommendation":"4.20","enrollment":"8","response rate":"75.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["THIS WAS THE BEST CLASS I HAVE EVER TAKEN. HONESTLY I LOVED IT SO MUCH AND I WISH IT WAS THE ONLY THING I COULD FOCUS ON FOR THE WHOLE SEMESTER. MIKE AND HEATHER ARE THE BEST. THIS WAS THE HARVARD EXPERIENCE IN ONE CLASS. CHANGED MY LIFE.","Only take this class if you really like history. If you are not a huge history fan, this class will be torture.","If you like history even just a little bit, take this course. It is very interesting and the skills you learn are deeply useful for your future careers in academics.","Ok, so a couple things to know about this course. \r\n1) You get access to AMAZING historical materials...you get to hold things like Theodore Roosevelt's childhood letters in your hands!! So cool!!\r\n2) Though the materials are cool, the seminar time itself can be a bit dry. The instructor--though being a wonderful guy--isn't great at stepping back and letting students discuss things, so a lot of it is him leading discussions. Its still a great seminar and I have really enjoyed it...but thats just something to know going in.","It is a once in a lifetime course, but it might feel like a waste of time. Truly appreciate the opportunity to work with the materials in class and keep in mind how cool the experience it. It can feel a little boring at times, but overall I thought it was a good class. The assignments themselves were not clear. There wasn't a lot of feedback or prompts. I felt like I was on my own for a lot of the assignments with no direction.","A very easy class, there is literally only one official assignment (a ten-page essay due at the end of semester)."]}},"mostRecentQ":{"overall":"4.00","workload":"2.30","difficulty":null,"recommendation":"4.20","enrollment":"8","response rate":"75.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}