{"scores":{"Spring '17":{"course_score":{"overall":"1.60","workload":"3.00","difficulty":null,"recommendation":"1.40","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["Course expectations were high with little guidance. First semester, Eva announced on multiple occasions that the final paper may not turn out to be an assignment. But come one week before reading period, it turned out that we had to write a paper with tons of guidelines that were unheard of until then. Second semester, updated final paper guidelines were not sent out until 2-3 weeks before its due date. It is obvious that Eva did not think about the guidelines until the last moment, but still holds high expectations for the project as if we were somehow able to work with the rules since last year. It was a class that I had great interest in, but the execution was terrible, and Eva was not able to attend even half of her own lectures second semester.","This class had so much potential. The topic and many of the readings were really fascinating and dealt with exciting material on a growing field. However, this class was taught very poorly. The open-ended discussion in class often led to each week feeling disjointed from the rest; there was no effort made to draw larger conclusions from the paper, or discuss future directions of the material we were learning. Essentially, I walked away feeling as though I didn't learn anything. Furthermore, this class was advertised as having a computational component for beginners, but due to a lack of planning, there was no MATLAB instruction as originally intended.","Don't take this class. Worst class I've ever taken.","Take this course if you're interested in neural circuits that contribute to individuality."]}},"mostRecentQ":{"overall":"1.60","workload":"3.00","difficulty":null,"recommendation":"1.40","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}