{"scores":{"Spring '17":{"course_score":{"overall":"4.30","workload":"3.90","difficulty":null,"recommendation":"4.50","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["The films are excellent, and it's a great way to be exposed to Italian film, culture, and some history.","This is an incredibly entertaining, fun, and relatively easy course. You need to be open to watching some films you may not enjoy, though the critical analysis is always interesting. This was a great way to learn about Italian history, since it was so pervasive in the films. And Adam is an amazing teacher who clearly has enthusiasm for the subject material. Take this class. Do something fun with your courses at Harvard, especially if you want a 5th course about something totally different.","Great survey of Italian cinema, films were great, perfect amount of reading assigned, definitely low stress, take it if you care about Italian film at all!","Amazing class, offered me insight into a subject that I had no background before taking it. Definitely a gem of the Harvard liberal arts classes that I will appreciate after college","Take it, just take it. Adam is the best and you get to watch awesome films. Such a great class.","If you have a genuine interest in Italian cinema then by all means take the class. If you are just looking for an easy class where you get to watch fun movies your senior spring, maybe don't. This class was fine and I learned something about Italian Cinema, but I definitely was not interested enough in the subject to really get a lot out of it.","It was a fun exploration of Italian cinema","The weekly posts can be graded tough, you really do need to put considerable effort in.  But work is constant each week which is nice to have.  Adam is helpful and films are great.","Lots of discussion in class and learned a lot about Italian history.  No conclusions were really drawn about anything it was more like discussing everyone's opinions about a film for 2 hours and then moving on in life.  Happy to have taken this class though because I never would have watched these classic Italian films or known anything about what was going on if I did.  I look at movies in a new light now and the workload is incredibly low with a single blog post of 300 words every week and one movie a week with a final paper.  Highly recommend!","You will watch one movie each week (2-3 hrs.) and write a response post about each (1 hr.). Aside from that you have to lead one discussion and write a final paper. Super low time commitment and generally enjoyable class!","This is a really enjoyable and manageable class. Adam's a great instructor who cares about his students and their well-being, and class discussions are generally engaging. The syllabus includes some really wonderful films, and I leave the class with a much deeper appreciation for films as art. I think the course does a great job of cultivating that kind of appreciation.","This class is great!!! Definitely consider taking it. I took it to fill my AI requirement but would take it again even if I didn't have to. Make sure you watch the films far enough in advance to write about them well in the short discussion posts, and while not necessary, doing the reading before writing the post is helpful if you're able to. Start the final paper early and meet with the professor\/TF about it multiple times if you can.","The movies you watch are great, and Adam is a wonderful professor.","Adam is a great professor. His knowledge of film runs deep as is notable in the questions he asks and the topics he sets during discussion. There is not a whole lot of work outside of class other than actually watching the films and writing the weekly responses. You should try to find a space\/time where you can relax and enjoy the films, not just watch them to get the assignments done."]}},"mostRecentQ":{"overall":"4.30","workload":"3.90","difficulty":null,"recommendation":"4.50","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}