{"scores":{"Spring '17":{"course_score":{"overall":"5.00","workload":"6.30","difficulty":null,"recommendation":"5.00","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["This is a fantastic course all-around. Challenging yet manageable, this course is excellent for improving the academic skills of reading, writing, and speaking. It also deals with interesting subject matter. Probably the best thing about the course was Jake though. He brings the course material to life and makes himself incredibly accessible.","This class is truly a treasure. It's small, meaning you get more individual attention, and Jake goes out of his way to get to know you and your style as a student. Each seminar is engaging and thought-provoking, and the materials we worked with are extremely relevant and exciting.","Jake is amazing, and it is so refreshing to take a course at Harvard where the teacher actually cares about how the students are digesting information.","Be ready to write! Take advantage of how helpful Jake is! DO THE READINGS THEY ARE AMAZING.","The material in this course is very interesting and some of it you'd probably never come across otherwise, but truly what made this course special was Jake's teaching and the intellectually stimulating collaborating classroom environment that he created. The reading might seem like a lot but it isn't really for a history seminar course, and most of it is easy to follow. Loved the course!","This class was challenging, but so fun. I took this class as an elective my senior spring, and it was a lot of work but so fun and rewarding (I concentrated in psychology and this was my first history class). Jake is incredibly engaging and really helpful, very easy to reach him outside of class. The paper is a lot, but very doable spread out over the semester, don't let that scare you away from the class. It's worth taking"]}},"mostRecentQ":{"overall":"5.00","workload":"6.30","difficulty":null,"recommendation":"5.00","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}