{"scores":{"Spring '17":{"course_score":{"overall":"4.00","workload":"7.00","difficulty":null,"recommendation":"4.20","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["Prepare yourself for a long slog. Get the readings done and your essay worked upon early, and this has the potential to be a great class for you! If not, this class will become burdensome quickly.","Jamie is an incredibly enthusiastic instructor who introduced me to history research. The topics in the class are very broad so you can really take the time to write your paper on anything you want.","Great course, but tough course. You'll learn a lot as long as you do the readings and engage in discussion.","This class is amazing! Jamie is the best and the material is super interesting. I would highly recommend this class to anyone, especially people with an interest in interwar Europe","This is an incredible course on the political history of inter-war Europe. Jamie is a fantastic teacher.","This is a great course on an interesting topic, but at times you may not get to explore some of  the readings as in depth as you might like. The paper ultimately really allows you to develop and expand upon your interests, and Jamie is a great resource and so helpful with this!","This was a great seminar and introduces you to the history of interwar Europe and moments that might not be studied in a less intensive course. You learn about many countries, political institutions, and civil tensions. There are alot of weekly readings that are necessary to read in order to fully participate. The assignments leading up to the research paper are fun and the research paper takes a lot of time and research but is really worth it in the end.","While the topic sounds interesting, we spent a lot of time in class re-capping the subjects of the reading. I don't feel like the class built on itself and thus we were never able to move beyond surface level conversation.","Don't expect this class to be easy. Jamie is super helpful as a professor by always offering tons of feedback and holding good office hours, but you definitely have to put in the time considering your research paper is completely self-driven. Don't fall behind on the paper. Jamie sometimes can be difficult if he doesn't agree with your ideas, but is usually respectful of other people's opinions. Sometimes the readings are sort of disjointed but if you want to read cool literature or just learn about cool history stuff in general, this might be class for you. Generally pretty chill though and I enjoyed it."]}},"mostRecentQ":{"overall":"4.00","workload":"7.00","difficulty":null,"recommendation":"4.20","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}