{"scores":{"Spring '17":{"course_score":{"overall":"4.70","workload":"6.10","difficulty":null,"recommendation":"4.60","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["Professor Bruno is absolutely amazing and is reason enough to take this course - he will really makes an effort to tailor the course to students' interests, encourages participations with his warm and thoughtful and validating demeanor, and doesn't overburden you with readings. The course material itself is super interesting!","Dr. Bruno is a great teacher, and is very invested in the success of his students. This was the first year the seminar was taught, and Dr. Bruno will only improve upon it next year. If you're interested in learning about constitutions and taken part in a discussion-heavy class, this is a great way to do that.","Gov 94CN is an incredible seminar. Jonathan is a tremendous instructor and has selected great readings\/assignments for the course. You'll learn tons every week!","This is an incredible course, and Jonathan Bruno is an amazing professor. If you are at all interested in the subject matter, you should definitely take it!","Great class to take to learn more about both US and internatonal constitutions. Very eye opening.","If you are at all interested in constitutions or governments in general, then this would be an amazing class to take. Jonathan is a thoughtful and engaging lecturer, and he does a great job making each session interesting and insightful. The course material was eye-opening and often surprisingly enjoyable to read through. Overall, great course!","The workload is manageable, Jonathan is really approachable and helpful, and overall it is an enjoyable course.","Take this class! I took it in my time as an international Visiting Undergraduate Student at Harvard, and in my country I study Law. In my home institution, I had taken five courses on constitutional law and I must say that this class gave me a better understanding of constitutional matters than all my previous ones together. It will get you engaged in very comprehensive and deep debates involving all aspects of constitutions with a very fair, manageable workload and quite enjoyable class meetings, which I looked forward to every week. You will also learn a lot from Professor Jonathan Bruno, although he only intervenes to clarify some issues and moderate the debates. He is very thoughtful, kind, accessible and provides great feedback, and was definitively one of best Professors I have had in college. He also asks for constant anonymous feedback during the course, so you can always tell him if you think the course should be improved. As I said, seriously, if you like the subject, take this course - you won't regret it.","This was a great class, where even when the material itself was occasionally dry, the structure of the discussion and Jonathan's enthusiasm propelled the class. I would definitely recommend it, and since the class allows you to tailor your final research paper to topics you personally are interested in."]}},"mostRecentQ":{"overall":"4.70","workload":"6.10","difficulty":null,"recommendation":"4.60","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}