{"scores":{"Spring '17":{"course_score":{"overall":"4.40","workload":"3.50","difficulty":null,"recommendation":"4.50","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["This course is, in general, an incredible experience within a new and exciting field of scientific inquiry. Chris Golden and Sam Meyers may not be the best teachers at Harvard, but they are incredibly passionate about their work. Each week is exciting and unique from the rest, and draws from a wide range of disciplines, from ecology and epidemiology, to politics and activism.","This course provides a wide-ranging overview of the current and future challenges to human health posed by human-induced environmental change. The discussions in class concern not only the scientific basis of these issues, but also what can be done by communities, professionals, academic institutions, and policy-makers.","Interesting subject material, but lacks the focus necessary to make students feel like they've really gotten something new out of it","This class is amazing. Take it.","One of my favorite classes of all time. Covers a bunch of super fascinating topics that are relevant to today. Each class was structured differently, so there was no time to get bored or tired of a certain class structure. Awesome guest lectures, and the professors really care about the material!","This course covers a wide breadth of human and environmental health topics, and provided me with a thorough understanding of how many ecological changes could have human health consequences.  Some background in global health would be helpful, though not imperative.","This course is one of the few Harvard classes that truly uses an interdisciplinary perspective to study one of the world's largest threats, climate change","Take this course!! The professors are awesome people and the workload is very light. Planetary health is such an interesting topic for anyone interested in medicine, public health, or environmental issues. You'll learn so much about ongoing interesting health issues and hear from speakers that are at the top of their fields."]}},"mostRecentQ":{"overall":"4.40","workload":"3.50","difficulty":null,"recommendation":"4.50","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}