{"scores":{"Spring '17":{"course_score":{"overall":"4.10","workload":"4.30","difficulty":null,"recommendation":"4.10","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["I really enjoyed having one to one interaction with our teachers, and presenting papers ot the class.","This is a pretty chill tutorial. Just 2 science papers per week and about 2-3 presentations, depending on how many people take the course. Elisa and Joe and really nice. Participation is a big part of the class, so make sure you are staying engaged. There's honestly no pressure!","Taking this course is an excellent way to learn how to think about neurobiology. Even though students had different backgrounds on scientific readings and neurobiology in general, Elisa and Joe were able to structure the course in a way which adapted to everyone's background. They are also great instructors and very friendly.","I loved this class. I learned so much and became much more confident in reading scientific papers. I also feel like I really got to know our instructors and peers in the class. I did not feel judged for asking questions that I wanted to know the answers to.","Joe and Elisa are wonderful. The class is well organized and approachable. The papers make you knowledgeable about the field of neuroplasticity and hippocampal learning. You also learn how to present scientific work better, work through papers, and discuss complicated neuroscience research with other people who are interested in this area."]}},"mostRecentQ":{"overall":"4.10","workload":"4.30","difficulty":null,"recommendation":"4.10","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}