{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"4.50","difficulty":null,"recommendation":"5.00","enrollment":"9","response rate":"66.67","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["This course is absolutely phenomenal. If you're interested in theater at all, you should take this course. Take this is you've never done theater design before or if you're an experienced designer in a single field. You will learn so much. The environment for learning that is created is unparalleled. Take this class.","This class is so much fun! Really great introductory course that leaves you feeling well-rounded in terms of the different aspects of technical theater and theater design (I say that as someone who went in with pretty much zero technical theater experience). Justin, Will, and John do a great job of going over the design process in a way that someone with zero theater experience can follow, and as professionals in their field give clear and educational feedback on assignments and projects. The projects they assign are creative and fun, but they take more time than you'd expect! Definitely do not try to leave them until the last minute, or you'll find yourself sitting in the Lamont media lab all night. You'll also meet some really great and creative people in this class (or they'll all be people you'll already know), and you're bound to become friends after seeing each others' projects. This has probably been my favorite class during my time at Harvard. Would highly recommend!","TAKE THIS CLASS!   TDM MUST MUST MUST continue to offer not only this class but also other technical theater classes.  Although primarily an actor\/director, technical knowledge will help me better speak to the technical staff and work toward the goal of understanding ALL aspects of the theater.  Because of this class I feel comfortable desigining any part of my play I am directing next year if i had to.  The only class I would spend 6 hr\/wk in.","If I could take this class for all 32 credits of my Harvard education, I would. It was fascinating and the most useful course I've taken so far.","This class is incredible - take it."]}},"mostRecentQ":{"overall":"4.80","workload":"4.50","difficulty":null,"recommendation":"5.00","enrollment":"9","response rate":"66.67","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}