{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"6.00","difficulty":null,"recommendation":"4.80","enrollment":"12","response rate":"66.67","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["This was one of my favorite classes that I've taken at Harvard. \r\n-Dr. Nizzi is phenomenal. She has an incredibly in-depth knowledge of multiple fields, and is an extremely effective teacher, both in conveying information and facilitating discussions. \r\n-The material in this class runs the gamut, from Plato, Aristotle, Locke, and Descartes to cutting edge neuroimaging studies. It really gave me a better sense of how philosophy can interact with other disciplines.\r\n-The weekly reading responses make class way more interesting, because everyone has taken some time with the readings, and the final paper is a cool opportunity to explore pretty much anything you want.","Prof. Nizzi is a great professor! She has experienced in so many fields and brings a lot of expertise to the classroom in order to guide and flesh out the discussions started by students. The reading and assignment schedule for the class were very reasonable time-commitment wise which I think really encouraged students to come to class ready to discuss the readings very seriously.","Dr. Nizzi is brilliant and is so knowledgeable about both the fields of psychology and philosophy, and this course facilitated great discussion on the self. I'd recommend anybody interested coming from nearly any background to consider taking this course, I'm sure you'll get something out of it.","This course was absolutely amazing. Dr. Nizzi is a fantastic human and the course material in itself is scintillating.","I used this MBB to fulfill an SLS requirement as a humanities concentrator and I'm really glad I did. The professor was so generous with everyone's different backgrounds and focuses and the material was engaging and challenging (and often very wild and startling!)"]}},"mostRecentQ":{"overall":"4.80","workload":"6.00","difficulty":null,"recommendation":"4.80","enrollment":"12","response rate":"66.67","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}