{"scores":{"Spring '17":{"course_score":{"overall":"4.20","workload":"2.20","difficulty":null,"recommendation":"4.40","enrollment":"70","response rate":"74.29","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["This class is really easy and still has interesting material. Sarah Hope is a really great teacher who cares a lot about her students!","The class was a pilot. It was quite easy (less than 1 hour of work per week), but not that captivating. The lack of work keeps individuals from really being interested. The entire grade is based on an open note midterm that did not require preparation, and a final group paper (5 pages). With that being said, Sarah Hope is probably the nicest individual I have met at Harvard. She is extremely fair and creates a great atmosphere.","I loved this class.  It's pretty interesting - cool learning about policy and child development. Definitely informs future parenting strategies. Also the easiest class I've taken absolute gem.","This course is great if you have no previous knowledge in child development. Sarah Hope is the sweetest and she is really enthusiastic about the material and making it as enjoyable of a learning experience as possible. The readings were redundant and it wa a little stressful because the final paper was worth so much. But the semester was really fun.","If you want a class where you can learn a lot and not have a lot of stress involved in the learning then this is the class for you!  Very enjoyable.","Really interesting, manageable, and cool class.","This class is one of the most amazing child development classes I've taken at Harvard. It introduces you to so many different aspects of child development, even the economics side! I would definitely recommend taking this class!!","Midterm is open note but it's important to do the reading for it. Group papers are not ideal","This class is great. The material is interesting. It does not require too much work. The midterm was fair and not difficult (open book\/open note). I'm not sure how difficult the group report will be, though. Sarah Hope is a great lecturer, and she seems to really care about the students.","This class is simultaneously easy and interesting. Totally worth it and perfect for senior spring. And Sarah Hope is so great.","This class connects psychology to various other disciplines- education, political science, public health, economics, etc. It's relevant for many different people with many different interests. One thing that sets this class apart from other psychology classes is that it feels like the curriculum has a direct application to the \"real world\" and helping people (more so than, say, social psychology). Sarah Hope is incredible, interesting, and fair. The class is also not particularly challenging, but if you put in a small amount of work, you'll get a lot out of it.","It's great","Fun course extremely light work, and very approachable\/understanding faculty. Didn't take tons and tons out of it, but it still was extremely relevant and engaging. Not super structured, but this was just the first year it was offered.","This class is a relaxed, interactive, low-stress, and fun way to be introduced to child developmental psychology and policy. Sarah Hope Lincoln is an effective, understanding professor.","Interesting topic, and Sarah Hope is a great presenter with a great deal of knowledge about child development, especially the medical\/clinical side of things. Lectures were fairly interesting but the topics got pretty repetitive such that I started zoning out halfway through the semester. Grading was surprisingly tough- only participation, a midterm, and a final paper. Having half my grade be the final group paper at the end of the semester was stressful. I'd say take it if you want a fairly easy class, but be prepared to work hard and have a lot of pressure on just a few days of the whole semester.","Great class! The material is fascinating and incredibly important. If it's like it was the first year, quite a light workload, but definitely do the readings - they're worth it and will help you gain a deeper understanding of the lectures.","Sarah Hope is a wonderful and engaging teacher who combines many types of materials into lectures (policy videos, Ted Talks, research), and incorporates her own experiences into classes.  I would highly recommend taking any of her classes.","TAKE THIS COURSE!!! Sarah Hope is the kindest, most thoughtful professor and is an extremely knowledgable source (stemming from both practice and study). The course covers a lot in the two hours that it meets but it's extremely manageable. Other than that, there was no homework and only three section meetings total. I learned a lot in this class and really appreciated Sarah Hope's direction of the course and her consideration for the students (she brought her dog in to help relieve stress!). It helps also that the midterm was open laptop + open book and that the final is just a group project--take that as you wish, but I feel that these lax requirements when it came to exams really helped me get more out of the class. I didn't have to spend hours cramming and hating the material; I learned it rather than memorized it and was able to appreciate that much more.","Take this class if it becomes more structured. Really important and relevant topic","This class is truly a gem.  Super interesting material, great professor, and low workload\/stress.","Great class! You learn a lot about many pressing and important issues. Sarah hope is incredibly kind and supportive. A great teacher!","I expected a lot more from this course. I think that the material has a lot of potential, but it was evident that the course was thrown together quickly and not much thought was given to how it was going to be taught. Lecture was mandatory, but Dr. Lincoln just read from her slides-- I could have not gone to lecture and gotten the exact same information from the course. The section component was weird; sections only met three times, and I think they were pretty unnecessary. The final project was interesting, but given that it was a paper it shouldn't have been a group project.","This class was a low-stress, interesting but not life-changing, and worthwhile addition to my course load this semester. Never required too much work and Sarah Hope is an excellent lecturer who made the two hours go by quickly. Midterm and final were light, no complaints about this class.","Class each week was a bit of a waste of time, it was extremely hard to learn and pay attention with so many students. But very easy if you need a psychology requirement.","You will love this class! Professor Lincoln shows that she cares for her students. She takes active efforts to incorporate current and relevant information to class, which, because it is once a week and low-stress, makes it engaging and more enjoyable. It is important to note this was the first year this course was offered so next year it will probably have a lot more structure, though the overall atmosphere and course material likely won't change much anyway."]}},"mostRecentQ":{"overall":"4.20","workload":"2.20","difficulty":null,"recommendation":"4.40","enrollment":"70","response rate":"74.29","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}