{"scores":{"Spring '17":{"course_score":{"overall":"4.00","workload":"4.80","difficulty":null,"recommendation":"3.70","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["It was always fun, low intensity and interesting. Perhaps a bit monotonous as the course went on, as every class felt very much the same as the last, except with a different Arthurian legend to discuss.","This class is great because you read and discuss amazing things, however it doesn't always achieve the depth of engagement with the texts you might want it to.","This class is an excellent way to learn about the landmark works in Arthurian literature.  I really enjoyed the readings as a whole although one or two were very long.  Discussion during class was of a really high level and I felt like I came away having learned a lot.  There was","This class is interesting, but the discussions can seem unfocused at times. Brandon is an approachable and kind person, though.","The readings were satisfying and the stories were enjoyable. Since we work our way up from Geoffrey to Steinbeck, get ready to have fun with reading through the evolution of what \"high literature\" is. Some of the Middle English readings (i.e. Malory) are rough to read, but the actual content is quite exciting, especially when approached with a historical or political lens. The romances definitely improve as you move through the course--the characters develop dimension, the events have consequences, but the picaresque ride through the Arthurian world can be relaxing in its own way.\r\n\r\nSince you probably will never encounter the world of Arthur in this way anywhere else, I recommend taking this course if you're interested. I know I didn't regret it.","The sheer variety of King Arthur stories, from Celtic mythology to medieval French romances to Renaissance epic to John Steinbeck, is amazing, and almost always makes for fascinating reading, which you really get to focus on since there are few other assignments. Brandon leads a great seminar--casual and fun while still very intellectual and serious about the stories themselves. If you're looking to enjoy your 90-level seminar, this is the one to take.","This was a fun exploration of Arthurian literature.  It's very discussion focused and you do have to prepare before class","Only take this class if you are seriously interested in Arthurian literature."]}},"mostRecentQ":{"overall":"4.00","workload":"4.80","difficulty":null,"recommendation":"3.70","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}