{"scores":{"Spring '17":{"course_score":{"overall":"3.90","workload":"4.50","difficulty":null,"recommendation":"3.70","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}}}},"comments":{"Spring '17":{"comments":["This is a great way to get the Arrivals requirement out of the way, even if it's not the most enjoyable class. You have to really like Middle English and old, religious texts to have a good time in this class, although Professor Tilley really loves the materials and tries hard to get everyone else to love them too.","I took this class with Brandon Tilley teaching, which Inwould highly recommend. The course has a lot of dense readings so try not to fall behind; otherwise I found it to be a really fair and manageable workload that I got a lot out of.","love slow reading","The course is well-organized and accessible. Whether or not you enjoy early British lit, it is useful context for enjoying more contemporary literature.","For English concentrators, you have to take this course so there's not really a way around that. The highlight of this course was definitely the teaching staff, who were very engaging and really helpful in parsing through this difficult material. I don't love middle english and older works, but I definitely came out with a better appreciation for it.","This course was a good way to fulfill the Arrivals requirement---Brandon is a really engaging lecturer, and Hannah is an awesome TF. The workload is also totally manageable as long as you don't get bogged down in trying to do all the Middle English assignments. You can expect a lot of the reading to be dull, for sure, but that's Arrivals for you. Rite of passage.","Very tough and a lot of dense reading","I would tell future students that the reading is fantastic but to take their time with it to truly enjoy it. I would also tell future students to start essays early so they can grapple with the ideas. I would tell future students that it is really interesting material, that they should talk to Hannah and Brandon about it. Also, that Brandon and Hannah are excellent people and do a very good job with the course. I was not looking forward to the course but ended up truly enjoying it.","this class has its good moments but is definitely not my favorite of the english requirements. brandon and hannah did their best to inspire enthusiasm for the texts but medieval and middle english texts are difficult to learn to like and the amount of reading material that we're expected to complete is too much to be well-covered in class.","The course is a requirement for English concentrators, so if you're not into the material it can be hard to force yourself to read so much of it, but Brandon was a great lecturer and also really accessible outside of lecture. Definitely go to his office hours! My one negative was the section component because it felt a lot like a high school English class in terms of how directed and simplified everything was, but otherwise the material was really interesting, albeit tedious.","Provides a really comprehensive overview to Middle English. This class depends a lot on the professor\/TF; Brandon and Hannah are fantastic.","I loved this course. The texts we read were excellent, and the papers pushed me to consider them in edifying ways.  Class-- both lecture and section-- reinforced the material well and presented features of the works that I didn't get by reading on my own.  The homework load was very manageable, and the exams and papers were graded fairly.  Overall, a must-take.","This class is a relatively painless way to fulfill the Arrivals requirement. Brandon and Hannah are both great and incredibly knowledgeable! Brandon's love for the material is contagious. And you get the opportunity to read some of the best pieces of literature written in the English language. However, the amount of reading is intense. And a good number of the texts are dense and challenging. As long as you have the time to read the texts, the exams and papers are fair. Overall, I'd recommend the course."]}},"mostRecentQ":{"overall":"3.90","workload":"4.50","difficulty":null,"recommendation":"3.70","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}