{"scores":{"Spring '16":{"course_score":{"overall":"4.60","workload":"6.70","difficulty":null,"recommendation":"4.20","enrollment":"11","response rate":"72.73","QCourseOverall":{"number":"AESTHINT 60","course_id":"13854","cat_num":"124798","1s":"0","2s":"0","3s":"0","4s":"3","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"AESTHINT 60","course_id":"13854","cat_num":"124798","1s":"0","2s":"3","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"AESTHINT 60","cat_num":"124798","course_id":"13854","year":"2015","term":"2","id":"73bf491f95e0ac10058e5224877659ba","first":" George","last":"Grabowicz","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '16":{"comments":["A literature seminar masquerading as a ged-ed. The reading list is fantastic, and the professor is very knowledgeable. The course is unorganized and the section component was possibly unnecessary, but overall it was a good experience.","The readings for this course are AMAZING!  And the professor is an extremely interesting individual with a great deal of knowledge about the authors\/written texts\/art work\/films. If you need to fulfill your AIU or just want an engaging and fun literature course, definitely choose this one!","Amazing course! You get what you put in out of it, so both the workload and the reward depends entirely on how much you choose to engage with the texts, secondary sources and in class discussion. Prof Grabowicz will challenge you to deal with the readings but will also guide you to understand them and understand how to read into them. Great overview of the specific authors, of the time period and the region. Most of these are works you would never read otherwise. I highly, highly recommend this course either as a gen ed or an elective (and I'm a life science concentrator with no background in lit).","This class isn't organized very well. All assignments are verbal and vague. You won't get much feedback. The grading definitely isn't tough, but it isn't as easy as you would expect a GenEd to be. Section material is very much dependent on who the TF is; ours covered none of the literature, only art, which wasn't mentioned at all in the syllabus. In-class discussions aren't very interesting; it is typically pretty boring with the professor talking most of the time, and posing questions, waiting a second, rewording, then continuing on having a discussion pretty much with himself.","Take this course if you are interested at all in Eastern Europe before and during the communist era -- it takes you through so many years of history through some of the most incredible art. You will read some books here that you will remember for ever.","Take this course! Probably the best introduction to the subject you'll ever have available to you"]}},"mostRecentQ":{"overall":"4.60","workload":"6.70","difficulty":null,"recommendation":"4.20","enrollment":"11","response rate":"72.73","QCourseOverall":{"number":"AESTHINT 60","course_id":"13854","cat_num":"124798","1s":"0","2s":"0","3s":"0","4s":"3","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"AESTHINT 60","course_id":"13854","cat_num":"124798","1s":"0","2s":"3","3s":"4","4s":"0","5s":"0"}},"success":true}