{"scores":{"Spring '17":{"course_score":{"overall":"4.30","workload":"6.10","difficulty":null,"recommendation":"4.20","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"0","3s":"2","4s":"7","5s":"3"},"QDifficulty":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"2","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"3","2s":"7","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"AFRAMER 191X","cat_num":"127960","course_id":"78","year":"2016","term":"2","id":"daa86c961e899227f7629c43efb263fc","first":" Evelyn Brooks","last":"Higginbotham","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"3.70","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '15":{"course_score":{"overall":"4.10","workload":"3.60","difficulty":null,"recommendation":"4.10","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"0","3s":"2","4s":"7","5s":"3"},"QDifficulty":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"2","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"3","2s":"7","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"AFRAMER 191X","cat_num":"127960","course_id":"78","year":"2014","term":"2","id":"daa86c961e899227f7629c43efb263fc","first":" Evelyn Brooks","last":"Higginbotham","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '13":{"course_score":{"overall":"4.08","workload":"1.92","difficulty":"2.92","recommendation":"4.08","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"0","3s":"2","4s":"7","5s":"3"},"QDifficulty":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"2","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"3","2s":"7","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"AFRAMER 191x","cat_num":"32391","course_id":"78","year":"2012","term":"2","id":"daa86c961e899227f7629c43efb263fc","first":" Evelyn Brooks","last":"Higginbotham","InstructorOverall":"4.08","EffectiveLecturesorPresentations":"4.09","AccessibleOutsideClass":"3.64","GeneratesEnthusiasm":"4.27","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.10"}]},"Spring '12":{"course_score":{"overall":"4.50","workload":"2.00","difficulty":"3.12","recommendation":"4.62","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"0","3s":"2","4s":"7","5s":"3"},"QDifficulty":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"2","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"3","2s":"7","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"AFRAMER 191x","cat_num":"32391","course_id":"78","year":"2011","term":"2","id":"daa86c961e899227f7629c43efb263fc","first":"Evelyn Brooks","last":"Higginbotham","InstructorOverall":"4.88","EffectiveLecturesorPresentations":"4.83","AccessibleOutsideClass":"4.88","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '12":{"comments":["I really enjoyed this class and learning about the brilliant lawyers, judges, and litigants behind the civil rights movement. The reading is not very intense and I found it very enjoyable, be prepared to discuss and think critically in class. Another great thing about the class is that you get to meet some of the authors of the books we read!","Wonderful discussion each week, but the readings are not always fantastic (some biographies are more interesting than others). Definitely take this if you are interested in race and law.","This is a really great option if you're interested in the intersection of African American history and legal issues.","I was inspired every week! Also, Prof. Higginbotham takes you to great events and introduces you to many remarkable people.","Professor Higginbotham is an excellent teacher, and her take on the Civil Rights movement and subsequent jurisprudence is fascinating."]},"Spring '13":{"comments":["You will not only learn about history in this class but also get a great understanding for how the American legal system has developed and continues to function. Even if you don't know anything about law, Professor Higginbotham will help you to develop your analytical thinking and work with you personally on your papers.","If you are interested in the legal arm of the Civil Rights Movement, definitely take this class! The opportunity to interact with Higginbotham in such a small setting is incredible - although she is a bit rigid and old-fashioned in her teaching style (she's not hugely interested in students disagreeing with her and she tends to reward opinions that align with her own), she has a wealth of knowledge on the subject, as well as awesome personal anecdotes about her late husband A. Leon Higginbotham who was a federal judge. The readings are very enjoyable, and the workload is exceedingly manageable (just a blog post each week and then you have to do stuff for your final paper). This class has the potential to be incredibly relevant to real life - for me, while I was taking the class, I was in the midst of applying to jobs to try to be a civil rights paralegal, so it was truly inspiring to get back from an interview and then read the autobiography of civil rights activist Pauli Murray. Deeply enjoyed the class. No hesitation in recommending!","The class is interesting and carries a reasonable work load. The materials are good (though generally not great) reads. Professor Higginbotham is a great teacher for this sort of class, seeing as she has studied and known many of the figures covered. The quality of discussion seems largely dependent on the investment and interests of the class.","great class, should definitely take it","I was actually a little bit disappointed with this class. I was really excited about it until I got in it. I just didn't feel as though I learned that much. I liked the fact that we learned about these lawyers through biography and autobiography, but I felt that the pace of the class was a little bit fast for me and I didn't really have time to digest what I was learning. Prof. Higginbotham is interesting. I'm not really sure how I feel about her even as of yet. She's nice, but likes to name-drop for what seemed to me to be no real reason. If you reach out to her outside of class I'm sure she will be more personable.","It's a great course if you're interested in the subject matter. The readings and assignments are more than reasonable and Professor Higginbotham is an engaging professor.","This is a great course for anyone interested in learning about great African American figures in the legal history of the United States.  While it's easy to cite Brown v. Board and Roe v. Wade, Professor Higginbotham really stressed the fact that every case is the story of a human life.  It was a unique approach on legal studies and I highly recommend it.","This was a great class with rich study materials and a well lead discussion by Professor Higginbotham.","Great opportunity to study with Professor Higginbotham"]},"Spring '15":{"comments":["Prof. Higginbotham's knowledge and experience is invaluable and great to learn from","Lots of reading, but everything you learn is interesting. It's a good elective class if you're ok with reading a biography and supporting articles every week.","This class is absolutely what you put into it. Do the readings because they're usually interesting and inspirational. Use the final project to explore something you're interested in. Prof. Higginbotham is great, and it's wonderful to be able to learn from her in a small setting.","It's an easy class and you learn about some interesting people, but you don't engage with the thinkers at a difficult or high level.  It's too easy to just read a biography instead of really really trying to get into and examine a persons writing","This course is incredible. It provides an exciting and completely one-of-a-kind approach to history, the law, and intersectional African American studies. You will be expected to be on top of the assigned readings - which are not overburdensome and are fascinating. You will be expected to perform when called on - but the result is to get to know an amazing (and, to be honest, pretty big-deal) professor in an intimate setting with really great cohorts, discussing fascinating topics every day.","As long as you have a strong interest in African-American history and civil rights law, you will love this course. Professor Higginbotham is a legend. You will learn more from her than perhaps any other professor at Harvard."]},"Spring '17":{"comments":["Not everyone will like this class, but if you have an interest in law and African American studies you will definitely enjoy it. The discussions are great, and Professor Higginbotham is an amazing, thoughtful professor and is super accessible for feedback and support. Pretty decent amount of reading but very manageable workload when it comes to assignments.","Don't pass up a chance to take a class with Professor Higginbotham! She is a gem of a professor and such a kind, knowledgeable person. The class engages with a variety of examples using many interesting books.","This class is good if you wish to learn in a small setting with a professor who genuinely wants to engage with you. It's probably not the best class if you don't like speaking up, or if you don't like having your ideas challenged by your peers and\/or professor.","This class is excellent. Do not miss a chance to take a class with Professor Higginbotham!","I absolutely love Professor Higginbotham and the syllabus she curated. You will get the most out of the class if you have a background in historical writing. Otherwise, you will feel lost in a course of graduate students and knowledgeable upperclassmen. Start the final paper early.","This is the kind of class that you come to Harvard to take. It will kick your butt, and it may be the hardest class you take at Harvard, but it teaches you loads. Be prepared to dedicate most of your time to this class. Be prepared to feel like the dumbest person in the class. But take it, because Higginbotham is incredibly smart (albeit intimidating) and experienced, and, though she will expect a lot out of you, (she will hold you to the same standards as she holds actual lawyers) you will work hard and learn about important cases that shaped American Civil Rights history."]}},"mostRecentQ":{"overall":"4.30","workload":"6.10","difficulty":null,"recommendation":"4.20","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"0","3s":"2","4s":"7","5s":"3"},"QDifficulty":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"0","2s":"2","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"AFRAMER 191x","course_id":"78","cat_num":"32391","1s":"3","2s":"7","3s":"2","4s":"0","5s":"0"}},"success":true}