{"scores":{"Spring '16":{"course_score":{"overall":"4.00","workload":"3.70","difficulty":null,"recommendation":"4.10","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"ANTHRO 1870","course_id":"13950","cat_num":"161266","1s":"0","2s":"1","3s":"1","4s":"4","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ANTHRO 1870","course_id":"13950","cat_num":"161266","1s":"2","2s":"8","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1870","cat_num":"161266","course_id":"13950","year":"2015","term":"2","id":"98057b406144bb9b922c06fffaa2440a","first":" Sharon Freda","last":"Kivenko","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"2.60"}]}},"comments":{"Spring '16":{"comments":["What you get out of this course highly depends on what you put into it! You'll learn how dance applies to many different fields that you would not otherwise expect. It exemplifies the spirit of a liberal arts education because we take on a truly interdisciplinary lens. Everyone can have something to contribute.","Take this class. Professor Kivenki is amazing and the class provides an excellent foundation into Anthropological, particularly, ethnographic studies.","Really great in class discussions. Topics come together nicely. Get to move in class and also discuss things.","Although slightly unorganized, this course is very interesting and will make you think outside of the box.","This class is a remarkable combination of dance and social theory that is both invigorating and enriching.","This class is a rare gem that you do not want to miss. It combines traditional classroom activities with movement activities for a unique learning experience.  The workshops were fantastic, and the final project was a fun and engaging way to finish off the course.","Hard to do well on assignments because you never know exactly what the prof is looking for and sometimes gives conflicting directions regarding assignments","It is really what you make of it. I had an incredible experience and look at the body and role of performance cross-culturally in a completely new light.","This course challenges you to learn physically as well as mentally. As a non-artistic person, the assignments and in-class movement workshops allowed me to become more comfortable with myself and more open to new kinds of learning that I had not experienced at Harvard."]}},"mostRecentQ":{"overall":"4.00","workload":"3.70","difficulty":null,"recommendation":"4.10","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"ANTHRO 1870","course_id":"13950","cat_num":"161266","1s":"0","2s":"1","3s":"1","4s":"4","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ANTHRO 1870","course_id":"13950","cat_num":"161266","1s":"2","2s":"8","3s":"0","4s":"0","5s":"0"}},"success":true}