{"scores":{"Fall '15":{"course_score":{"overall":"4.10","workload":"4.20","difficulty":null,"recommendation":"4.20","enrollment":"20","response rate":"95.00","QCourseOverall":{"number":"ANTHRO 1401","course_id":"13019","cat_num":"160434","1s":"1","2s":"0","3s":"2","4s":"10","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ANTHRO 1401","course_id":"13019","cat_num":"160434","1s":"4","2s":"12","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1401","cat_num":"160434","course_id":"13019","year":"2015","term":"1","id":"3c83ccd0120f2715a22ecff5ee871f82","first":" David","last":"Carrasco","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Fall '15":{"comments":["Professor Carrasco is very enthusiastic and has boundless energy. This class is disorganized.","This year the class was very poorly organized and I did not feel like I gained much from it,","This class asks a lot of you in a way that perhaps it does not think it does. First, if you are an undergrad you will be placed in a class full of graduate div school students who will share a whole other side of the world that only older people can share with younger people. Second, many of the books you will be reading have to do with race and the Latino immigrant in the United States. In-section discussions will force you to think about your roll in these discussions and if you are me, rethink your racial background. Finally, you will see the human side of immigration (not much the economic or policy side) and learn that immigrants only immigrate because they have to.","Amazing readings and discussions facilitated by Carrassco and people within the class. This class allows the individual to dig deeper into their own lives in tandem with academia.","This was a very enlightening course and you learn a lot from student experiences. It felt like a very safe space for deep and honest discussion. It was also a very relevant course given the topic, and I enjoyed the guest lecturers.  However it was often frustrating how disorganized the course was, and because there was only one final paper, there was no accountability during the semester.","You learn so much about immigration to the US and read lots of interesting work and are given several different analytical lenses to think about our work","This course's strength was its amazing ability to cater to the individual interests of each student. It was a mid-sized class, but the teaching staff was nonetheless paid attention to each student. The teaching staff held students to high standards and believed that every student could greatly contribute to the discussion on immigration. This is a great class taught by someone who is passionate.","You get out as much as you put in in this class. Profe Carrasco brings in really cool speakers which is great because you get to learn from more than a few experts in their fields.","If you do the readings and truly engage with the final project, this course will push you to become a more aware global citizen. Professor Carrasco is very enthusiastic and responsive to student needs. He wants to meet with all students and help them to the best of his ability. He is a very knowledgeable and fair professor.","The course material is great and the topic is well-covered, but organization is tough and the class decomposed a little bit toward the end because of it.  That said, the discussions within the course were really deep and well-informed and, overall, productive."]}},"mostRecentQ":{"overall":"4.10","workload":"4.20","difficulty":null,"recommendation":"4.20","enrollment":"20","response rate":"95.00","QCourseOverall":{"number":"ANTHRO 1401","course_id":"13019","cat_num":"160434","1s":"1","2s":"0","3s":"2","4s":"10","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ANTHRO 1401","course_id":"13019","cat_num":"160434","1s":"4","2s":"12","3s":"3","4s":"0","5s":"0"}},"success":true}