{"scores":{"Spring '15":{"course_score":{"overall":"4.30","workload":"3.30","difficulty":null,"recommendation":"4.70","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"ANTHRO 1650","course_id":"12785","cat_num":"156636","1s":"0","2s":"1","3s":"2","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ANTHRO 1650","course_id":"12785","cat_num":"156636","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1650","cat_num":"156636","course_id":"12785","year":"2014","term":"2","id":"90c5bbbe134ef8daa2d63d52730f6d4b","first":" David R.","last":"Odo","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '15":{"comments":["I would definitely take this class, especially if you are interested in contemporary art or museums in general. The discussions are interesting, and the professor is really interesting and fun to talk to. You will also learn a lot about how contemporary artists compose their projects.","If you really like museums, artifacts, art, artists, and learning new things you may not be able to learn anywhere else on these topics, take the course! You will really enjoy it and get a lot out of it. Of course, it does take a lot of work and maybe a week and a half of serious research to develop the final paper, but this process contributes to the learning. \r\n\r\nReally fun course, great professor, and great experiences (working in material lab with plaster and other sculpting materials, viewing art in the art study center, exploring Harvard's museums, curating a final art project as a class in the digital art gallery). Take it if you're interested.","This class is a wonderful way to learn more about museums by studying objects and looking behind the scenes to discover how pieces are stored and displays are created.  If you are interested in the subject the papers will be enjoyable to write because they allow you to profile different objects and museum spaces.  I recommend the class to anyone interested in seriously studying Harvard's collection resources, and especially to those who are considering working in museums or similar settings.","This is a chance to talk about art even if you have no experience studying it.  You begin thinking about the objects around you in new ways, and we got to meet fantastic artists and have fascinating conversations with them about research and artwork."]}},"mostRecentQ":{"overall":"4.30","workload":"3.30","difficulty":null,"recommendation":"4.70","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"ANTHRO 1650","course_id":"12785","cat_num":"156636","1s":"0","2s":"1","3s":"2","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ANTHRO 1650","course_id":"12785","cat_num":"156636","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}},"success":true}