{"scores":{"Fall '14":{"course_score":{"overall":"4.50","workload":"6.40","difficulty":null,"recommendation":"4.60","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"ANTHRO 1988","course_id":"12224","cat_num":"17287","1s":"0","2s":"0","3s":"0","4s":"6","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ANTHRO 1988","course_id":"12224","cat_num":"17287","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1988","cat_num":"17287","course_id":"12224","year":"2014","term":"1","id":"2cf43a9aef6646796191931c33e16cba","first":" George Paul","last":"Meiu","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Fall '14":{"comments":["Interesting sections and a fascinating, intelligent professor.","This class is a lot of work - be prepared for theoretical heavy-lifting and to either sink or swim every class. But throw yourself in -- the water is warm, and fascinating!!!","I have already recommended it to several people with a lot of enthusiasm!","Read the readings, write quickly in class, go in for questions at office hours.","This course is a great way to expand your knowledge about kinship and improve your background in feminist, Marxist, and queer theory. The theory can be quite dense, so you should be prepared for a few difficult readings.  The professor does a good job explaining the material.","This course is an excellent introduction to theories of kinship, which Professor Meiu also ties into citizenship very effectively. This course provides connections to a host of older literature, but then moves forward to consider the ways in which kinship is highly relevant to students interested in colonialism, nationalism, issues of citizenship, migration, and the state. It's also an excellent introduction into anthropology, since discussions range over methodology and the ethics of anthropology as well.","This is one of the best courses I've taken at Harvard. Professor Meiu is fantastic and fascinating (go to his office hours!) and leads the class energetically and skillfully. The content is great, and makes you re-think not only the way you understand kinship, but also all sorts of facets of human interaction and identity-formation. \n\nI think it might be a bit harder for a first-year or someone with no social sciences background at all to access the content and discussion, but that's not to say that this would be impossible, if that person was really interested in the material--Professor Meiu was careful to give background and context for everything that we read and it made the content much more accessible than it would be elsewhere.","This course will inform students about the formation of societies. Its a perfect introduction to Anthropology studies","Take the class, but it might be useful to be familiar with well-known anthropologists."]}},"mostRecentQ":{"overall":"4.50","workload":"6.40","difficulty":null,"recommendation":"4.60","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"ANTHRO 1988","course_id":"12224","cat_num":"17287","1s":"0","2s":"0","3s":"0","4s":"6","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ANTHRO 1988","course_id":"12224","cat_num":"17287","1s":"0","2s":"7","3s":"5","4s":"0","5s":"0"}},"success":true}