{"scores":{"Fall '10":{"course_score":{"overall":"3.85","workload":"2.00","difficulty":"2.46","recommendation":"4.00","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"ANTHRO 1085","course_id":"128","cat_num":"2318","1s":"0","2s":"0","3s":"5","4s":"5","5s":"3"},"QDifficulty":{"number":"ANTHRO 1085","course_id":"128","cat_num":"2318","1s":"1","2s":"5","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"ANTHRO 1085","course_id":"128","cat_num":"2318","1s":"2","2s":"9","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1085","cat_num":"2318","course_id":"128","year":"2010","term":"1","id":"d16c98e30644609dd8f6453c1d10b259","first":"Jeffrey","last":"Quilter","InstructorOverall":"4.46","EffectiveLecturesorPresentations":"4.38","AccessibleOutsideClass":"4.46","GeneratesEnthusiasm":"4.69","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '08":{"course_score":{"overall":"4.12","workload":"1.88","difficulty":"3.00","recommendation":"4.25","enrollment":"12","response rate":"66.67","QCourseOverall":{"number":"ANTHRO 1085","course_id":"128","cat_num":"2318","1s":"0","2s":"0","3s":"5","4s":"5","5s":"3"},"QDifficulty":{"number":"ANTHRO 1085","course_id":"128","cat_num":"2318","1s":"1","2s":"5","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"ANTHRO 1085","course_id":"128","cat_num":"2318","1s":"2","2s":"9","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1085","cat_num":"2318","course_id":"128","year":"2007","term":"2","id":"d16c98e30644609dd8f6453c1d10b259","first":"Jeffrey","last":"Quilter","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.38","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.62","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"3.60"}]}},"comments":{"Spring '08":{"comments":["DO YOUR READING.  Pay attention, don't fall asleep during the powerpoints, ask questions, get into what you're learning!  This is definitely one of those classes where you get what you give.  If you throw yourself into the material, which is already totally wonderful, you'll get a lot out of the class.  Make connections to today.","This is the best class I've ever taken at Harvard.","Professor Quilter is GREAT, and the subject matter is amazing. Stay on top of the readings, though!","This class is an adventure and it is about stuff that every good American citizen should know about the past history of the continent","It is interesting, not very difficult and does not involve a great deal of work. It was not structured enough though and is relies heavily on the individual (more so than most classes at Harvard). Unless one forces oneself to stay on top of the reading and lectures, it can be daunting and one can get lost in the material. Only take the course if you are a genuinely self-motivated person and are driven by a genuine interest in the subject matter.","fair class, really interesting material, great professor, minimal work"]},"Fall '10":{"comments":["It is an interesting class, but it is probably not the best thing to take if you have no interest in archaeology. If you have not taken an archaeology class before, you certainly can still take this class, but you may get more out of another archaeology survey course that teaches more theory, etc.","This course is an excellent survey course that introduces you to the methods and frameworks used in archaeology while learning about awesome sites in North America, Central America and South America.","This is a very interesting class. Prof. Quilter is extremely knowledgeable and very willing to help out his students. Fun class!","The class subject is interesting and could be great if there was more organization and structure.  Also, the section component either needs to be cut completely or at least taken seriously by the TF.  However, the tours of the museum and its facilities are cool.","Interesting materials, but sections were rather pointless","If you are interested in archaeology you will love this class.  Professor Quilter does a great job of offering interesting ways of approaching problems and he is fun to listen to as well.","An excellent opportunity to see and benefit from the Peabody Museum. A great introduction to anthropological \/ archaeological study and it is great for people from the US to take the class and see the incredible cultures that lived here in the past that you just don't learn about. A chill class - as in many courses you get out of it what you put in so take advantage of the resources available to you. The professor is a fun lecturer as well."]}},"mostRecentQ":{"overall":"3.85","workload":"2.00","difficulty":"2.46","recommendation":"4.00","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"ANTHRO 1085","course_id":"128","cat_num":"2318","1s":"0","2s":"0","3s":"5","4s":"5","5s":"3"},"QDifficulty":{"number":"ANTHRO 1085","course_id":"128","cat_num":"2318","1s":"1","2s":"5","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"ANTHRO 1085","course_id":"128","cat_num":"2318","1s":"2","2s":"9","3s":"2","4s":"0","5s":"0"}},"success":true}