{"scores":{"Spring '13":{"course_score":{"overall":"4.00","workload":"1.79","difficulty":"2.47","recommendation":"4.11","enrollment":"20","response rate":"100.00","QCourseOverall":{"number":"ANTHRO 1808","course_id":"5251","cat_num":"48657","1s":"0","2s":"1","3s":"6","4s":"5","5s":"8"},"QDifficulty":{"number":"ANTHRO 1808","course_id":"5251","cat_num":"48657","1s":"0","2s":"10","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"ANTHRO 1808","course_id":"5251","cat_num":"48657","1s":"7","2s":"9","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1808","cat_num":"48657","course_id":"5251","year":"2012","term":"2","id":"2508786090d0435bfcdfedf5317b276f","first":" Andrea Elizabeth","last":"Murray","InstructorOverall":"4.06","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.44","GeneratesEnthusiasm":"4.33","FacilitatesDiscussionEncouragesParticipation":"4.12","GivesUsefulFeedback":"3.77","ReturnsAssignmentsinTimelyFashion":"3.62"}]}},"comments":{"Spring '13":{"comments":["As someone who has no background in anthropology, I can say this was a really great class. Andrea is a great professor and makes all the aspects and locations of tourism that you look at very interesting","This was the most enjoyable class I have ever taken at Harvard.","A very relaxed course with an upbeat and passionate professor. A seemingly random topic turns into something interesting and extremely relevant for the modern student.","I've really enjoyed this class because it allowed me to pursue research in my interest area in a very structured forum. Prof Murray is a great educator - she's sharp and engaging. She presents materials in a way that is very approachable (no matter what your background is) and is generous with her time and advising.","Great class with a new, refreshing topic. Changes the way you think about tourism and travel. It was a lot of reading, but I really enjoyed the class.","Very much Japan-focused--would have more appreciated balance between China, Japan, and Korea. Some readings are boring, others are ok. The discussions in class and section could also have been better, had the class been more structured. However, I am walking out of the course with some knowledge in tourism and I assure you--you would no longer be able to tour around different parts of the world without thinking about this class.","If you are interested in tourism and its implications from an anthropological point of view, as well as in complicated words, then you'll love this course.","Very interesting to examine your own travel and how it impacts others","A great class. Dr. Murray is a brilliant and humble professor and cares about her students more than any other professor I've seen her. The classroom environment is so beautiful and amazing."]}},"mostRecentQ":{"overall":"4.00","workload":"1.79","difficulty":"2.47","recommendation":"4.11","enrollment":"20","response rate":"100.00","QCourseOverall":{"number":"ANTHRO 1808","course_id":"5251","cat_num":"48657","1s":"0","2s":"1","3s":"6","4s":"5","5s":"8"},"QDifficulty":{"number":"ANTHRO 1808","course_id":"5251","cat_num":"48657","1s":"0","2s":"10","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"ANTHRO 1808","course_id":"5251","cat_num":"48657","1s":"7","2s":"9","3s":"3","4s":"0","5s":"0"}},"success":true}