{"scores":{"Fall '14":{"course_score":{"overall":"4.10","workload":"2.80","difficulty":null,"recommendation":"4.40","enrollment":"17","response rate":"58.82","QCourseOverall":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"0","2s":"0","3s":"3","4s":"3","5s":"4"},"QDifficulty":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"5","2s":"21","3s":"10","4s":"1","5s":"0"},"QWorkload":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"5","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CELTIC 114","cat_num":"0781","course_id":"440","year":"2014","term":"1","id":"6fad88adea9109ffd34edb0c6b7879a8","first":" Tomas","last":"O Cathasaigh","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Spring '13":{"course_score":{"overall":"3.97","workload":"1.43","difficulty":"2.19","recommendation":"4.05","enrollment":"46","response rate":"80.43","QCourseOverall":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"0","2s":"0","3s":"3","4s":"3","5s":"4"},"QDifficulty":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"5","2s":"21","3s":"10","4s":"1","5s":"0"},"QWorkload":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"5","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CELTIC 114","cat_num":"0781","course_id":"440","year":"2012","term":"2","id":"6fad88adea9109ffd34edb0c6b7879a8","first":" Tomas","last":"O Cathasaigh","InstructorOverall":"4.17","EffectiveLecturesorPresentations":"4.11","AccessibleOutsideClass":"4.06","GeneratesEnthusiasm":"4.16","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.86","ReturnsAssignmentsinTimelyFashion":"4.25"}]},"Spring '11":{"course_score":{"overall":"4.23","workload":"1.38","difficulty":"2.31","recommendation":"4.31","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"0","2s":"0","3s":"3","4s":"3","5s":"4"},"QDifficulty":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"5","2s":"21","3s":"10","4s":"1","5s":"0"},"QWorkload":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"5","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CELTIC 114","cat_num":"0781","course_id":"440","year":"2010","term":"2","id":"6fad88adea9109ffd34edb0c6b7879a8","first":"Tomas","last":"O Cathasaigh","InstructorOverall":"4.54","EffectiveLecturesorPresentations":"4.38","AccessibleOutsideClass":"4.46","GeneratesEnthusiasm":"4.77","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.40"}]}},"comments":{"Spring '11":{"comments":["This was one of the best courses I've taken in my 3 years here.  It was so much fun!  I learned so much despite the fact that the reading is pretty light, and of course, the more time you put in, the more you get out of it.  Going to class is very enjoyable, and the readings are short and interesting.  I would absolutely take this course as a fun elective.  Most people would never take a class in this area, so it will really broaden your horizons!  When I first looked at the syllabus, I thought I might be bored of the material after awhile, but I was fascinated all semester, so don't let the specific topic scare you away.  The material is something you can't get anywhere else, considering many of our readings were unpublished translations of Irish stories.","This class is terrific for learning about a very specific piece of history. But beyond that it is useful to see the relationship between history and oral tradition, the tales of Irish cultures.","Excellent class. I had no previous knowledge or experience in the topic or area of study. As a senior, I wanted to try something different. Professor O Cathasaigh was welcoming and made the topic enjoyable. If you are interested in the topic, or even think you may be, I would suggest taking this class. The readings are short enough and the requirements are straightforward.","Sometimes lectures were difficult to stay awake through, but Professor O Cathasaigh is wonderfully Irish.","A great class, An easy course where you learn a alot about something different."]},"Spring '13":{"comments":["The teaching staff delivers incredible material in a great atmosphere with a very modest course load. This class is a must take.","This was a great class! It's a very interesting topic, and all the work was very manageable!","This course was wonderful. Professor O Cathasaigh is one of the most prominent historians of this subject matter and really knows his stuff. Lectures were enjoyable as he often jokes about things that come up in the story. I would recommend this class with enthusiasm for anyone.","It's fun and something you won't get anywhere else","It is a fantastic introduction not only to the stories of early Ireland, but also to early Irish culture. It's also interesting in terms of understanding more about symbolism and literary devices through the tales.","Going to section is essential because it's all about clarifying confusing elements. Assignments are fair and given back on time. The course really gives you a feel for the times!","This is an easy class but lectures are pretty boring and mandatory so if you can make it through lecture you are all good.","great","When taking this class, be wary of high enrolment, especially if a personal approach is important to you. Otherwise it is a great class due to the professor's great experience, insight and expertise.","Unbelievable class. Great senior spring class. Not a lot of work and the material is amazing.","The professor is great. The stories can get a little boring, but the workload isn't too bad. Pretty solid elective","Good elective because it's different.","The stories are great and the work is really manageable","Easy workload.  The TF is amazing and super chill.  The professor is extremely sweet.","This is a great class to take senior year. The material is interesting if you pay attention but it is also flexible enough to catch up if you fall behind because of thesis, etc. Make sure to get to know Tomas! He is a great professor"]},"Fall '14":{"comments":["This class is interesting and very manageable if you are engaged during lectures.","This is a great class. You can can gain knowledge on an interesting an unfamiliar culture. Because the workload is not bad, all the assigned work is manageable and can actually get done, leading to better learning.","This is a great class to broaden your horizons on a subject you would not have otherwise.","Professor O is great.","This is a great course! The workload is very manageable, as long as you keep up with the readings and attend lecture.  In addition, the readings are very interesting, so the work is enjoyable.  I would recommend this course to someone who has an interest in Irish history and culture or in folklore\/mythology in general.","Good intro Celtic class.  Not much concrete Irish history here, unfortunately, mostly folklore.   Although that is the name of the class.","This class has you read a lot of great stories and can be very interesting at times. Professor O Cathasaigh is a nice, but his lectures can seem a bit long at times. Do try to do all the readings as there isn't much, and it's easy to catch up if you fall behind one week. The stories are pure gold and really fun to chat with people not in the class about."]}},"mostRecentQ":{"overall":"4.10","workload":"2.80","difficulty":null,"recommendation":"4.40","enrollment":"17","response rate":"58.82","QCourseOverall":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"0","2s":"0","3s":"3","4s":"3","5s":"4"},"QDifficulty":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"5","2s":"21","3s":"10","4s":"1","5s":"0"},"QWorkload":{"number":"CELTIC 114","course_id":"440","cat_num":"0781","1s":"5","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}