{"scores":{"Spring '16":{"course_score":{"overall":"4.50","workload":"3.50","difficulty":null,"recommendation":"4.40","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"CLASARCH 101","course_id":"4960","cat_num":"108693","1s":"0","2s":"0","3s":"1","4s":"2","5s":"5"},"QDifficulty":{"number":"CLASARCH 101","course_id":"4960","cat_num":"50105","1s":"1","2s":"2","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"CLASARCH 101","course_id":"4960","cat_num":"108693","1s":"1","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CLASARCH 101","cat_num":"108693","course_id":"4960","year":"2015","term":"2","id":"da9f906e413b8a91cfae6b1baf589069","first":" Adrian","last":"Staehli","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Fall '13":{"course_score":{"overall":"4.80","workload":"1.90","difficulty":"2.50","recommendation":"4.80","enrollment":"11","response rate":"72.73","QCourseOverall":{"number":"CLASARCH 101","course_id":"4960","cat_num":"108693","1s":"0","2s":"0","3s":"1","4s":"2","5s":"5"},"QDifficulty":{"number":"CLASARCH 101","course_id":"4960","cat_num":"50105","1s":"1","2s":"2","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"CLASARCH 101","course_id":"4960","cat_num":"108693","1s":"1","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CLASARCH 101","cat_num":"50105","course_id":"4960","year":"2013","term":"1","id":"da9f906e413b8a91cfae6b1baf589069","first":" Adrian","last":"Staehli","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '13":{"comments":["This class is a really great introduction into Roman art, architecture, and archaeology. You don't need to have a background in classics, but make sure you're interested in art or you might find the class a bit slow. But Staehli is great and really enthusiastic!","The class is standard in format and workload, and provides a broad survey of Roman archaeology from the republic to the late empire.","Professor Staehli really cares about his students and will give great feedback. Coming in with little to no knowledge on the material is no problem - there were grad students in the course, but Professor did a great job of teaching at a pace and depth comfortable and interesting for everyone. If you are interested in the subject, definitely take this!","Take any classes that Professor Staehli offers. Amazing class with an amazing professor and very manageable workload, you will benefit from this class so much.","Professor  Staehli is great!"]},"Spring '16":{"comments":["Interesting class taught by a great professor","This course was really interesting and using archaeology to understand history was completely new to me. Professor Stahli is very enthusiastic about the material and he is very friendly during office hours. I learned a lot about history and I had so much fun looking at ancient art and architecture! I highly recommend this course if you have any interest in Roman history or art.","Professor Staehli really knows the material -- he can give you the in's and out's of everything that you will look at in class, which is impressive and very helpful later when you are working on your presentations and papers. He is good about providing sources and all the readings for you online. Lectures consist of power points with images and Professor Staehli talking, so don't really expect big group discussions. The workload is pretty light, especially if you have had art history or any Classical background. For those with this background, the class can be a little mundane or repetitive.","This is an excellent class with an enthusiastic professor that will make you want to visit Roman and continue to study archaeology.","Take this course! Professor Staehli is an excellent lecturer, gives thorough feedback on assignments, and is welcoming and available for extra questions or discussion during office hours.","Class: boring at times, but you can't have computers and such out so you are forced to pay attention and do well\r\nQuizzes: easy enough if you pay attention, but sometimes graded arbitrarily, but assessed on a pass fail basis, I guess...\r\nPresentation: requires a high level of archaeology research, but lots of guidance available and at the end of the day it is just a presentation\r\nPaper:"]}},"mostRecentQ":{"overall":"4.50","workload":"3.50","difficulty":null,"recommendation":"4.40","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"CLASARCH 101","course_id":"4960","cat_num":"108693","1s":"0","2s":"0","3s":"1","4s":"2","5s":"5"},"QDifficulty":{"number":"CLASARCH 101","course_id":"4960","cat_num":"50105","1s":"1","2s":"2","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"CLASARCH 101","course_id":"4960","cat_num":"108693","1s":"1","2s":"7","3s":"0","4s":"0","5s":"0"}},"success":true}