{"scores":{"Spring '12":{"course_score":{"overall":"3.60","workload":"3.00","difficulty":"3.80","recommendation":"3.80","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"COMPLIT 276","course_id":"573","cat_num":"2534","1s":"1","2s":"0","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"COMPLIT 276","course_id":"573","cat_num":"2534","1s":"0","2s":"0","3s":"1","4s":"4","5s":"0"},"QWorkload":{"number":"COMPLIT 276","course_id":"573","cat_num":"2534","1s":"0","2s":"1","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"COMPLIT 276","cat_num":"2534","course_id":"573","year":"2011","term":"2","id":"0b2df11a9a4ae6ce16880555cdd02c03","first":"Christopher D.","last":"Johnson","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.40","FacilitatesDiscussionEncouragesParticipation":"3.40","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.40"}]}},"comments":{"Spring '12":{"comments":["The class is difficult in that there is a lot of reading and much of the critical reading is extremely dense--huge ideas will be presented in a very short space. It's difficult to keep them all in your head, and it takes time to think through and process them. \r\nThat being said, no class I've taken has ever been more worth the work. No class has ever given me a better sense of the what the literary Renaissance was about and what important questions it involved, or made those questions more exciting or more urgent. For students who do not study the Renaissance, the benefits extend to literature in general--studying the rhetorical tradition gives you a whole new set of analytical tools and critical questions to apply to any body of work. It even makes you think about your own writing differently, how to structure papers and arguments and how to adapt style to content. And for any of these questions which you find especially interesting, Professor Johnson provides the resources to pursue them much further. \r\nI think many students were scared off initially by the foreign languages, but you shouldn't be. Professor Johnson did provide texts in the original languages, as a Comp Lit class should, but also made it very manageable for students without certain languages, made an active effort every class to draw on everyone's individual strengths in a beautifully respectful way, which I appreciated.","The class requires a lot of time dedicated to readings, but it is very rewarding.","This course was extremely eye-opening for me.  As a literature student with a background in English, I had very little exposure to classical rhetoric and to Renaissance culture in general, especially outside of England.  Therefore I benefited tremendously from the wide and varied readings.  However this is not for everyone, and if you know you would be made crazy by such a loose\/ open approach, you should shop the class first.  It is too much work to do if you don't enjoy and learn from this kind of broad\/ conceptual thinking."]}},"mostRecentQ":{"overall":"3.60","workload":"3.00","difficulty":"3.80","recommendation":"3.80","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"COMPLIT 276","course_id":"573","cat_num":"2534","1s":"1","2s":"0","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"COMPLIT 276","course_id":"573","cat_num":"2534","1s":"0","2s":"0","3s":"1","4s":"4","5s":"0"},"QWorkload":{"number":"COMPLIT 276","course_id":"573","cat_num":"2534","1s":"0","2s":"1","3s":"3","4s":"1","5s":"0"}},"success":true}