{"scores":{"Spring '16":{"course_score":{"overall":"4.20","workload":"4.00","difficulty":null,"recommendation":"3.80","enrollment":"10","response rate":"60.00","QCourseOverall":{"number":"COMPLIT 120","course_id":"13464","cat_num":"139362","1s":"0","2s":"0","3s":"1","4s":"3","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"COMPLIT 120","course_id":"13464","cat_num":"139362","1s":"1","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"COMPLIT 120","cat_num":"139362","course_id":"13464","year":"2015","term":"2","id":"b48b1fd62ccc1d698d2d9a004a952b4d","first":" Cecile","last":"Guedon","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"3.60"}]}},"comments":{"Spring '16":{"comments":["This class is amazing! Cecile is so awesome - she's super enthusiastic, nice, and energetic. The readings are interesting but not too long, and the class really doesn't incorporate a lot of theory, which makes it accessible to non comp lit concentrators. Definitely recommend!","While the reading list for this course is great and the fact that it is a seminar is also good, the themes of the course are extremely scattershot and and rarely form a cohesive whole. So while I thought a lot about the course was interesting, I can't say I learned that much.","Cecile is a joyful, kind, and warm person. The class is quite odd - prepare to read boggling poems and quirky texts without much narrative - but this adds to its charm. I enjoyed coming to class each day and having immersive and lively discussions about the silliest things. Potentially the best part of the course was how we met for two hours on Tuesday nights to watch super old French films, play narrative video games, listen to world famous jazz musicians speak about improvisation, and visit the Peabody's archives of ancient games. I took this class as a senior spring elective, and I don't regret it. It could get on my nerves, but it also put a smile on my face.","Super fun course, great intro to some classic or fun novels, sweet professor. Low-Medium workload if you plan ahead, moderate time requirement. You do need to think through some weird themes, but the best thing to do is get to know the prof and what she is looking for, and save your random responses for the weekly posts."]}},"mostRecentQ":{"overall":"4.20","workload":"4.00","difficulty":null,"recommendation":"3.80","enrollment":"10","response rate":"60.00","QCourseOverall":{"number":"COMPLIT 120","course_id":"13464","cat_num":"139362","1s":"0","2s":"0","3s":"1","4s":"3","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"COMPLIT 120","course_id":"13464","cat_num":"139362","1s":"1","2s":"5","3s":"0","4s":"0","5s":"0"}},"success":true}