{"scores":{"Spring '13":{"course_score":{"overall":"4.60","workload":"1.60","difficulty":"2.10","recommendation":"4.70","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"DRAMA 166x","course_id":"659","cat_num":"48523","1s":"0","2s":"0","3s":"0","4s":"4","5s":"6"},"QDifficulty":{"number":"DRAMA 166x","course_id":"659","cat_num":"48523","1s":"1","2s":"7","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"DRAMA 166x","course_id":"659","cat_num":"48523","1s":"5","2s":"4","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"DRAMA 166x","cat_num":"48523","course_id":"659","year":"2012","term":"2","id":"549d028c13960f679358ef376f90b7c1","first":" Molly B.","last":"Pearson","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.44","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Spring '13":{"comments":["This is an amazing course, though I have no idea if it will be taught here again. Molly Pearson is an amazing, helpful, established mentor and I am so glad I got to learn from her. This course demystified what Producing Theatre is, and has made me really think about my career goals.","This is a really fascinating class that helps you to learn what is necessary to produce your own production!","Molly has real world insight into theater production and there's a lot to be learned from her anecdotes and from the semester long project. Even if you don't plan on actually producing your show in reality the exercise in developing a large scale project, even theoretically, can give you some greats skills.","This class provided an excellent introduction to producing professional work and working within a theater company.  The class centers around one project, so if you don't find something that you're passionate about producing, it will be rough.  Assignments are pretty easy and fun but they can pile up fast if you don't stay on top of things.","The course provides you with a great introduction to the many different facets of producing and Molly is an enthusiastic instructor who has a wealth of knowledge and personal stories from her own experience. Workload is very manageable and the class is stress-free.","Great course. More practical than any class I've taken at Harvard. You'll leave the semester with enough information to actually produce a show! Molly is fantastic.","Molly is such a jewel of a resource for students who have career aspirations in the arts. Her breadth of experience with film, theater, music, etc. was really helpful for all of us. She is insanely kind, accessible, helpful, sharp, perceptive, and creative. I feel very empowered coming out of this class in my hopes of continuing to create new work in the theater world in the future.","Despite some of the flaws in the class (i.e., lack of interaction among students), I would highly recommend this class. There is no other class like this one at Harvard. My learning about play producing was greatly enhanced."]}},"mostRecentQ":{"overall":"4.60","workload":"1.60","difficulty":"2.10","recommendation":"4.70","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"DRAMA 166x","course_id":"659","cat_num":"48523","1s":"0","2s":"0","3s":"0","4s":"4","5s":"6"},"QDifficulty":{"number":"DRAMA 166x","course_id":"659","cat_num":"48523","1s":"1","2s":"7","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"DRAMA 166x","course_id":"659","cat_num":"48523","1s":"5","2s":"4","3s":"1","4s":"0","5s":"0"}},"success":true}