{"scores":{"Fall '14":{"course_score":{"overall":"4.80","workload":"7.00","difficulty":null,"recommendation":"4.80","enrollment":"7","response rate":"57.14","QCourseOverall":{"number":"DRAMA 172x","course_id":"12250","cat_num":"74502","1s":"0","2s":"0","3s":"0","4s":"1","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"DRAMA 172x","course_id":"12250","cat_num":"74502","1s":"0","2s":"2","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"DRAMA 172x","cat_num":"74502","course_id":"12250","year":"2014","term":"1","id":"69aea30c4219a12d6f31e055014bb86b","first":" Claire A.","last":"Conceison","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '14":{"comments":["Claire has had so many interesting stories accrued throughout her career as an academic and professor. She loves what she studies, teaching, and her students-- a very rare combination for an instructor! Definitely start your papers early and ask her for guidance. She's very busy but answers her email very quickly. It's also good to go into the papers with a well-formulated question on your own, as I felt like she didn't provide a lot of direction in that area.","This course is absolutely amazing, and Professor Conceison is such a vibrant, wonderful teacher who has so much firsthand knowledge of the subject, having studied it in China with some of the most important figures in Chinese theater today and has written and studied so much about it. You cannot miss the chance to take a course with her; you will learn so much and will come out of it with a new perspective on drama and a deeper understanding of literature, theater, and Chinese society. This class is challenging in the sense that you will learn a lot and the subject may be pretty new to you, but it is still accessible and really interesting - which is in my opinion the perfect kind of challenging. The plays are sometimes hilarious, and sometimes heartbreaking, and through reading them, discussing them as a group over snacks, reading literary criticism, watching them, getting to ask questions of the playwrights themselves(!), and performing them with each other, you will understand them more deeply than you ever thought possible but will still realize you have so much more to learn. This was the most interesting class I ever took at Harvard, and I am so glad I made the decision to take it. YOU MUST TAKE THIS CLASS. I guarantee you will love it.","Definitely take this class if you have an interest in art\/theatre and are looking for a way to experience a new culture. The amount of reading is very doable, as is the amount of writing. You will get a lot out of the course!"]}},"mostRecentQ":{"overall":"4.80","workload":"7.00","difficulty":null,"recommendation":"4.80","enrollment":"7","response rate":"57.14","QCourseOverall":{"number":"DRAMA 172x","course_id":"12250","cat_num":"74502","1s":"0","2s":"0","3s":"0","4s":"1","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"DRAMA 172x","course_id":"12250","cat_num":"74502","1s":"0","2s":"2","3s":"1","4s":"0","5s":"0"}},"success":true}