{"scores":{"Fall '12":{"course_score":{"overall":"4.67","workload":"4.33","difficulty":"3.33","recommendation":"5.00","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"EAFM 200","course_id":"818","cat_num":"6509","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":"EAFM 200","course_id":"818","cat_num":"6509","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"EAFM 200","course_id":"818","cat_num":"6509","1s":"0","2s":"0","3s":"1","4s":"0","5s":"2"}},"instructor_scores":[{"number":"EAFM 200","cat_num":"6509","course_id":"818","year":"2012","term":"1","id":"dbe48e9d70a571fdece50053a0d056e0","first":"Shigehisa","last":"Kuriyama","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.67","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '12":{"comments":["If you're anxious before conference presentation and are scared about future job talks, go take this class. This class helps you to make fun presentations easily to follow, regardless of your fields. If your audience understood you, they're happy and you're happy. More importantly, effective presentation also makes it possible for further in-depth discussion.","This class is truly transformational. I would strongly urge both undergraduates and graduate students to take this class. It teaches you skills that are applicable in any field not just academia, because in today's world knowing how to give good presentations and having media skills is a true must.","This is a challenging course and how much you get out of it entirely depends how much work you put in.  It is also highly unstructured, so if you are an undergraduate, don't expect to get a lot of support in terms of TFs, sections, labs, etc.  You will be doing a lot of work on your own time, choosing your own assignment topics, and structuring your own workflow.  You will basically meet once a week, present your assignment from the week before, be taught a minimal amount of cool digital techniques with Keynote, Photoshop, After Effects, etc., and then set loose to work on the assignment for the next week.  Most likely, depending on your familiarity with the software, making each week's movie\/presentation will take upwards of 10-15 hours (this doesn't include the 2-3 books we are also assigned to read and present on).  This class can be a serious time commitment if you take it seriously.  Also, make sure to take advantage of the lynda.com tutorials, because if you don't, it is easy to fall behind if you aren't familiar with using Adobe Creative Suite software.  You will learn a lot about how to give effective live presentations and how to make professional-looking, educational movies (probably applicable to whatever field you go into).  Finally, Professor Kuriyama is an amazing teacher and presenter: take advantage of his office hours and his formidable expertise!  It is worth taking this class just to spend some time with him and absorb his knowledge.  He is a truly unique teacher who is willing to put a lot of thought and time into transmitting his knowledge."]}},"mostRecentQ":{"overall":"4.67","workload":"4.33","difficulty":"3.33","recommendation":"5.00","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"EAFM 200","course_id":"818","cat_num":"6509","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":"EAFM 200","course_id":"818","cat_num":"6509","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"},"QWorkload":{"number":"EAFM 200","course_id":"818","cat_num":"6509","1s":"0","2s":"0","3s":"1","4s":"0","5s":"2"}},"success":true}