{"scores":{"Fall '15":{"course_score":{"overall":"4.40","workload":"10.60","difficulty":null,"recommendation":"4.40","enrollment":"11","response rate":"63.64","QCourseOverall":{"number":"EAFM 201","course_id":"819","cat_num":"108471","1s":"0","2s":"0","3s":"0","4s":"4","5s":"3"},"QDifficulty":{"number":"EAFM 201","course_id":"819","cat_num":"91266","1s":"0","2s":"0","3s":"1","4s":"2","5s":"0"},"QWorkload":{"number":"EAFM 201","course_id":"819","cat_num":"108471","1s":"0","2s":"4","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"EAFM 201","cat_num":"108471","course_id":"819","year":"2015","term":"1","id":"93e2ce4ee008656d8065c527b6afdf72","first":" Alexander","last":"Zahlten","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '12":{"course_score":{"overall":"4.67","workload":"2.67","difficulty":"3.67","recommendation":"5.00","enrollment":"3","response rate":"100.00","QCourseOverall":{"number":"EAFM 201","course_id":"819","cat_num":"108471","1s":"0","2s":"0","3s":"0","4s":"4","5s":"3"},"QDifficulty":{"number":"EAFM 201","course_id":"819","cat_num":"91266","1s":"0","2s":"0","3s":"1","4s":"2","5s":"0"},"QWorkload":{"number":"EAFM 201","course_id":"819","cat_num":"108471","1s":"0","2s":"4","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"EAFM 201","cat_num":"91266","course_id":"819","year":"2012","term":"1","id":"93e2ce4ee008656d8065c527b6afdf72","first":"Alexander","last":"Zahlten","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '12":{"comments":["Since media mix studies is in many ways still a very emergent field, this class requires a certain flexibility with regard to approaching and thinking about the material, but in that sense it is very rewarding in return.","I would recommend this class to anyone interested in anime and\/or media theory. I found it incredibly enlightening, and it was a great way to become familiar with concepts not traditionally covered in courses on Japan. The materials are quite good, although the readings can be difficult, especially if you are not familiar with film theory. You will need to put a good amount of work into the weekly readings to make sure you really understand them. That said, professor Zahlten is a tremendous resource if you are having trouble understanding something. He has an almost encyclopedic knowledge of the subject matter, and talking with him is incredibly helpful and enjoyable.","An extraordinary, intense, challenging and vibrant course. No matter how tenuous the connection of your own research with the topic of this seminar, you're sure to come away with something very useful."]},"Fall '15":{"comments":["Professor Zahlten is amazing and if you have any interest in Japanese popular culture or its media mix production strategies, please take this class! Aside from weekly postings, the only assignments are the short midterm and final papers which are accompanied by data visualization you create based on a particular franchise you're interested in. It's not particularly daunting at all and a great way to learn more about specific franchises you've only interacted with as a consumer. You'll also benefit from Professor Zahlten's repository of Japanese pop culture and media theory knowledge, as he'll add interesting historical context, contrasting viewpoints, and thought-provoking questions during class discussions. I highly recommend it!","I would tell students interested in cultural studies, media, Japan, etc. to take this class because it is interesting, new (meaning that you can see what areas of media mix scholarship can be built upon and it may be something worth pursuing), and, in terms of difficulty, not bad. There are a variety of people with varying levels of knowledge\/experience who take this class and Professor Zahlten is understanding of that.","This is a true discussion course, so what you get out of it will be heavily dependent on what you put into it. Read actively and well, and view materials with an engaged and critical eye. If you do, you'll have a wonderful time. If you don't, it will be apparent, not to mention the group discussion will suffer."]}},"mostRecentQ":{"overall":"4.40","workload":"10.60","difficulty":null,"recommendation":"4.40","enrollment":"11","response rate":"63.64","QCourseOverall":{"number":"EAFM 201","course_id":"819","cat_num":"108471","1s":"0","2s":"0","3s":"0","4s":"4","5s":"3"},"QDifficulty":{"number":"EAFM 201","course_id":"819","cat_num":"91266","1s":"0","2s":"0","3s":"1","4s":"2","5s":"0"},"QWorkload":{"number":"EAFM 201","course_id":"819","cat_num":"108471","1s":"0","2s":"4","3s":"2","4s":"0","5s":"1"}},"success":true}