{"scores":{"Spring '17":{"course_score":{"overall":"4.20","workload":"3.80","difficulty":null,"recommendation":"4.20","enrollment":"28","response rate":"85.71","QCourseOverall":{"number":"EAFM 112","course_id":"13081","cat_num":"159550","1s":"0","2s":"0","3s":"0","4s":"1","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EAFM 112","course_id":"13081","cat_num":"159550","1s":"1","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EAFM 112","cat_num":"159550","course_id":"13081","year":"2016","term":"2","id":"93e2ce4ee008656d8065c527b6afdf72","first":" Alexander","last":"Zahlten","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Fall '15":{"course_score":{"overall":"4.80","workload":"3.20","difficulty":null,"recommendation":"4.80","enrollment":"10","response rate":"60.00","QCourseOverall":{"number":"EAFM 112","course_id":"13081","cat_num":"159550","1s":"0","2s":"0","3s":"0","4s":"1","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EAFM 112","course_id":"13081","cat_num":"159550","1s":"1","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EAFM 112","cat_num":"159550","course_id":"13081","year":"2015","term":"1","id":"93e2ce4ee008656d8065c527b6afdf72","first":" Alexander","last":"Zahlten","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '15":{"comments":["Take this class if you are at all interested in film or if you need an A and I requirement.  Professor Zahlten is amazing and knowledgeable, and made every second of this class enjoyable.  The films are all interesting and you learn a lot about not only Japan, but also film in general.","Really great course that goes beyond just Japan and teaches you to critically analyze film.","It is very culturally enriching and interesting course. The professor is extremely well-prepared, dedicated and nice.","If you don't have an interest in foreign cultures (or Japanese culture for that matter), it is possible that you may not enjoy this course. You do watch movies, but they're always within the context of Japanese society. In addition, some movies are better than others, and any lower quality movies are shown to reinforce Japanese cultural trends rather than pivotal works of cinema.","This is simply the best course that I took at Harvard. The assignments are easy and fun to work on, the quizzes are designed to motivate you to learn and not to test you."]},"Spring '17":{"comments":["The ideal gen-ed.  It's not going to stress you out, and each lecture\/section\/screening is rewarding.  Many of the students are skilled in film production, so you will get to make some nice short films at the end of the semester.","Really interesting course with an exceptional professor! Highly enjoyable and fun, while also really good at teaching you critical thinking and appreciation of the arts!","Took this class my senior spring and I have NO REGRETS.\r\nProfessor is great; extremely passionate and accomplished but still very very approachable and relatable.\r\nCourse organization could be improved (assignments were sent out over emails, deadlines were not centralized and kept changing) but it was still very very manageable.","The course is fun and informative, especially if you are interested in Japanese cinema. It discusses Japan's place in the world during various time periods, so there is some cultural history involved.","This gen ed requires a good deal of work. Make sure you're interested in the subject.","This class is great for anyone with an interest in east asian film, anime, or really any sort of film in general.","This course gives an in depth view into Japanese cinema, showing many interesting films. Presents a wide perspective on how these films relate to national identity and other complex topics. Good discussions.","I really loved this class, especially because of how it is taught and presented, through a variety of genres and styles of film, grounded in historical and political context. Zahlten is also a really approachable and excellent professor, who has a lot of experience- definitely take the class","Films are always interesting and make you think, although not always *enjoyable* in the conventional sense. Professor Zahlten is a great guy and fantastic teacher and really amkes you probe deeply into your assumptions.","Not that much weekly work at first but then all the big film assignments start and then they are back to back and they are time consuming.","There is a fair amount of work (for a Gen Ed), especially at the end when you have to shoot your final films. However, overall the class was interesting, and the movies we watched were great. If you want to expose yourself to the nuances of Japanese media, take this class.","I had a bit of prior interest in Japanese film coming in to this class, and it really exceeded my expectations. All of the films are fascinating if not enjoyable, and Prof. Zahlten gave really great lectures. I never thought of myself as someone who would love a more analytical perspective on film, but I thoroughly enjoyed that side of the class, especially as that perspective is balanced really nicely with social\/historical contexts of each film. I genuinely feel like this class has sparked a much more long-term interest in film.","Assignments are different and engaging. Class can be kind of a drag sometimes. Professor Zahlten is very passionate about the class, which is nice to see, and encourages participation in lecture by remaining very open to student comments.","Usually when I take a class about a topic that I'm very interested in, that class will kill my enthusiasm. This class only made me more enthusiastic about film, and I'm now able to subconsciously recognize certain filmic methods while I watch movies for fun... Zahlten is a great professor, and I would recommend this class strongly."]}},"mostRecentQ":{"overall":"4.20","workload":"3.80","difficulty":null,"recommendation":"4.20","enrollment":"28","response rate":"85.71","QCourseOverall":{"number":"EAFM 112","course_id":"13081","cat_num":"159550","1s":"0","2s":"0","3s":"0","4s":"1","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EAFM 112","course_id":"13081","cat_num":"159550","1s":"1","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}