{"scores":{"Fall '15":{"course_score":{"overall":"3.80","workload":"10.00","difficulty":null,"recommendation":"4.00","enrollment":"13","response rate":"61.54","QCourseOverall":{"number":"ECON 2035","course_id":"12267","cat_num":"156371","1s":"1","2s":"0","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ECON 2035","course_id":"12267","cat_num":"156371","1s":"0","2s":"1","3s":"5","4s":"0","5s":"1"}},"instructor_scores":[{"number":"ECON 2035","cat_num":"156371","course_id":"12267","year":"2015","term":"1","id":"61f45b935aac102cb108a84fb9d1e22d","first":" Matthew","last":"Rabin","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.00"}]},"Fall '14":{"course_score":{"overall":"4.30","workload":"8.10","difficulty":null,"recommendation":"4.30","enrollment":"19","response rate":"73.68","QCourseOverall":{"number":"ECON 2035","course_id":"12267","cat_num":"156371","1s":"1","2s":"0","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ECON 2035","course_id":"12267","cat_num":"156371","1s":"0","2s":"1","3s":"5","4s":"0","5s":"1"}},"instructor_scores":[{"number":"ECON 2035","cat_num":"42326","course_id":"12267","year":"2014","term":"1","id":"61f45b935aac102cb108a84fb9d1e22d","first":" Matthew","last":"Rabin","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.40"}]}},"comments":{"Fall '14":{"comments":["- great professor with a lot of enthusiasm, knowledge, and devotion to his students.\n- great materials that everyone in any field, theory or empirical, should know.\n- excellent teaching fellow Neil Thakral.","Matthew identifies behavioral biases and offers tractable ways to model them. You could build an entire career from applying the models you learn in this class to a wide range of fields. I highly recommend taking this class even if you don't view yourself as a behavioral economist.","This is not a good course to choose to satisfy the distribution requirement - while the material can be interesting, the problem sets devolve into unnecessarily frustrating algebra.","Problem sets are hard, but certainly worthwhile in terms of insight gained. Would recommend the lectures to anyone, even those not taking for credit.","Behavioral Economics with emphasis on theory taught by one of the best scholars in the field.","Matthew Rabin has devoted a lot of time over the years to make the course what it is nowadays. For anyone who wants to understand the theory of behavior economics, this is probably the best course you can take in the world. \n\nThe strengths of the course are:\n- The material. Just look at the syllabus, it's pretty amazing.\n- Matthew is fantastic but it took me a while to like him. I believe it is mostly because of the 3-hour lectures. It is impossible to like any teacher after a 3-hour class about theory. Still, he is very devoted to his students and very generous with his time. I look forward to developing my relationship with him in the coming years.\n- The problem sets! They are so well-written. I learnt so much from them. These are the best problem sets I have ever had in a class. You devote a lot of time to them but you learn an incredible amount of intuition and modeling skills from them, just by observing how Matthew writes the questions. \n- The TA! Neil is absolutely fantastic. If it hadn't been for his office hours, I would have been in a lot of trouble to finish the problems (more trouble than I already went through.) I really hope he TAs the class next year because I am suggesting this class to a lot of my friends.\n- The number of office hours that both Matthew and Neil had during the semester: I was surprised that the class had no sections but that was perfect for the way how Matthew ran the class. We really needed office hours rather than sections.\n\nThe weaknesses of the course are:\n- I would appreciate if Matthew put some thought in the following issue: would students learn better if we had 2 1.5-hour classes a week or should we keep the current class schedule?\n- Also, the time of the class was very unfortunate. A lot of students took Raj Chetty's Public Economics class and they had to cross the river without having lunch to attend class. Public and behavior are two very common concentrations, so it is important to keep that in mind when choosing the time for the lecture.\n\n- I would say that people should have a background in theory, which I totally did not have, before taking this class."]},"Fall '15":{"comments":["The material is very interesting but the instructor is disorganized, which makes it very difficult to engage with the material as expected.","Less theoretical formality than expected - i.e. not really building and solving toy models, but still very much a theory class.","This class will teach you cutting-edge behavioral economics theory from a a very accomplished professor. The classes themselves are somewhat scattered, but the problem sets are useful if you put the time in (and they take a lot of time). You will learn a lot about how to model out new behavioral economics ideas."]}},"mostRecentQ":{"overall":"3.80","workload":"10.00","difficulty":null,"recommendation":"4.00","enrollment":"13","response rate":"61.54","QCourseOverall":{"number":"ECON 2035","course_id":"12267","cat_num":"156371","1s":"1","2s":"0","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ECON 2035","course_id":"12267","cat_num":"156371","1s":"0","2s":"1","3s":"5","4s":"0","5s":"1"}},"success":true}