{"scores":{"Fall '14":{"course_score":{"overall":"4.60","workload":"5.00","difficulty":null,"recommendation":"4.40","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"0","2s":"0","3s":"0","4s":"3","5s":"4"},"QDifficulty":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"0","2s":"2","3s":"6","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"2","2s":"2","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 980u","cat_num":"87839","course_id":"936","year":"2014","term":"1","id":"87f96805401210b11d8d4f0bc2b2cf68","first":" George J.","last":"Borjas","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '12":{"course_score":{"overall":"4.00","workload":"2.14","difficulty":"3.29","recommendation":"4.00","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"0","2s":"0","3s":"0","4s":"3","5s":"4"},"QDifficulty":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"0","2s":"2","3s":"6","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"2","2s":"2","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 980u","cat_num":"87839","course_id":"936","year":"2012","term":"1","id":"87f96805401210b11d8d4f0bc2b2cf68","first":"George J.","last":"Borjas","InstructorOverall":"4.57","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.57","GeneratesEnthusiasm":"4.36","FacilitatesDiscussionEncouragesParticipation":"3.42","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"4.11"}]},"Fall '10":{"course_score":{"overall":"4.62","workload":"2.15","difficulty":"2.85","recommendation":"4.69","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"0","2s":"0","3s":"0","4s":"3","5s":"4"},"QDifficulty":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"0","2s":"2","3s":"6","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"2","2s":"2","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 980u","cat_num":"87839","course_id":"936","year":"2010","term":"1","id":"87f96805401210b11d8d4f0bc2b2cf68","first":"George J.","last":"Borjas","InstructorOverall":"4.77","EffectiveLecturesorPresentations":"4.69","AccessibleOutsideClass":"4.85","GeneratesEnthusiasm":"4.92","FacilitatesDiscussionEncouragesParticipation":"4.33","GivesUsefulFeedback":"4.25","ReturnsAssignmentsinTimelyFashion":"4.83"}]}},"comments":{"Fall '10":{"comments":["there is no other course like this in the economics department at Harvard!","It helps you figure out what would be required of you if you want to write a thesis and sort of helps you figure out what interests you as well.","If you are even remotely interested in immigration, you should take this course. Professor Borjas is so knowledgeable and approachable. Highly recommended","Professor Borjas is fantastic and really cares about his students - this was probably among the best faculty interactions I had during my time at Harvard. He's very knowledgeable about almost every strand of the literature, and his class gives you a dose the 'history' of the field as well, which I found quite interesting.","The professor is great and really nice. The class was more like a lecture than a seminar, but people felt comfortable sharing their comments and asking questions. There was quite a bit of reading, but it was managable. The weekly reading assignments weren't bad.","Professor Borjas is an expert in the field and very approachable. He is committed to the course which is very interesting although some of the concepts are harder to understand."]},"Fall '12":{"comments":["This is the kind of course that you would go to Harvard for - the opportunity to learn about immigration economics from the professor who is the authority on the field is an absolutely incredible experience. Lectures are 2 hours long, and go by extremely quickly; it is also the only class in which I've seen people take notes even though the material will not tested. The final project is extremely rewarding, and you really gain a good sense of the process of an empirical study in economics. In all, I can't say enough good things about the course - it has been such a great semester. (I also recommend visiting Professor Borjas' office hours: picking his brain, even for a few minutes, is truly amazing.)","Good class to learn about immigration economics. Borjas knows his stuff. You end up learning a lot about academia in the process and how to do research. He sets it up as more of a lecture than a tutorial, but the last few weeks of the class are all student presentations. Two hours does feel long if you're tired, especially since it is more of a lecture.","This course is super interesting because your professor is most published author in the field of immigration and economics. You learn very interesting findings in the field from the beginning to most current literature. That being said, in lectures you go over a lot of quantitative theory which can get confusing. However, the assignments and paper are totally doable. Take this!","One has to truly enjoy economics to like this course.","Professor Borjas gives a great overview of immigration economics in this course. Not only is the course enjoyable because of the wide variety of articles, but also because they include interesting anecdotes and tidbits about the history of immigration to the US.","Borjas is a super nice guy. He speaks to the class really openly and honestly and offers great insight into academia. The weekly assignment were graded kinda tough, but I'm not sure how important these are to the grade. Also, with meeting only once a week and a weekly assignment which takes aprox. 3 hrs its not that bad workwise. Overall it was a good course and a great chance to speak with a leader in the field although 2 hour lectures are pretty long even with a good speaker and the weekly assignments are graded pretty tough. (also I may be biased on the weekly assignments, since others did do better on them)","Professor Borjas is an amazing lecture and will inspire enthusiasm about immigration economics in even the most disinterested students.  Take this course.","If you are actually interested in immigration economics, this is actually a really great opportunity. If you are not, you will find yourself lost and detached, and the final project will really hit you hard. Harvard does pay to take the class to Upstairs on the Square, though, so there's that.","This class involves quite a bit of readings, and there are one or two lectures that seem to diverge from the topic of immigration economics (only because the field itself did that too), but it is a great class to learn about what kind of methods are used in trying to determine the costs or benefits of immigration.  This does not focus on immigration policy, which is actually great for the course.","Starts out really interesting, but lectures get less engaging as the course goes along unfortunately. Great opportunity to do some unique research however!"]},"Fall '14":{"comments":["Prof. Borjas is an expert in this field. If you have ever been curious about why people move, who moves, and the impact of movers then take this class! Prof Borjas cares about the students and is very available outside of class. Take his seminar!","This class is a great opportunity to learn about and discuss a topic with an academic who is right at the top of his field. Take it! Some of what you'll learn is intellectually depressing: it's very hard to come up with robust answers to knotty empirical questions, and sensible people can come to very different conclusions. With controversial topics like immigration, this effect is magnified. But overall a very fun course. Borjas is cool!","Awesome if you like microeconomics and immigration","Professor Borjas is an incredibly caring professor, get to know him and you will gain so much more from the course! He is truly the expert on this... I mean, he's written the textbook...","This had been my favorite class at Harvard. You learn from an amazing professor that is very knowledgeable about the subject. If you are interested in labor economics or immigration economics, I would really recommend this class,"]}},"mostRecentQ":{"overall":"4.60","workload":"5.00","difficulty":null,"recommendation":"4.40","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"0","2s":"0","3s":"0","4s":"3","5s":"4"},"QDifficulty":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"0","2s":"2","3s":"6","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 980u","course_id":"936","cat_num":"87839","1s":"2","2s":"2","3s":"3","4s":"0","5s":"0"}},"success":true}