{"scores":{"Spring '16":{"course_score":{"overall":"4.40","workload":"3.50","difficulty":null,"recommendation":"4.50","enrollment":"17","response rate":"70.59","QCourseOverall":{"number":"ECON 1160","course_id":"13503","cat_num":"160352","1s":"0","2s":"0","3s":"3","4s":"1","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ECON 1160","course_id":"13503","cat_num":"160352","1s":"4","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1160","cat_num":"160352","course_id":"13503","year":"2015","term":"2","id":"6f0d679c0b35b05a12f4c718a8dba9c9","first":" Sendhil","last":"Mullainathan","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.40"},{"number":"ECON 1160","cat_num":"160352","course_id":"13503","year":"2015","term":"2","id":"7aa89b7cd1aff7686133550693d678f3","first":" Ziad","last":"Obermeyer","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Spring '16":{"comments":["One of the best classes I've taken all four years at Harvard. A quintessential seminar focused on reading research papers (actually a lot of fun!) on interesting intersects of medicine and data science such as predicting drug side effects using search and forum history. Assignments were really chill and gave you plenty of time to learn about new things. Professors and TF were incredibly nice and knowledgeable and always had insights from their own experience or literature to promote active discussion. Enjoyed every minute of the class!","The class will be different in future years. As a student with a statistics and machine learning background, this was a cool opportunity to read some papers and engage in discussion with faculty members who have thought a lot about the intersection of health and statistics.","I don't know how this class will be changed next year. This year, we had weekly readings response to the papers we read, individual presentation, and final group presentations. Workload was chill. The material is interesting. Although sometimes, it can get really dense with medical stuff, I learned a lot about how our body works and the insurance market works. The professors are super chill. They are bros. You'll like the class.","Sendhil and Ziad are an absolutely phenomenal duo. They are very passionate about the material, give effective lectures, and also ask thought-provoking questions. Please take the course - it will not be a waste of your time!","Take it if you want to learn about the machine side of medicine","This is such an interesting and engaging class. Sendhil and Ziad are hilarious and a joy to learn from.","Take. It!  Excellent. Professors","This is a class that asks a lot of interesting questions about medicine and data science--expect to come away from it have thought a great deal about intersections between the two and the big issues in the field. The workload is pretty straightforward too, with very few graded assignments, which can pose difficulties in its own way if you like getting feedback on a weekly basis, but can also make your schedule easier. Overall, though, a very good class.","novel approach to health data","If you're interested in applications of machine learning in the health sphere, this is a great class. You will read papers on the latest advancements in machine learning applications in health from well-known science and medical journals, and hear from lecturers with expertise in medicine and behavioral economics. With that said, the course was very all over the place subject matter wise, and was not a rigorous data science course by any means (there were no psets)."]}},"mostRecentQ":{"overall":"4.40","workload":"3.50","difficulty":null,"recommendation":"4.50","enrollment":"17","response rate":"70.59","QCourseOverall":{"number":"ECON 1160","course_id":"13503","cat_num":"160352","1s":"0","2s":"0","3s":"3","4s":"1","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ECON 1160","course_id":"13503","cat_num":"160352","1s":"4","2s":"7","3s":"0","4s":"0","5s":"0"}},"success":true}