{"scores":{"Spring '15":{"course_score":{"overall":"4.40","workload":"4.10","difficulty":null,"recommendation":"4.60","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"ENG-SCI 161","course_id":"12876","cat_num":"156933","1s":"0","2s":"0","3s":"1","4s":"2","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENG-SCI 161","course_id":"12876","cat_num":"156933","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 161","cat_num":"156933","course_id":"12876","year":"2014","term":"2","id":"d7c14083a43a2cf6dd7d00b8f2109195","first":" Elsie M","last":"Sunderland","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"3.50"}]}},"comments":{"Spring '15":{"comments":["Overall, a great course, and it seems that little else in the undergraduate classes provides an overview of environmental toxicology. I learned quite a bit in a short amount of time--about environmental health, toxicology, and contaminants themselves. Elsie has a unique sense of humor and is a great lecturer. One weakness of the course, however, was the final project. While the topic was interesting, the criteria were pretty unclear, students were split into groups of 3 and 2 although we could have been in groups of 2, and some students presented and submitted their slides two days later, allowing them ample time to avoid mistakes that earlier groups had made. I understand that this topic will vary year to year, but it was a frustrating end to an otherwise great course.","If you want a good look at an incredibly rewarding application of your environmental engineering studies, TAKE THIS CLASS.","This class is unlike any other engineering class I've taken, because it doesn't have problem sets and focuses on a lot more real-world problems.  It is a really interesting class, that is fun and unique.  I'd take it again if I could!","Great ESE course and professor. Interesting subject that doesn't overlap with other courses. Great professor that cares for students--even focuses on helping students figure out what they want to do with environmental engineering.","This class is a great way to be introduced to a whole realm of career options that engage social inequality\/public health issues with hard science and engineering. While the class itself is not very quantitative, it provides context to many of the other classes in the engineering department.","This was the best class i have taken at Harvard. all of the assignments felt like they had purpose and were worth while. the guest lecture component gave a great snap shot into what real-world experience we could apply the things we learned in class to."]}},"mostRecentQ":{"overall":"4.40","workload":"4.10","difficulty":null,"recommendation":"4.60","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"ENG-SCI 161","course_id":"12876","cat_num":"156933","1s":"0","2s":"0","3s":"1","4s":"2","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENG-SCI 161","course_id":"12876","cat_num":"156933","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"}},"success":true}