{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"4.20","difficulty":null,"recommendation":"4.90","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"ENGLISH CVB","cat_num":"203265","course_id":"14221","year":"2016","term":"2","id":"abde29d57f6a4803dae7cac1fb36874d","first":" Laura M.","last":"van den Berg","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.90"}]}},"comments":{"Spring '17":{"comments":["If you love to write but never have the time, take this class. It's low stress, includes wonderful writing, and provides a comfortable environment for sharing and establishing connections. I learned a lot about writing and revision. We had a really awesome mixture of STEM and humanities kids in my class, all brought together by a love of literature. It was a wonderful community full of talented folks. Also, it was super fun to get to read your peers' work, since you can learn a lot from them too.","Professor van den Berg is fantastic: Clear, helpful, welcoming. Even when the class shifts into mostly workshopping, she continues to offer broadly applicable advice (listen for the \"oceanic layers\") and fantastic conceptualizing\/drafting\/revising tips. The readings are great and not too heavy. A great choice for first-time fiction workshoppers and returning ones.","This has been one of the most invigorating classes I have taken and would recommend without a doubt to students of any major\/school.\r\n\r\nLaura leads an excellent workshop, is extremely knowledgeable and a simply a pleasure to have as a professor. The discussions are free but grounded in a lot of technical and craft lessons, and the stories assigned throughout the semester are all very pertinent to the general themes covered.\r\n\r\nWorkload varies (heavier later in the semester when working on larger short stories) and is dependent upon how much time you are willing to invest in your work. Laura is easily approachable outside of hours and is genuinely invested in her students' work!","As with any workshop, the quality of feedback can be largely dependent on the participants, which obviously vary, as Laura isn't particularly hands-on in redirecting feedback.  However, I found this class improved my writing enormously (particularly as a first time writer) and Laura is incredibly knowledgeable about craft.  You read some great stories, discuss important elements of technique and all in all, taking a fiction workshop (this one in my experience) was totally worth it!","A GREAT CLASS. Definitely one of the highlights of my year. You will become a better writer by reading consistently and through the workshop process. TAKE IT IF YOU CAN.","Laura is great! She is the best creative writing teacher I have ever had. She gives detailed specific feedback and is really good at teaching lessons about craft."]}},"mostRecentQ":{"overall":"4.80","workload":"4.20","difficulty":null,"recommendation":"4.90","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}