{"scores":{"Spring '17":{"course_score":{"overall":"4.20","workload":"5.80","difficulty":null,"recommendation":"4.10","enrollment":"17","response rate":"47.06","QCourseOverall":{"number":"ENGLISH 103d","course_id":"10757","cat_num":"62498","1s":"0","2s":"0","3s":"0","4s":"2","5s":"3"},"QDifficulty":{"number":"ENGLISH 103d","course_id":"10757","cat_num":"62498","1s":"0","2s":"0","3s":"2","4s":"3","5s":"0"},"QWorkload":{"number":"ENGLISH 103d","course_id":"10757","cat_num":"62498","1s":"0","2s":"1","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 103D","cat_num":"146016","course_id":"10757","year":"2016","term":"2","id":"307f0d7f3dc57c87ae2a6fd35de718f1","first":" Daniel","last":"Donoghue","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Spring '14":{"course_score":{"overall":"4.60","workload":"3.00","difficulty":"3.60","recommendation":"4.40","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"ENGLISH 103d","course_id":"10757","cat_num":"62498","1s":"0","2s":"0","3s":"0","4s":"2","5s":"3"},"QDifficulty":{"number":"ENGLISH 103d","course_id":"10757","cat_num":"62498","1s":"0","2s":"0","3s":"2","4s":"3","5s":"0"},"QWorkload":{"number":"ENGLISH 103d","course_id":"10757","cat_num":"62498","1s":"0","2s":"1","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 103d","cat_num":"62498","course_id":"10757","year":"2013","term":"2","id":"307f0d7f3dc57c87ae2a6fd35de718f1","first":" Daniel","last":"Donoghue","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '14":{"comments":["Highly recommended for anyone with an interest in Heaney, Beowulf, Old English literature, or translation studies.","I would say that this class would be tremendously helpful to medievalists, but that direct involvement with the modern translation of the poem advertised in the course description was minimal, so be aware.","The survival of Beowulf itself is an amazing feat. To understand the origins of the English language and its literature, one must study it--and NOT just in a survey course. I never thought I would enjoy spending an entire semester on it, but in fact, dedicating that much time and space solely to one text and its criticism has proved rewarding and essential. Professor Donoghue is an expert in the field, and you couldn't ask for a kinder guide through Old English. The intimacy of a small seminar also makes translation feel like a team project. Beowulf has been seminal to poets like Heaney and Hopkins and continues to be the foundational text for writers today. If you take this course, which I recommend you do, you'll realize that Beowulf is actually much stranger, more mysterious, and more sophisticated than you might think.","Whoever wants to learn Old English should take a course with Prof. Donoghue! He is the best language teacher, the most learned Old English literature reader and the smartest critic! He is also the sweetest man with great charisma!","This course is strongly based on translating the Old English of Beowulf."]},"Spring '17":{"comments":["Take this course, if for no other reason, to get to know one of Harvard's most passionate and kind Professors.","The translations are a bitch but overall it is a really cool class and you learn all of this cool stuff","Professor Donoghue is a very knowledgeable man, particularly about this poem and Seamus Heaney's process in translating it. Unfortunately, you only get that knowledge in fits and starts when he corrects a line or two from your translation or walks you through a discussion of an essay. Basically, everyone else in this class is an English concentrator too lazy to remember high school French for the department's foreign lit requirement, and it shows. I'm no different, but the sheer lack of interest my classmates showed tended to almost cancel out good teaching and interesting subject matter.","This is my favorite class I've taken at Harvard!","This class is an interesting and reasonably painless way to fulfill the foreign lit requirement for English or H&L! It's a rare opportunity to focus on one really complex text for the whole semester and leave feeling like you have a comprehensive understanding of it. You also get to work on some unusual topics---archaeology, viking history and politics, translation theory, etc. Professor Donoghue is very kind, knowledgable, and engaging. Paper prompts are well-structured and thoughtful. A couple caveats: Beowulf criticism as a whole can feel really fussy and smug. So can Seamus Heaney. Also, you do a lot of translation every week, and it can be a seriously time-consuming slog.","This class does a nice job balancing Old English translation and literary analysis. Donoghue is very friendly, enthusiastic and approachable. However, by the end of the semester the weekly translations will get to be a bit of a menial task."]}},"mostRecentQ":{"overall":"4.20","workload":"5.80","difficulty":null,"recommendation":"4.10","enrollment":"17","response rate":"47.06","QCourseOverall":{"number":"ENGLISH 103d","course_id":"10757","cat_num":"62498","1s":"0","2s":"0","3s":"0","4s":"2","5s":"3"},"QDifficulty":{"number":"ENGLISH 103d","course_id":"10757","cat_num":"62498","1s":"0","2s":"0","3s":"2","4s":"3","5s":"0"},"QWorkload":{"number":"ENGLISH 103d","course_id":"10757","cat_num":"62498","1s":"0","2s":"1","3s":"3","4s":"1","5s":"0"}},"success":true}