{"scores":{"Spring '16":{"course_score":{"overall":"4.10","workload":"5.40","difficulty":null,"recommendation":"4.10","enrollment":"26","response rate":"76.92","QCourseOverall":{"number":"ENGLISH 154F","course_id":"13700","cat_num":"160542","1s":"0","2s":"3","3s":"2","4s":"5","5s":"10"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENGLISH 154F","course_id":"13700","cat_num":"160542","1s":"1","2s":"13","3s":"2","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 154F","cat_num":"160542","course_id":"13700","year":"2015","term":"2","id":"b5ed48453a4338f94bd16030a831050f","first":" Philip","last":"Weinstein","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '16":{"comments":["Amazing lectures; amazing demonstrations of how to think about texts, and to think generally.","Amazing course! The lectures are always very engaging and interesting, and the books are great. A little heavy on the reading, so make sure you don't take it with lots of other reading-heavy courses (like I did).","Professor Weinstein is nice but is not the most exciting professor. I didn't find the lectures very engaging, and I thought the assignments were not weighted fairly (the final paper counts for 60% of your grade!). I did not feel invested in the course.","One of the most thought-provoking classes I've ever taken and it was phenomenal taking it with Toni Morrison on campus.","This is a wonderful course. There's really no penalty for being lax on keeping up with the reading, but ultimately you'll miss on on some incredible discussions and incredible books as well, so keep up with it! Not a difficult course, but definitely one to really enjoy and make the most of.","Take this course if you want to make yourself read a lot of Faulkner and Morrison, but just know that lectures might begin to feel repetitive after a while.","An opportunity to read two phenomenal writers, even if comparisons sometimes felt forced, the chance to study these texts in an academic environment is a rare and rewarding one.","Amazing class but requires a lot of time for reading","If this course is offered again, don't wait, jump in and take it. Professor Weinstein was truly fabulous, and the works you read are gorgeous and unmissable (duh). It was such a pleasure to attend this class every week and listen to Professor Weinstein illuminate subtle things about these texts you might not have picked up on. It's an emotionally charged topic, and Professor Weinstein does not tiptoe around the rawness of the racial issues that both relate and alienate the works of Faulkner and Morrison. An altogether enlightening experience.","This class can be a lot of reading, but that is the point. Get into these books and you will see the rewards. Absalom Absalom is incredibly hard, but it is worth it to get through it. Weinstein is really incredible to listen to and a very nice person who takes a genuine interest in his students."]}},"mostRecentQ":{"overall":"4.10","workload":"5.40","difficulty":null,"recommendation":"4.10","enrollment":"26","response rate":"76.92","QCourseOverall":{"number":"ENGLISH 154F","course_id":"13700","cat_num":"160542","1s":"0","2s":"3","3s":"2","4s":"5","5s":"10"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENGLISH 154F","course_id":"13700","cat_num":"160542","1s":"1","2s":"13","3s":"2","4s":"1","5s":"0"}},"success":true}