{"scores":{"Spring '14":{"course_score":{"overall":"5.00","workload":"2.40","difficulty":"2.70","recommendation":"5.00","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"ENGLISH 90yp","course_id":"11461","cat_num":"55945","1s":"0","2s":"0","3s":"0","4s":"0","5s":"9"},"QDifficulty":{"number":"ENGLISH 90yp","course_id":"11461","cat_num":"55945","1s":"1","2s":"1","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"ENGLISH 90yp","course_id":"11461","cat_num":"55945","1s":"0","2s":"5","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 90yp","cat_num":"55945","course_id":"11461","year":"2013","term":"2","id":"55c975c347a57bd87c7b5ce07595d7ae","first":" Peter","last":"Sacks","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '14":{"comments":["This is a serious, in-depth look at Yeats's life and work. Very rewarding, and Professor Sacks is great, but there is a lot of reading so make sure you have time set aside for it or you might end up blowing it off and not getting much out of the course.","This was one of the most enjoyable classes I took at Harvard. Professor Sacks is brilliant, kind, and treats poetry with a scholarly\/personal reverence that makes every class a special experience. Yeats's poetry itself is well worth at least a semester's attention, so if it's something that interests you, take it!","A great exploration of Yeats and his work.  Professor Sacks is a wonderful, kind, engaging teacher.  Be prepared to read a lot and to have people in the class who know a lot more about poetry than you do.","Take this class! You learn two great poets at once.","Take it !","This was a phenomenal course! Prof. Sacks' readings of the poems--and of the trajectory of Yeats' thinking throughout his career--is remarkable. All the writing assignments are open-ended, which I found to be ideal. Working through Yeats' poetry in a small seminar with Prof. Sacks is an incredible opportunity that I could not more highly recommend!","Take this class. Professor Sacks is so genuinely enthusiastic about teaching you'll find it hard not to like him and his course. He's also incredibly accessible to undergraduates and unlike some professors genuinely respects your time - he literally took time out from a personal emergency to talk to me about my paper.","Do yourself a favor and take this course-- it is absolutely incredible. You will be inspired every week, and you will leave feeling connected to your professor, to Yeats, and to poetry."]}},"mostRecentQ":{"overall":"5.00","workload":"2.40","difficulty":"2.70","recommendation":"5.00","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"ENGLISH 90yp","course_id":"11461","cat_num":"55945","1s":"0","2s":"0","3s":"0","4s":"0","5s":"9"},"QDifficulty":{"number":"ENGLISH 90yp","course_id":"11461","cat_num":"55945","1s":"1","2s":"1","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"ENGLISH 90yp","course_id":"11461","cat_num":"55945","1s":"0","2s":"5","3s":"3","4s":"0","5s":"0"}},"success":true}