{"scores":{"Spring '13":{"course_score":{"overall":"3.00","workload":"2.40","difficulty":"3.20","recommendation":"3.00","enrollment":"6","response rate":"83.33","QCourseOverall":{"number":"ENGLISH 184","course_id":"1538","cat_num":"27342","1s":"1","2s":"1","3s":"1","4s":"1","5s":"1"},"QDifficulty":{"number":"ENGLISH 184","course_id":"1538","cat_num":"27342","1s":"0","2s":"0","3s":"4","4s":"1","5s":"0"},"QWorkload":{"number":"ENGLISH 184","course_id":"1538","cat_num":"27342","1s":"0","2s":"3","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 184","cat_num":"27342","course_id":"1538","year":"2012","term":"2","id":"ac4425c406ff99f1255fc6d1acbe2670","first":" David John","last":"Babcock","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"2.80","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"3.00","FacilitatesDiscussionEncouragesParticipation":"2.80","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"3.60"}]}},"comments":{"Spring '13":{"comments":["This class was an confusing blend between a lecture course and a seminar that left me feeling frustrated and confused.","Although it looked promising at the beginning, I should've realized what many of the other students who initially came to class did and dropped it. I felt in over my head as a non-English\/Literature concentrator. Class was rarely engaging, and I felt like we were limited to analyzing works through a postcolonial light, rather than whatever perspective we thought best.","The novels you will read and analyze in LOGE are ones you likely wouldn't read academically anywhere else at Harvard, and that alone is valuable - and the analysis and supporting texts provide for excellent dissections of the material.","This course is great if you are looking for a diverse variety of reading (although many of the same themes definitely recur in each book) and you like a touch of modern history to infuse your reading. I am a science concentrator without much experience with English classes at Harvard, and I found this course to be enjoyable. There is a good bit of reading, but I'm sure that's par for the course with English classes and not anything unusual. There is one short response paper for each book (1 -2 pages double-spaced!), one paper per unit (so two total, and each is only 5 - 6 pages!), and one final paper (8 - 10 pages), which all seemed very reasonable to me, although when the reading assignments overlapped with paper assignments, it was very hard to do both at the same time. Professor Babcock has lots of insight to give on each book, which sometimes leads to an almost lecture-like format to the class, but since it is a 1.5 hour class, those lectures only last for the first 30 minutes as a preface to our discussions. We only had about 6 people in our class, so discussions could stall, but this may have been a reflection of how much of the reading everyone had done. So, come to class prepared for the best discussions, bring up your own points of interest about the reading, etc."]}},"mostRecentQ":{"overall":"3.00","workload":"2.40","difficulty":"3.20","recommendation":"3.00","enrollment":"6","response rate":"83.33","QCourseOverall":{"number":"ENGLISH 184","course_id":"1538","cat_num":"27342","1s":"1","2s":"1","3s":"1","4s":"1","5s":"1"},"QDifficulty":{"number":"ENGLISH 184","course_id":"1538","cat_num":"27342","1s":"0","2s":"0","3s":"4","4s":"1","5s":"0"},"QWorkload":{"number":"ENGLISH 184","course_id":"1538","cat_num":"27342","1s":"0","2s":"3","3s":"2","4s":"0","5s":"0"}},"success":true}