{"scores":{"Spring '16":{"course_score":{"overall":"5.00","workload":"5.30","difficulty":null,"recommendation":"4.70","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"ENGLISH 90AL","course_id":"13987","cat_num":"161293","1s":"0","2s":"0","3s":"0","4s":"0","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENGLISH 90AL","course_id":"13987","cat_num":"161293","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 90AL","cat_num":"161293","course_id":"13987","year":"2015","term":"2","id":"d83e32d8e02851014612ab06c2653e61","first":" Melina","last":"Moe","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"4.90"}]}},"comments":{"Spring '16":{"comments":["English 90al is a fascinating foray into the world of literature related to issues of how humans interact with the natural world. Once you start engaging with the Anthropocene-ic concepts of this course, you won't be able to stop finding elements of the Anthropocene in all of your subsequent reading. The amount of reading required for this seminar is manageable, but expect to be challenged by the variety and level of complexity of some of the readings in this seminar. Professor Moe is a brilliant seminar leader, who is engaging, almost intimidatingly smart, and very kind. I greatly enjoyed this course even though sometimes it felt like the readings were going over my head. If you participate in the discussion and try hard to contextualize the readings, you will begin to see arguments about the Anthropocene everywhere you look.","It's fantastic! Professor Moe is great, and the seminar-style setting enabled some awesome discussions to take place each week in class.","The subject of the Anthropocene is not only important, but also urgent. Weekly discussions are thought-provoking and will stay with you beyond your time in the classroom.","Take this! It's an awesome seminar, and Prof. Moe is amazing.  Plus, the assignments are both varied and really interesting.  It'll make you view the world in a new way.","I honestly think that learning about the environment and how humans interact with it and can either destroy it or make it better will be crucial information for the future. Thinking about these issues on a literary, philosophical, and theoretical level will make actual tangible change easier. Definitely take this class if you want to experience really rewarding discussions about the environment and our changing climate!"]}},"mostRecentQ":{"overall":"5.00","workload":"5.30","difficulty":null,"recommendation":"4.70","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"ENGLISH 90AL","course_id":"13987","cat_num":"161293","1s":"0","2s":"0","3s":"0","4s":"0","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENGLISH 90AL","course_id":"13987","cat_num":"161293","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"}},"success":true}