{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"4.40","difficulty":null,"recommendation":"4.70","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"ENGLISH CPY","cat_num":"203264","course_id":"14358","year":"2016","term":"2","id":"eb841825dddac20c4c65e78aa7d9698d","first":" Paul","last":"Yoon","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.90"}]}},"comments":{"Spring '17":{"comments":["I would tell future students that this course is great. Paul Yoon is a great, caring instructor. It's a great opportunity to sharpen your writing skills in a safe environment, and have trusted people look at your writing. Read other people's writing several times to give good feedback, out of respect for their time that they spend on your writing. Come to class prepared with things to discuss about the other peoples' writing. Write your first drafts as soon as possible so you have time to revise.","Take it, love it, repeat.","Please please please take this class if  you can! It's been my favorite class at Harvard and was my happy place all semester.","Paul is a warm and wonderful teacher. Considering his knowledge and skill in writing fiction, it is unbelievable how humble and unassuming he is as a teacher and friend. His readiness to engage with students on a personal level is unparalleled, and I left his class feeling renewed confidence in my ability as a writer. If you are at all interested in writing fiction, I highly recommend you take his class!","This is a good creative writing class. It exposes students to a contemporary short stories and is an opportunity to work on one's own writing. Paul is super friendly and engaged. The feedback in this course (both from Paul and during workshops) was not as extensive as it could have been. But overall, taking the course was an enjoyable and rewarding experience.","This class is phenomenal. Paul is incredibly smart and great at creating an environment where everyone feels respected and appreciated as a writer.","Would first recommend creative writing workshops in general. Paul's follows a great format and Paul is a very approachable teacher. I had very little experience coming in and felt comfortable sharing my work and felt that all of my feedback was supportive and constructive."]}},"mostRecentQ":{"overall":"4.80","workload":"4.40","difficulty":null,"recommendation":"4.70","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}