{"scores":{"Fall '15":{"course_score":{"overall":"3.40","workload":"4.40","difficulty":null,"recommendation":"3.60","enrollment":"18","response rate":"94.44","QCourseOverall":{"number":"ENGLISH 44","course_id":"12293","cat_num":"156062","1s":"3","2s":"1","3s":"4","4s":"4","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENGLISH 44","course_id":"12293","cat_num":"156062","1s":"3","2s":"10","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 44","cat_num":"156062","course_id":"12293","year":"2015","term":"1","id":"0553372173b6ef688d75217c9534aec0","first":" Joey","last":"McMullen","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Fall '14":{"course_score":{"overall":"3.90","workload":"4.30","difficulty":null,"recommendation":"3.90","enrollment":"20","response rate":"90.00","QCourseOverall":{"number":"ENGLISH 44","course_id":"12293","cat_num":"156062","1s":"3","2s":"1","3s":"4","4s":"4","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENGLISH 44","course_id":"12293","cat_num":"156062","1s":"3","2s":"10","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ENGLISH 44","cat_num":"74412","course_id":"12293","year":"2014","term":"1","id":"23344209efba74080c7dffa25683bca1","first":" Laura Li Ching","last":"Wang","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '14":{"comments":["Great way to fulfill the Arrivals requirement! I'm not a medievalist and wasn't looking forward to this requirement, but I enjoyed the class; Professor Wang is really knowledgeable, approachable, and engaging, and readings and papers are super manageable.","Professor Wang and Yun are incredible! While the course load may sound intimidating, they make the material so much fun and exciting. This is the best way to satisfy your Arrivals requirement!","Lectures are not the best, but sections are good and the assignments are of college-level rigor, unlike those in the comparable Donohue class. Definitely take this one- both Yun and Prof. Wang are enthusiastic, helpful, and insanely knowledgable.","This is an excellent way to fulfill the Arrivals component of the Common Ground courses. Dr. Wang is energetic, knowledgeable, down-to-earth and witty.","Professor Wang really loves the material, and gives you an appreciation of texts that can be a bit of a bear to get through.","Professor Wang gives very compelling lectures. Some texts are very good, some texts--The Canterbury Tales, in particular--are overpraised and perhaps dwelled on a little too much. Still the department is in love with that text so it's not really Professor Wang's fault. Anyway, a solid course where you will learn a lot and read some fascinating texts. An interest in religion, and questions of faith, helps make some of the more drier sections easier to swallow, but is not necessary.","This is a great way to take Arrivals. Laura is really passionate about the material and lectures beautifully. Be prepared to really engage with the texts and take time to understand them","Professor Wang and Yun are very cool people. Both are tremendously passionate about their topics, and you could do worse than take a course from them. However, they are still  inexperienced as pedagogues, and sometimes the class felt stiff and overly lightweight. The papers are graded to a surprisingly more serious standard than the class discussion is held to. Sometimes the things we learned in the class discussions felt somewhat rote and not geared towards deep understandings -- as, perhaps, is inevitable with a survey course of this magnitude.","If you are an english major needing to take an Arrivals class this is a great one. That being said it is still going to be early english literature which is obviously not something everyone enjoys.","This is a strong Arrivals course, though understand that you might not have the deepest conversations on the material. Do the readings--they're absolutely worth it--but understand that, if you find a particular passage or detail surprising, you will probably have to bring it up, otherwise it might get glossed over.","While you do walk away from the class with very ingrained knowledge about Arrivals-era literature and the skill to read Middle English aloud, the course is very structured and isn't very dynamic in terms of talking points or the way discussions happen.","This is a pretty straightforward course that's very well organized, almost to a fault at times. The assignments (minus the quizzes) are solid. As far as Common Grounds go, this one demands an adequate amount out of you so worth checking out. Also, reading Middle English out loud is pretty cool! Even though I sometimes didn't know what I was saying."]},"Fall '15":{"comments":["Arrivals was a lot of fun! I really liked Joey and Yun. Reading is great too; I particularly liked the poetry at the end.","Arrivals is a requirement for concentrators, even if early British lit is the last thing you want to study. That said, if you really love literature, you'll recognize the importance of these texts (and be surprised by their applicability, even if everything else you read is from 2010 onward). Prof. McMullen really made this class not just painless but enjoyable for everyone from medievalists to modernists.","Best way to finish arrivals requirement! Joey is the MAN. Yun is the WOMAN.","This is a fairly average version of a fairly average survey class. The readings will whip past you if you aren't careful - the amount you're expected to take in every week is quite challenging. Joey is a good instructor, though his lectures don't make you stand up and cheer. His office hours are much more useful. In short, he's a scholar, not a poet, and generates scholarly enthusiasm. But this isn't a course that will change your life.","Joey McMullen is both knowledgeable and enthusiastic about the course material. I was really intimidated by the course material but he made it accessible and interesting. With the correct amount of work put into it, it was relatively painless.","This class was taught by an enthusiastic and energetic teacher who made what could have been boring really exciting!","This class is a great overview of medieval English literature. The professor tried very hard to make the class fun.","The teaching staff for this course was quite inexperienced and lecture often felt like a waste of time. It would have been nice to get more than plot summary and basic biographical information out of class time. Section was better, but it would have been nice to have Yun push the students more often.","There seems to be no great way to fulfill the Arrivals requirement, unfortunately. I don't particularly recommend this one, but I also haven't experienced any others. The class offers a brief, surface survey of early English literature, but focuses mostly on plot summaries and basic info that doesn't really attempt to make the material interesting. Joey assumed we wouldn't be interested in it, and his approach was to try to make the material \"fun\" or \"cool\" by dumbing it down or drawing weird, modern comparisons and using \"cool\" language. This only served to make it less interesting, and class more tedious. There is very little real, in-depth history or academic engagement with critics and secondary sources that would at least make it feel more interesting and relevant. The assignments were good, though--straightforward, not too difficult, and helped make things slightly more engaging.","I think it is completely understandable that Joey has some issues when presenting since he is a new teacher, but I would recommend taking this class with an expert in the field because I think English students would get a more nuanced experience out of the class. I was reluctant to take the class with an true expert because I did not feel confident in my abilities to read and study these texts, especially those in middle English, but looking back I am bummed that I let that keep me from a challenge that I think I would have gotten more out of overall.","It's a good course, just hard to sink one's teeth into, as it moves so quickly through 1000 years it can seem to give only cursory treatment to some works and eras."]}},"mostRecentQ":{"overall":"3.40","workload":"4.40","difficulty":null,"recommendation":"3.60","enrollment":"18","response rate":"94.44","QCourseOverall":{"number":"ENGLISH 44","course_id":"12293","cat_num":"156062","1s":"3","2s":"1","3s":"4","4s":"4","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENGLISH 44","course_id":"12293","cat_num":"156062","1s":"3","2s":"10","3s":"3","4s":"0","5s":"0"}},"success":true}