{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"5.60","difficulty":null,"recommendation":"4.90","enrollment":"16","response rate":"87.50","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"ENGLISH 90LL","cat_num":"203067","course_id":"14539","year":"2016","term":"2","id":"c51041200c534f735aea2a75709bc40b","first":" Kelly Mee","last":"Rich","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '17":{"comments":["Professor Rich is a great professor! She's so incredibly smart, it feels like a privilege to get to hear her thoughts on the works we read. The syllabus is thoroughly thought-out; there's a mix of nonfiction, fiction, and poetry, and the presentations\/discussions around all of them are equally accessible and engaging. You don't need a background or even an intent to pursue the law for this course, it really is a literary perspective on the law (although you do get to read legal cases, etc). All around a really interesting (though not easy) 90-level seminar, and I'd gladly take a class with Professor Rich again!","This course is AWESOME. One of the best I've taken at Harvard. It's so dynamic and original and exciting, plus Professor Rich is lovely and brilliant. Can't recommend highly enough","This class covers topics that are difficult to think about as a human being, and particularly as a young Harvard student who, more likely than not, has never directly experienced an act of mass injustice like the Civilian Exclusion Act or Apartheid. Yet these topics, especially framed within the idea of 'law and literature' become incredibly relevant when studied in detail. For this reason, I would love to see this class become one of the unique places at Harvard that brings together students from across many disciplines to learn and care about these issues.","Prof. Rich is a wonderful professor, facilitates engaging and high-level conversation, and really makes each student feel comfortable in the course. The readings are fascinating and cover a broad range of literature. Be prepared to really think about how your papers fit into the narrative of the course.","Take it","I absolutely loved this course--Professor Rich ran seminar discussion seamlessly, bringing out the best in everyone's contributions. The readings were diverse and thought-provoking, and while eclectic, were in conversation with one another.","I thoroughly enjoyed the course materials and Professor Rich was a delight!","That this is an interesting course that will challenge you and enlighten you on the oppression that has gone on in history.","This is an excellent course that will teach you to think critically at the intersection of law and literature. Professor Rich leads exciting and intricate discussions that will motivate you to deeply consider topics such as human rights, the judicial structure, and the purpose of literature.","This class is by far one of the best I have taken at Harvard. Professor Rich is so incredibly smart and engaging. I walked out of every single class feely like I had looked at something in an entirely new way. This class really challenges you to stretch the limits of your understanding of how law and literature can function, but it is different and refreshing from my other classes here.","This is a really great class for humanities students interested in the law. Professor Rich is wonderful! You should definitely take this class!"]}},"mostRecentQ":{"overall":"4.80","workload":"5.60","difficulty":null,"recommendation":"4.90","enrollment":"16","response rate":"87.50","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}