{"scores":{"Fall '15":{"course_score":{"overall":"4.80","workload":"9.60","difficulty":null,"recommendation":"4.90","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"ENGLISH 298C","course_id":"12318","cat_num":"130908","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENGLISH 298C","course_id":"12318","cat_num":"130908","1s":"0","2s":"2","3s":"1","4s":"1","5s":"1"}},"instructor_scores":[{"number":"ENGLISH 298C","cat_num":"130908","course_id":"12318","year":"2015","term":"1","id":"b1effcd0137c87e90720c4f1ce188b60","first":" Amanda","last":"Claybaugh","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '15":{"comments":["Amanda cares deeply about her students' well-being as well as about their professionalization. Expect to be questioned intensely about your ideas, but expect to learn a lot about yourself (and your writing) in the process.","Take this class if your at all interested in the contemporary novel, or simply to get to know Amanda.","As advertised, the work that you put in to produce a solid 3000 word review essay will be greater than the work you do in most other classes.  It is well worth it.","This is an unusual but helpful class: half of the class is devoted to assigned reading, and the other half is devoted to individual research projects for which each student does his or her own reading. As such, the class meets half the time as a full seminar, and the other weeks as smaller workshops. What's great about this setup is that you learn just as much (if not more) about writing from reading and workshopping other students' papers than your own. This course was also really useful for thinking about how to write long-form, argumentative pieces that are not \"scholarly\" but accessible to a larger, non-academic readership.","If you have any interest in whatever is the subject of a seminar of Professor Claybaugh's, and you have time in your semester to do a lot of reading and writing, you absolutely will get a great deal out of taking it; this applies especially to any seminar of hers that is structured around the practice of writing a review or review-essay.","This course was absolutely fantastic.The discussions are fun and lively, the assignments are not too onerous but also well-timed so that you have outlines of drafts of your work done early in the semester. Amanda is extremely accessible and generous with her time, and will become very involved in your project, in a good way. It's rare to be able to discuss a seminar paper in so much detail with a professor. It's really helpful."]}},"mostRecentQ":{"overall":"4.80","workload":"9.60","difficulty":null,"recommendation":"4.90","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"ENGLISH 298C","course_id":"12318","cat_num":"130908","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"ENGLISH 298C","course_id":"12318","cat_num":"130908","1s":"0","2s":"2","3s":"1","4s":"1","5s":"1"}},"success":true}