{"scores":{"Fall '12":{"course_score":{"overall":"2.67","workload":"2.40","difficulty":"3.73","recommendation":"2.40","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.198","course_id":"1730","cat_num":"89893","1s":"1","2s":"7","3s":"4","4s":"2","5s":"1"},"QDifficulty":{"number":"EXPOS 20.198","course_id":"1730","cat_num":"89893","1s":"0","2s":"0","3s":"5","4s":"9","5s":"1"},"QWorkload":{"number":"EXPOS 20.198","course_id":"1730","cat_num":"89893","1s":"2","2s":"6","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.198","cat_num":"89893","course_id":"1730","year":"2012","term":"1","id":"2848c11ad6636b3b01ffdd4b45b430de","first":"James A.","last":"Dennen","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.07","AccessibleOutsideClass":"4.13","GeneratesEnthusiasm":"3.47","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Fall '12":{"comments":["Mind the instructor for this course. It also does not match the course description - if you expect to perform some improvisation in class or write reviews - don't. You are more likely to seek improvisation in anything and, basically, do performance studies.","The teacher was very chill, knowledgeable, enthusiastic, and helpful. Unfortunately, the subject material was not particularly interesting to me, and the course description was pretty inaccurate. I thought we would be watching lots of movies and improv shows, but that is definitely not the case.","This class has easy homework load compared to other classes. However, the class was pretty boring and not very enjoyable.","If you constantly work to improve yourself and put in your fullest effort in writing the papers, you will be rewarded.","It's not what it sounds like. Yes, it's about improvisation, but it's not about the theatrical improvisation that is normally thought of.","As it stands, this course is only for those with a specific interest in exploring the relationship between viewers and performers in a very meticulous, philosophical manner. For that reason, it's hard to recommend in general; I spent hours and hours agonizing over my essays because I was just not interested. However, if the aforementioned topics sound like your thing, then this course will probably knock your socks off. Jim is a funny, enthusiastic professor who cares a lot about his students, and he'll always do his best to help you out. Just be clear: you will not be doing any improv comedy, watching much contemporary improv, or focusing at all really on how to improvise or the history of improv. This is a course about what it means to \"perform\" in the loosest sense of the word, whether in real life, on stage, or in some vague space in between. The prescribed style of writing is very specific, and this is reflected in the readings as well, - this is not for the practically\/politically\/scientifically inclined.","The in-class time of this course is not very useful or helpful. The only beneficial part of this course is that you have to write multiple drafts and have to think critically about your own work - but this is true for any expos.","The readings often seemed unnecessary, and class discussions often seemed pointless.  However, Jim gives amazing feedback, and as much as I didn't like the section component of the class, Jim was an amazing teacher.","The professor's a really nice, helpful guy, but the class can be frustrating because you're not always sure what's being asked of you","This class is not what you assume it to be about. It is very abstract at times and requires a lot of energy. I feel similar expos classes can achieve the same without so much work.","Be open-minded when entering the class. This way, students will get the most out of the class and will be able to more thoroughly enjoy the material.","Dennen is an excellent teacher- he is extremely helpful, extremely intelligent (but also very approachable).  During one-on-one conferences it's so easy to bounce ideas off of him.  He's a great speaker, very descriptive in his comments.  I have learned so much about writing in this class, even though I considered myself to be a great writer even before this class.  Challenging but not difficult\r\nAs for the class, Pros: Not much reading, good excuse to watch improv comedy videos all day\r\nCons: the theoretical readings are sometimes very dense and not interesting, course material on the whole is simply not interesting (hard to find inspiration for essays sometimes)"]}},"mostRecentQ":{"overall":"2.67","workload":"2.40","difficulty":"3.73","recommendation":"2.40","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.198","course_id":"1730","cat_num":"89893","1s":"1","2s":"7","3s":"4","4s":"2","5s":"1"},"QDifficulty":{"number":"EXPOS 20.198","course_id":"1730","cat_num":"89893","1s":"0","2s":"0","3s":"5","4s":"9","5s":"1"},"QWorkload":{"number":"EXPOS 20.198","course_id":"1730","cat_num":"89893","1s":"2","2s":"6","3s":"6","4s":"1","5s":"0"}},"success":true}