{"scores":{"Spring '15":{"course_score":{"overall":"4.00","workload":"4.10","difficulty":null,"recommendation":"3.40","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"EXPOS 20.043","course_id":"11478","cat_num":"39891","1s":"0","2s":"2","3s":"3","4s":"4","5s":"3"},"QDifficulty":{"number":"EXPOS 20.043","course_id":"11478","cat_num":"39891","1s":"0","2s":"1","3s":"3","4s":"7","5s":"1"},"QWorkload":{"number":"EXPOS 20.043","course_id":"11478","cat_num":"39891","1s":"1","2s":"6","3s":"4","4s":"1","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.043","cat_num":"127271","course_id":"11478","year":"2014","term":"2","id":"c080d115a09846bd40f35b073033dfdd","first":" Jeffrey Robert","last":"Wilson","InstructorOverall":"3.90","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"3.30"}]},"Spring '14":{"course_score":{"overall":"3.70","workload":"2.40","difficulty":"3.70","recommendation":"4.10","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"EXPOS 20.043","course_id":"11478","cat_num":"39891","1s":"0","2s":"2","3s":"3","4s":"4","5s":"3"},"QDifficulty":{"number":"EXPOS 20.043","course_id":"11478","cat_num":"39891","1s":"0","2s":"1","3s":"3","4s":"7","5s":"1"},"QWorkload":{"number":"EXPOS 20.043","course_id":"11478","cat_num":"39891","1s":"1","2s":"6","3s":"4","4s":"1","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.043","cat_num":"39891","course_id":"11478","year":"2013","term":"2","id":"c080d115a09846bd40f35b073033dfdd","first":" Jeffrey Robert","last":"Wilson","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"3.70","ReturnsAssignmentsinTimelyFashion":"3.90"}]}},"comments":{"Spring '14":{"comments":["Professor Wilson is an incredible teacher, but you have to put a ton of work in yourself. Prepare a lot before each essay and plan it out very well. Prepare a lot before each conference. Find a classmate to review your paper (don't go to the Writing Center - having a peer read your paper will generally be a lot more helpful).\r\nThe class as a whole is amazing. You'll form your own opinions about Shakespeare and his impact on the current world.","I would tell future students that they should be aware that this class is less about the actual plays you read and more about learning how to write.","You should like Shakespeare.\r\nYou should like trying to find a logical argument in ambiguous and vague material\/prompts.\r\nWilson is a nice guy.","It's not actually about Shakespeare; it's about writing. That being said, Wilson is extremely qualified to talk about Shakespeare. Take this course if you love Shakespeare and detailed discussions of literature! It's hard, and Wilson will push you, but your writing will improve (especially if you read all of his handouts).","Wilson is an amazing instructor. He has a really great personality, which makes the expos process a lot more enjoyable. He teaches important concepts, and gives great feedback. Even if you think you don't like Shakespeare that much, take this class. I guarantee you will have a better appreciation for it by the end.","Expos will not be your favorite course.  However, Wilson is a helpful and engaging preceptor, and class is enjoyable as a result. It's quite a bit of work, but you have ample time to complete your assignments.","It helps to have some familiarity with Shakespeare going into this course, but it isn't necessary. It would also be helpful to have an enthusiasm for literary analysis. Given those two things, this course is a great way to improve your academic writing skills."]},"Spring '15":{"comments":["This is one of the better Exposes from what I can gather. Wilson's a good instructor, and the course material is interesting.","Since Expos is required, this is a good one to take.","If you enjoy writing about literature at all, you will enjoy this class. I was really depressed when I was first assigned to this class, because I'm not much of a humanities student, much less a Shakespeare enthusiast. But it ended up being my favorite class this semester. Dr. Wilson is an excellent teacher, and he really is passionate about the process of writing. He is very respectful and appreciative of all of his students' ideas and is a fair grader. The material of the class is always interesting, and you can pretty much write about any of your intellectual interests, since you just need to place it in the context of Shakespeare. It's rare that a freshman loves an Expos class; none of my friends seemed to enjoy their Expos classes as much as I did.","Professor Wilson is very enthusiastic and gives useful feedback on essays. This course will be more enjoyable if you love Shakespeare. You will learn a lot about the elements of academic writing.","Do not expect much writing guidance. For an Expos class, the instructor seemed to forget he was teaching how to write.","Wilson is a very effective teacher of this class, and has been teaching writing for a long time, so take advantage of his expertise, particularly outside of class. Go to office hours, they are extremely valuable.","If you enjoy Shakespeare it's a decent class to take since expos is a requirement either way. Expos in general is somewhat difficult just because points are only given for 3 papers total"]}},"mostRecentQ":{"overall":"4.00","workload":"4.10","difficulty":null,"recommendation":"3.40","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"EXPOS 20.043","course_id":"11478","cat_num":"39891","1s":"0","2s":"2","3s":"3","4s":"4","5s":"3"},"QDifficulty":{"number":"EXPOS 20.043","course_id":"11478","cat_num":"39891","1s":"0","2s":"1","3s":"3","4s":"7","5s":"1"},"QWorkload":{"number":"EXPOS 20.043","course_id":"11478","cat_num":"39891","1s":"1","2s":"6","3s":"4","4s":"1","5s":"0"}},"success":true}