{"scores":{"Fall '14":{"course_score":{"overall":"4.10","workload":"5.10","difficulty":null,"recommendation":"4.20","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"EXPOS 20.266","course_id":"12334","cat_num":"38779","1s":"0","2s":"0","3s":"2","4s":"6","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EXPOS 20.266","course_id":"12334","cat_num":"38779","1s":"0","2s":"8","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.266","cat_num":"38779","course_id":"12334","year":"2014","term":"1","id":"cd867bce4be4fc775bc02a1fe6804f39","first":" Richard Joseph","last":"Martin","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Fall '14":{"comments":["This is probably the coolest EXPOS out there. The topic is interesting, the professor is great, and the materials are fun.","The anthropological readings were extremely interesting, but unfortunately they only comprise about half of the class material. The required reading (which I assume is required for all Expos) is somewhat dry, and other than that, you also watch Harry Potter and Bewitched. Take this class if you have interest in writing and discussing Harry Potter or Bewitched, do not expect an in-depth analysis of how magic is constructed in societies unless you are willing to put in time and work for your own research project. Overall, the preceptor is very fun and the subject has potential to be academically interesting--you have a lot of freedom for the research paper, so everything depends on what you want out of the class.","This is a great section of Expos! Ricky is a great preceptor and very enthusiastic. He always provides thoughtful and very helpful comments on your work. You will get to read a number of interesting works on anthropology. The second essay is fun because you can apply this anthropology to either Harry Potter or Bewitched. Ricky designed the schedule of our section very well, so we had more time to work on our final project than other sections. If you are at all interested in anthropology or simply like witches\/wizards, this is a great expos for you!","It is a lot of work initially (front-loaded) but this is actually a good thing because you have so long for the final essay.","This course, although it does not focus on the witches of fantasy genres as much as it seems to, provides an overview of the actual figure of the witch in society, both modern and in fantasy. Do not expect to talk about the kind of magic of Harry Potter all the time, but still, get excited to watch a Harry Potter movie and an episode of Bewitched as an assignment! Ricky is very knowledgeable with anthropology and will show you a very different aspect of the witch. Just make sure to take advantage of the accessibility of Ricky's feedback and make sure to clarify the prompt for each assignment and know what's due next class!","Fun course to take for Expos. Richard Martin is a very enthusiastic teacher and makes class quite exciting.","It's a very interesting class with a passionate professor.","I would recommend Society and the Witch to anybody. Based on what Ive learned talking to students in other Expos sections, Society and the Witch is by far the best course to take. It was genuinely interesting, and Dr. Martin provides excellent feedback for every step of the writing process. My only objections to this class stem from the fact that I don't really like writing papers.","The classes and discussions are fun and enjoyable but it take a lot of work to reach the level of writing that is expected of you.","This class was fun to be a part of, but like any Expos class (I would imagine) you have to be interested in the material.  We read Harry Potter and watched Bewitched, so the content was easy to wrap my mind around, though for other people, it might have been less interesting to be writing papers about.","This is the BEST expos! Dr. Martin is a great professor, and it's so hard to go wrong with a class that focuses on Harry Potter and Bewitched as primary sources- if you're a nut for these kinds of works, take this class! You'll walk away with a new perspective."]}},"mostRecentQ":{"overall":"4.10","workload":"5.10","difficulty":null,"recommendation":"4.20","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"EXPOS 20.266","course_id":"12334","cat_num":"38779","1s":"0","2s":"0","3s":"2","4s":"6","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EXPOS 20.266","course_id":"12334","cat_num":"38779","1s":"0","2s":"8","3s":"1","4s":"0","5s":"0"}},"success":true}