{"scores":{"Spring '14":{"course_score":{"overall":"3.30","workload":"2.30","difficulty":"3.70","recommendation":"3.80","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"EXPOS 20.204","course_id":"1736","cat_num":"42426","1s":"0","2s":"3","3s":"4","4s":"3","5s":"2"},"QDifficulty":{"number":"EXPOS 20.204","course_id":"1736","cat_num":"42426","1s":"0","2s":"0","3s":"3","4s":"8","5s":"0"},"QWorkload":{"number":"EXPOS 20.204","course_id":"1736","cat_num":"42426","1s":"0","2s":"8","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.204","cat_num":"42426","course_id":"1736","year":"2013","term":"2","id":"bc80b981ee4d402ca2aa3b5ee7f7f730","first":" Erin Leigh","last":"Blevins","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"3.40","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"2.30"}]},"Spring '13":{"course_score":{"overall":"3.53","workload":"2.33","difficulty":"2.93","recommendation":"3.93","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.204","course_id":"1736","cat_num":"42426","1s":"0","2s":"3","3s":"4","4s":"3","5s":"2"},"QDifficulty":{"number":"EXPOS 20.204","course_id":"1736","cat_num":"42426","1s":"0","2s":"0","3s":"3","4s":"8","5s":"0"},"QWorkload":{"number":"EXPOS 20.204","course_id":"1736","cat_num":"42426","1s":"0","2s":"8","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.204","cat_num":"42426","course_id":"1736","year":"2012","term":"2","id":"bc80b981ee4d402ca2aa3b5ee7f7f730","first":" Erin Leigh","last":"Blevins","InstructorOverall":"3.93","EffectiveLecturesorPresentations":"3.73","AccessibleOutsideClass":"4.33","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.08","GivesUsefulFeedback":"3.33","ReturnsAssignmentsinTimelyFashion":"4.08"}]}},"comments":{"Spring '13":{"comments":["I found the classes not very engaging, lacking enthusiasm, and unmotivated.  I also found feedback on essays vague and not individualized.","I loved this class! It's super interesting subject material and it's not that difficult even though it's a science-based expos class. I would highly recommend it if this is something you're interested in and think you'll be doing more science writing in the future rather than humanities writing.","This is great, painless, interesting expos class","good course, just be prepared to not know the obscure science facts a lot of kids know","As an expos course, it's not too bad. The assignments are interesting and the readings are great(provided you like reading scientific journals). However, Erin's comments are usually not very helpful and she rarely addresses the real problems in your essay until after she has given it a final grade. This was very frustrating. \r\nHowever, if you're looking for a science-bases expos course, this is probably one of the best ones out there.","She does grade a bit tough, and again, be sure to start things ahead of time. Erin is willing to help you if you show her your work.","1. Definitely take it if you like biology\/evolution. \r\n2. Grading-wise, this one is good.\r\n3. Erin has such a nice personality.","Take it because there is not much reading.","It is a great way to fulfill the Expository Writing requirement if you prefer to have a scientific based class, and the Professor is well-informed in the subjects and available to work with you.","The subject matter is pretty interesting, so that's good for an expos class.","Many of my friends complained about their Expos courses, but Evolutionary Leaps was wonderful. Erin is a fantastic preceptor whose enthusiasm and very useful feedback made this a productive and fascinating writing course.","If you are very interested in evolutionary history, take this class. Keep in mind, 90% of the class will be pre-meds."]},"Spring '14":{"comments":["This class is on an interesting topic. The readings were very interesting and opened my eyes to new ideas regarding evolutionary biology. However, the actual writing portion of the class left much to be desired. Dr. Blevins wanted us all to write to a specific, uncreative style rather than having us focus on our own writing strengths and weaknesses. Also, comments from Dr. Blevins were rarely helpful for improving drafts.","Be sure to talk to the teacher and get constant feedback on your ideas.","This was an interesting expos class. The readings and assignments were fun at times, but the grading was seemingly arbitrary. It also took a long time to receive feedback on papers. Feedback from papers is an integral part of the course so that you can apply what you learned to your next paper. We missed out on that since we did not get feedback until just a few days before the final revision was due.","This class is definitely not the easiest expos out there, but do not let that deter you from taking it.  The topics are very interesting and your writing really will improve in this class.  Additionally, there is very little reading so if you don't like to read, this is a great option.  This class is definitely focused towards science minded students.","Take this class! Especially if you are interested in science. Dr. Blevins is readily available to help, and gives great feedback on assignments. Readings are not particularly heavy, and writings are interesting. Highly recommended as an Expos class.","If you prefer science-y writing, then definitely take this course. The writing and reading you are expected to complete is science-y, although at the end of the day there is still writing. Be prepared to spend a lot of time on your papers-- the grading is not easy and a lot of work goes into your revisions. But if you put the time and effort into your drafts, then the final papers will be better, and you will learn a lot more from this course. Also, the final paper for the course requires a lot of research, so start working on it early!!"]}},"mostRecentQ":{"overall":"3.30","workload":"2.30","difficulty":"3.70","recommendation":"3.80","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"EXPOS 20.204","course_id":"1736","cat_num":"42426","1s":"0","2s":"3","3s":"4","4s":"3","5s":"2"},"QDifficulty":{"number":"EXPOS 20.204","course_id":"1736","cat_num":"42426","1s":"0","2s":"0","3s":"3","4s":"8","5s":"0"},"QWorkload":{"number":"EXPOS 20.204","course_id":"1736","cat_num":"42426","1s":"0","2s":"8","3s":"3","4s":"0","5s":"0"}},"success":true}