{"scores":{"Fall '10":{"course_score":{"overall":"3.87","workload":"1.87","difficulty":"2.73","recommendation":"4.13","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.019","course_id":"1608","cat_num":"19374","1s":"1","2s":"2","3s":"1","4s":"5","5s":"6"},"QDifficulty":{"number":"EXPOS 20.019","course_id":"1608","cat_num":"19374","1s":"0","2s":"5","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"EXPOS 20.019","course_id":"1608","cat_num":"19374","1s":"4","2s":"9","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.019","cat_num":"19374","course_id":"1608","year":"2010","term":"1","id":"bb35b75883fdb5a463017bbb572976ef","first":"Tad","last":"Davies","InstructorOverall":"4.07","EffectiveLecturesorPresentations":"3.93","AccessibleOutsideClass":"4.07","GeneratesEnthusiasm":"4.08","FacilitatesDiscussionEncouragesParticipation":"3.92","GivesUsefulFeedback":"4.69","ReturnsAssignmentsinTimelyFashion":"2.38"}]}},"comments":{"Fall '10":{"comments":["This is a great Expos class!  There is not much work outside of the three papers, and each of the paper topics are fun and interesting to write about.  I learned writing skills by writing about topics I had not expected to explore in an academic setting - conspiracy films, campaign commercials, and architecture.  The preceptor is also great - he is very enthusiastic about the topic material and willing to give a lot of advice on the papers as long as you seek his help.","There is not much reading at all in this course. It is mostly analysis of movies, commercials, and architecture. There are some supplementary readings in the form of essays, but they max out at 30 or so pages and they aren't too bad. This class is fairly easy, interesting, and fun.","Pretty chill class. The topics are pretty interesting but it still involves writing.","This course is EXCELLENT.  Great preceptor and not as intense as the other Expos courses, from the horror stories many have told.  Coursework and essays are definitely manageable, especially if you have an interest in government.","Not a lot of reading but material can get dry.","Don't expect to learn anything.","This class approaches the study of the American government from non-traditional angles, in a very thought provoking and interesting way. The material explores the different ways that we can analyze democratic principles and the intention\/ purpose of government and its officials.","From what I hear of other expos classes, the best.","Tad is an awesome instructor! He returns drafts late, but he always gives you more time to complete the paper. Go to office hours - whenever I am stumped, he is very helpful.","For an expos class, this one is quite good. If you're at all interested in domestic politics and\/or social and political theory, it's worth taking.","Tad is an awesome and he creates a great learning environment"]}},"mostRecentQ":{"overall":"3.87","workload":"1.87","difficulty":"2.73","recommendation":"4.13","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.019","course_id":"1608","cat_num":"19374","1s":"1","2s":"2","3s":"1","4s":"5","5s":"6"},"QDifficulty":{"number":"EXPOS 20.019","course_id":"1608","cat_num":"19374","1s":"0","2s":"5","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"EXPOS 20.019","course_id":"1608","cat_num":"19374","1s":"4","2s":"9","3s":"2","4s":"0","5s":"0"}},"success":true}