{"scores":{"Spring '15":{"course_score":{"overall":"3.60","workload":"5.00","difficulty":null,"recommendation":"3.90","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.251","course_id":"12319","cat_num":"31549","1s":"0","2s":"1","3s":"1","4s":"9","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EXPOS 20.251","course_id":"12319","cat_num":"31549","1s":"2","2s":"9","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.251","cat_num":"110456","course_id":"12319","year":"2014","term":"2","id":"79b78442243fd2172688fdd0471cd27a","first":" Kevin","last":"Birmingham","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Fall '14":{"course_score":{"overall":"4.00","workload":"5.20","difficulty":null,"recommendation":"3.60","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.251","course_id":"12319","cat_num":"31549","1s":"0","2s":"1","3s":"1","4s":"9","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EXPOS 20.251","course_id":"12319","cat_num":"31549","1s":"2","2s":"9","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.251","cat_num":"31549","course_id":"12319","year":"2014","term":"1","id":"79b78442243fd2172688fdd0471cd27a","first":" Kevin Brian","last":"Birmingham","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Spring '15":{"comments":["This is a great expos class if you like art\/film. Kevin is a little intense, but he's brilliant, witty, and engaging during class and I really do think you learn a lot about both Pop and writing. Some of the reading is difficult to get through what with the criticism and theory, but some of it is really interesting, too!","You really have to be interested in the topic. It's not about pop music or pop culture, like I expected. We read The Crying of Lot 49, talk about Pop art and Andy Warhol, and watch Rocky Horror (which was a treat). Some people I know were disappointed by this but I liked it. Kevin is a cool guy but not much help when it comes to actual writing tips, though the Writing Center is an easy and great way to supplement this. You can easily get away with not doing all of the readings, and the readings are interesting for the large part so it's not excruciating (though again, you really have to be interested in the topic). Response papers are a joke, really the only real work involved is writing the actual draft and paper. All in all, a pretty low-maintenance Expos with interesting class discussions. I liked going to class every week.","This class uses great and entertaining subject matter and does its job teaching us about writing and the ways to improve our writing in a way that applies to many disciplines and skill sets.","The class is structured really well and things are spaced out nicely so it is important that you actually use the time given because there are no good excuses for not getting stuff done. Also it is important to do the readings because otherwise class will be awkward and you won't know what to write for your papers. Having a small background or some awareness of art history or art criticism is really helpful for the second and possibly third units.","It's expos. Probably not the best catch possible, but it isn't a bad option given how Expos is in general. If you're interested in modern art, it's a fun class to take. One of the main reasons I took it was that I didn't really appreciate Pop art and I wanted to give it a proper try, and to that end, it actually did succeed in helping me understand it. If you end up in the class, do go see the Rocky Horror screening at midnight--it's a great experience.","If you have any interest in pop culture or art this is an incredible expos.","Spend a lot of time making sure you understand the secondary readings, or else you will have a very hard time writing a good paper!","Rise of Pop is extremely dependent on how much you personally like the material. I enjoy Warhol, Rocky Horror, etc. so I enjoyed the course. If you weren't a fan of these, I would think it wouldn't be an enjoyable experience. My recommendation is dependent upon the student.","The material was generally interesting but there was a lot of reading sometimes.","The topic is interesting!"]}},"mostRecentQ":{"overall":"3.60","workload":"5.00","difficulty":null,"recommendation":"3.90","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.251","course_id":"12319","cat_num":"31549","1s":"0","2s":"1","3s":"1","4s":"9","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"EXPOS 20.251","course_id":"12319","cat_num":"31549","1s":"2","2s":"9","3s":"3","4s":"0","5s":"0"}},"success":true}