{"scores":{"Fall '14":{"course_score":{"overall":"4.60","workload":"6.00","difficulty":null,"recommendation":"4.40","enrollment":"17","response rate":"94.12","QCourseOverall":{"number":"FRENCH 180","course_id":"12020","cat_num":"4566","1s":"0","2s":"0","3s":"2","4s":"2","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRENCH 180","course_id":"12020","cat_num":"4566","1s":"1","2s":"9","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRENCH 180","cat_num":"4566","course_id":"12020","year":"2014","term":"1","id":"a71fd2c5965c593b69c06613fc55f773","first":" Alice","last":"Jardine","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Fall '14":{"comments":["Lectures were lengthy, mostly because of lack in class participation and the difficulty of the readings. These are practical issues. In the ideal setting, the material in this course is great, gives you unique perspective on both french and francophone culture, women and gender. Professor Jardine is hugely knowledgeable of the subject from experience.","This is a great survey of (as the title suggests) women writing in French. But beyond that, it's an amazing opportunity to explore what that really means through a transhistorical and trans-geographic lens.","This is an incredible gift of a course. I learned so much not only about the topic, but how to think about the world differently. Professor Jardine is the most incredible professor I have ever had- this course is worth taking just to listen to her incredible stories about brushing elbows with pretty much all of the major French philosophical thinkers of the latter half of the 20th century. The books were all wonderful. This course had little to nothing to do with my course of study here, but I know beyond a shadow of a doubt that it is one of the few I will carry with me for the rest of my life.","I loved this course. It may seem a little off the beaten path, but everything you read is wonderful, and you will learn a ton. Professor Jardine is incredible, and getting the chance to learn from her in such a small, intimate setting was amazing. I would definitely recommend it!","Alice is so cool and has great stories to tell. This is a fantastic class and there is no better way to delve into the stories of francophone women.","the semester long project was really enjoyable and section was wonderful","Learned about the diverse movements within the history of feminism in the francophone world, francophone concentrators must take this!","Alice Jardine is absolutely incredible.  Her wealth of personal stories enrich lively discussion around very important texts that everyone should read.  Take this class!","Professor Jardine is incredible, as is this class. It is a lot of reading, so be prepared for that, but it teaches you to think and view things in a very different way. I took this class as an elective","Alice Jardine is a fantastic professor who will change the way you think and talk about literature.","This class rocks-- it is definitely worth the work."]}},"mostRecentQ":{"overall":"4.60","workload":"6.00","difficulty":null,"recommendation":"4.40","enrollment":"17","response rate":"94.12","QCourseOverall":{"number":"FRENCH 180","course_id":"12020","cat_num":"4566","1s":"0","2s":"0","3s":"2","4s":"2","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRENCH 180","course_id":"12020","cat_num":"4566","1s":"1","2s":"9","3s":"5","4s":"1","5s":"0"}},"success":true}