{"scores":{"Fall '13":{"course_score":{"overall":"3.90","workload":"2.10","difficulty":"2.90","recommendation":"4.10","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"FRENCH 90w","course_id":"11101","cat_num":"40034","1s":"0","2s":"0","3s":"1","4s":"7","5s":"0"},"QDifficulty":{"number":"FRENCH 90w","course_id":"11101","cat_num":"40034","1s":"0","2s":"2","3s":"5","4s":"1","5s":"0"},"QWorkload":{"number":"FRENCH 90w","course_id":"11101","cat_num":"40034","1s":"2","2s":"3","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH 90w","cat_num":"40034","course_id":"11101","year":"2013","term":"1","id":"bcfe663dd4478715a2bbb4e6d64ef166","first":" Andreea","last":"Marculescu","InstructorOverall":"3.90","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"3.90","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Fall '13":{"comments":["You will definitely know french by the end of this course. I probably became better read in french in one semester than I am in English. The class is rewarding but comes with a lot of work.","This was a really fun class! I was worried about my French before, but this class was really helpful in improving reading, writing, and speaking. The reading can be overwhelming sometimes, especially if you miss a day. But overall, Andreea's feedbacks on papers were really helpful and she facilitated the class really well to make sure everyone would speak.","Good class! Definitely important to be proficient in French, the reading gets difficult as the semester progresses","Be prepared to read a lot and talk a lot.  The writing styles are varied and the discussions will follow closely what the authors write.  Come in being interested in both gender theory as well as French discussion.  Bring only one and this course won't be exciting; instead you'll find it either horribly boring or completely out of your league.","If you enjoy reading novels and analyzing texts, and you enjoy French, this is an excellent course for you. In a very intimate setting you get to discuss the texts and lead the conversations in what way you find is most interesting. Further, you are given a lot of freedom in choosing the topic of the response papers and final paper, meaning you can adapt the course and course material to what suits your interest.","A very doable class with interesting readings that span almost a 1000 years. Workload is pretty easy, if frequent, and Andreea is a very caring and helpful professor.","The professor for this course is not the most forthcoming at first glance. Give her a chance and stick it through. She is a nice Romanian lady who will teach you about bad women in Francophone lit and bake a cake at the end of the semester. Class overall is boring and sitting through an hour and a half of having about 7 kids talk about readings they didn't finish can be grueling. Grading is not unfair and she gives you leeway with many things. Lots of class requirements like a presentation, several response papers and a long final plus every hour bringing in of materials that have something to do with the present reading. Ambivalent about the whole thing. Can work for some. Not for others."]}},"mostRecentQ":{"overall":"3.90","workload":"2.10","difficulty":"2.90","recommendation":"4.10","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"FRENCH 90w","course_id":"11101","cat_num":"40034","1s":"0","2s":"0","3s":"1","4s":"7","5s":"0"},"QDifficulty":{"number":"FRENCH 90w","course_id":"11101","cat_num":"40034","1s":"0","2s":"2","3s":"5","4s":"1","5s":"0"},"QWorkload":{"number":"FRENCH 90w","course_id":"11101","cat_num":"40034","1s":"2","2s":"3","3s":"3","4s":"0","5s":"0"}},"success":true}