{"scores":{"Fall '15":{"course_score":{"overall":"4.70","workload":"4.20","difficulty":null,"recommendation":"4.90","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"FRENCH 176","course_id":"13006","cat_num":"160718","1s":"0","2s":"0","3s":"0","4s":"3","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRENCH 176","course_id":"13006","cat_num":"160718","1s":"0","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRENCH 176","cat_num":"160718","course_id":"13006","year":"2015","term":"1","id":"7d780578c65dae2d940df656c5a3cbb5","first":" Francoise","last":"Lionnet","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Fall '15":{"comments":["Take this class if you want to learn about one of the most beautiful and interesting as well as traditionally neglected corpus of aesthetic texts, from the Americas to the Indian Ocean, within a postcolonial frame that restores it accurately, and with the guidance of a pundit in the field.","A great course if you're interested in imperialism, decolonization, history, human rights and\/or reading excellent texts. The best part was the discussion with one of the authors whose book we read and a filmmaker whose film we watched-both of the guest speakers were so smart and interesting and very cool to talk to.","Excellent course and professor. Professor Lionnet is an expert in her field and incredibly generous with students. A gifted mentor, writer, communicator.","I always looked forward to coming to class, to the incessant intellectually charged conversations that the readings and teaching staff fostered. I would recommend the class to anyone interested in learning about postcolonial literature. The readings were available in both french and english so that course was available to anyone interested in the material regardless of their proficiency in french. Overall, I left this course with a better appreciation of postcolonial literature along with a framework to fully grasp the contextual elements that gave rise to this segment of world literature. Now, stop reading this and go shop the class!","Excellent exposure to the non-European Francophone world with an extremely knowledgeable and enthusiastic professor","If you are studying french literature or literature at all this is a fantastic and really important class that you should definitely take. Also if you study anything to do with politics, history or racial identity this would be a great class!"]}},"mostRecentQ":{"overall":"4.70","workload":"4.20","difficulty":null,"recommendation":"4.90","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"FRENCH 176","course_id":"13006","cat_num":"160718","1s":"0","2s":"0","3s":"0","4s":"3","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRENCH 176","course_id":"13006","cat_num":"160718","1s":"0","2s":"6","3s":"0","4s":"0","5s":"0"}},"success":true}