{"scores":{"Fall '12":{"course_score":{"overall":"4.58","workload":"1.25","difficulty":"2.00","recommendation":"4.67","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"FRSEMR 25j","course_id":"1797","cat_num":"33875","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"FRSEMR 25j","course_id":"1797","cat_num":"33875","1s":"4","2s":"4","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 25j","course_id":"1797","cat_num":"33875","1s":"9","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 25j","cat_num":"33875","course_id":"1797","year":"2012","term":"1","id":"60482a013458cbd8f309cd614226f4ba","first":"Jonathan","last":"Losos","InstructorOverall":"4.83","EffectiveLecturesorPresentations":"4.58","AccessibleOutsideClass":"4.36","GeneratesEnthusiasm":"4.83","FacilitatesDiscussionEncouragesParticipation":"4.58","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Fall '12":{"comments":["Have fun :D you're going to enjoy this course","What a great way to dive into OEB in my first semester! If you're considering a Freshman Seminar (which I definitely recommend), then this is a great choice. Prof. Losos and our TF Alexis were wonderful guides to the study of evolution and made the class fun and relaxed, yet still focused and informative--exactly what a Freshman Seminar should be. This is an excellent introduction to the study of evolution, and the opportunity to focus in on a subject as specific as lizards in your first semester is rare. We only met once a week, and I think we all felt that it wasn't enough. It was great to be able to get off campus with our field trips, too!\r\n\r\nCompared with what I've heard about other Freshman Seminars, it sounds like we hit the jackpot. Because our only assignments were readings (and a final paper), we really got to enjoy the topics and share our enthusiasm with each other, which would be more difficult with the stresses of additional assignments. If you're interested in animals and\/or studying OEB and want to spend time with some wonderful, inspiring people, then you should definitely take this class.","FANTASTIC CLASS! Most fun seminar you could possibly take. I don't regret this at all!. Amazing professor and great field trips! Take this if you're interested in learning about something cool. I never thought I'd like lizards before this class.","Lizards are awesome! Even if you don't know a thing about them before the course, like me, you will still come to appreciate squamates and what the study of them can contribute to the advancement of scientific knowledge.","If you have any love of lizards or even just evolutionary biology, take this seminar! Professor Losos and Alexis are absolutely wonderful people who really facilitate discussion and interest in lizards.  I came into this seminar just kind of interested in lizards, but after this semester I absolutely love them!  Be prepared, the classes can be a little on the long side and the final project (10 pages!) can be a whopper if you don't start early enough, but I would definitely recommend this seminar.","If you love wildlife (especially lizards), take this class!!  It is awesome!  It is not very much work, and is a great introduction to the EOB field, with live demonstrations, field trips, and really interesting articles.  Do not expect to get a thorough, comprehensive overview of evolution --- this is a seminar on lizards in all of their amazing diversity.","This course will open your eyes to a whole new world when it comes to how you think about lizards and animals in general.","Be prepared for long classes were you must push to stay focused for a few hours. However, if you do come prepared, the classes can be a real joy.  The field trips are awesome, and Professor Losos is extremely interesting to talk to; he knows everything there is to know about evolutionary biology and has some great stories to boot.","If you have a strong interest in lizards or herpetology, you HAVE to take this class.  Professor Losos is THE expert when it comes to anoles and he has a fascinating perspective on the field as a whole.  If you are not obsessed with lizards (I was not), the class is still very interesting and is a great introduction to evolutionary biology.  There is no work other than the readings, which are sometimes difficult but worthwhile.","This class is fantastic. I went in with no interest in lizards and only a vague interest in evolutionary biology, and came out fully intending to get a pet snake and almost considering changing my planned concentration from CPB to OEB. Our readings were interesting, class discussions always lively, and our field trips were awesome.","Very good at making people like lizards. Also very good at introducing genetics and physiology of lizards to people."]}},"mostRecentQ":{"overall":"4.58","workload":"1.25","difficulty":"2.00","recommendation":"4.67","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"FRSEMR 25j","course_id":"1797","cat_num":"33875","1s":"0","2s":"0","3s":"0","4s":"5","5s":"7"},"QDifficulty":{"number":"FRSEMR 25j","course_id":"1797","cat_num":"33875","1s":"4","2s":"4","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 25j","course_id":"1797","cat_num":"33875","1s":"9","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}