{"scores":{"Spring '16":{"course_score":{"overall":"4.70","workload":"2.20","difficulty":null,"recommendation":"4.80","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 22H","course_id":"13490","cat_num":"159990","1s":"0","2s":"0","3s":"0","4s":"3","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 22H","course_id":"13490","cat_num":"159990","1s":"4","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 22H","cat_num":"159990","course_id":"13490","year":"2015","term":"2","id":"0d97e1f2d75e62b83823ab2691af9f03","first":" Giovanni","last":"Parmigiani","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Spring '16":{"comments":["Do the elective readings","Amazing course!!! Chill seminar and interesting content. Learned a lot in a interesting way. 10\/10 recommend.","This seminar is wonderful! Although it was the first year the seminar was taught, it ran super smoothly. The readings were all very interesting and the  format of the class let us explore the topic more in detail. This seminar is not excessively time consuming, and we even went on a field trip to the hospital to see a genetic counseling session, which was very cool. I would highly recommend this seminar.","This seminar is great! Dr. Parmigiani is so fun and a great professor. Not too much work if looking for a good balance in your schedule (weekly readings\/class discussions\/one final paper\/presentation) but all very manageable. We took an awesome field trip to mass general hospital where we got to meet with a genetic counselor and go through a mock session. Very cool class if you want to have interesting discussions about the morals and science of genetic counseling and gene editing with regard to  statistics.","Very informative class with a fantastic professor. You will become very close with those in the class with you. Great time.","TAKE THIS SEMINAR! If you're interested in any aspect of cancer and genetic diseases you'll take away much more. The class allows you to learn from your classmates and the amazing prof! The field trip was mind blowing and you'll appreciate not having that much work (especially if you're taking other hard classes). Beware, most kids who take this are premed\/know science so if you don't you might feel disadvantaged. If you do know science then you might find it too elementary sometimes."]}},"mostRecentQ":{"overall":"4.70","workload":"2.20","difficulty":null,"recommendation":"4.80","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 22H","course_id":"13490","cat_num":"159990","1s":"0","2s":"0","3s":"0","4s":"3","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 22H","course_id":"13490","cat_num":"159990","1s":"4","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}