{"scores":{"Fall '15":{"course_score":{"overall":"4.60","workload":"1.40","difficulty":null,"recommendation":"4.50","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"FRSEMR 31L","course_id":"13053","cat_num":"159738","1s":"0","2s":"0","3s":"0","4s":"3","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 31L","course_id":"13053","cat_num":"159738","1s":"8","2s":"0","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 31L","cat_num":"159738","course_id":"13053","year":"2015","term":"1","id":"17ca3a66be3f7e8654d22e7d35391b31","first":" Thomas Forrest","last":"Kelly","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Fall '15":{"comments":["Nothing is more priceless than seeing people's bemused reactions when you tell them you take Gregorian Chant.","This is a niche class that is highly rewarding if you are genuinely interested in the topic at hand: the *history* of Gregorian Chant, as well as the *singing* of this chant. If anything, it is a fantastic, once-in-a-lifetime chance to get close with Professor Kelly, Harvard's top musicologist and a genuinely kind, brilliant teacher. Amazing that he's willing to teach a seminar!","This class was incredibly interesting and fun.  I entered the course without much experience with chant, and by the end of the course, I had learned its history, its nuances, its structure, and was (and still am) able to sing several pieces by sight and by memory.","This was a great freshman seminar! It was fascinating to learn about not only the history of Gregorian Chant, but also about the musical elements. It was interesting to study how Gregorian Chant has influenced music today. We had the opportunity to study Gregorian Chant manuscripts in the Houghton Library several times, and to sing in Memorial Church. If you are interested in music or medieval history, I highly recommend taking this seminar.","This class provides a great introduction to studying music with some formality in a beautiful repertoire everybody comes to appreciate much more as they study it!","This class can get a bit dull occasionally if you don't know or aren't into music theory, but on the whole it's very interesting. You learn a lot about the important religious and cultural phenomenon that Gregorian Chant is, both as part of the Middle Ages and as the basis for modern music. You get to sing from original manuscripts that are almost 1000 years old too, which is awesome.","It's awesome, but be ready for a lot of Gregorian Chant."]}},"mostRecentQ":{"overall":"4.60","workload":"1.40","difficulty":null,"recommendation":"4.50","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"FRSEMR 31L","course_id":"13053","cat_num":"159738","1s":"0","2s":"0","3s":"0","4s":"3","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 31L","course_id":"13053","cat_num":"159738","1s":"8","2s":"0","3s":"0","4s":"0","5s":"0"}},"success":true}