{"scores":{"Spring '14":{"course_score":{"overall":"3.80","workload":"1.20","difficulty":"2.20","recommendation":"4.00","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"FRSEMR 23s","course_id":"10795","cat_num":"8910","1s":"0","2s":"1","3s":"3","4s":"4","5s":"3"},"QDifficulty":{"number":"FRSEMR 23s","course_id":"10795","cat_num":"8910","1s":"1","2s":"7","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 23s","course_id":"10795","cat_num":"8910","1s":"9","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 23s","cat_num":"8910","course_id":"10795","year":"2013","term":"2","id":"7986ba287692e8cf83870453979684dc","first":" Daniel","last":"Schacter","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '14":{"comments":["This is a class that will change the way you see the world (at least a little bit). After taking it the way I think about memory has completely changed. The readings are interesting, even if some of the studies can be a bit tough to get through, and Professor Schacter does a great job of facilitating real discussions in class and making sure that student-led discussions are more than just a stilted review of the week's readings.","The ideas of this class are very interesting. the seven sins of memory is a very interesting topic that you would not normally learn in another class, unless you were a psych concentrator. The readings are interesting and the case studies are especially interesting. However, the classes are kind of boring because all we do is talk about the course readings and it's two hours of talking about the same thing.","Incredible class!  the topic was so interesting and the fact that our teacher was the very man who created the ideas that we were learning about was amazing.  He wrote the books we studied! You can't be in a better situation than that.","best psych class at harvard! very engaging, does not take to much time.","If you are at all interested in memory, definitely take this class, because there is nobody better to ask questions about memory than Dr. Schacter.","If you are very interested in memory, the subject and readings will be fascinating and you will get to know a very accomplished professor. Class is best if you do the readings, and it tends to drag on as the semester progresses. If you make an effort to know Prof. Schacter, he will reciprocate.","If you are interested in the subject, it is a great class to take.","You'll enjoy this class if you're interested in memory.  Classes are generally centered around discussing papers and the readings so if that seems tedious, I'd choose another seminar.  But Professor Schacter is extraordinarily knowledgeable and helpful!","This class really is great; every week we had interesting and engaging discussions about memory, a topic that applies from all of us. Learning from Schacter, an expert in his field, was a really great experience."]}},"mostRecentQ":{"overall":"3.80","workload":"1.20","difficulty":"2.20","recommendation":"4.00","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"FRSEMR 23s","course_id":"10795","cat_num":"8910","1s":"0","2s":"1","3s":"3","4s":"4","5s":"3"},"QDifficulty":{"number":"FRSEMR 23s","course_id":"10795","cat_num":"8910","1s":"1","2s":"7","3s":"3","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 23s","course_id":"10795","cat_num":"8910","1s":"9","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}