{"scores":{"Spring '16":{"course_score":{"overall":"4.20","workload":"1.30","difficulty":null,"recommendation":"4.30","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"FRSEMR 22C","course_id":"13774","cat_num":"159838","1s":"0","2s":"0","3s":"2","4s":"6","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 22C","course_id":"13774","cat_num":"159838","1s":"9","2s":"1","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 22C","cat_num":"159838","course_id":"13774","year":"2015","term":"2","id":"26276ae631e0d68e77799a2029fc1cfc","first":" Jon","last":"Clardy","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '16":{"comments":["Dr. Clardy is a really good teacher and is really funny (in the dry kind of way). I really enjoyed this course -- it was the first time it was taught and was still really good. He took us out to dinner at the end which was really fun (we saw Stephen Hawking there) -- he's a really interesting person and I really recommend taking his course\/getting to know him. There's very little work (just a couple readings every few weeks that he \"recommends\" you do - he's really understanding about people having other work\/midterms too, and a couple assignments that take <10 minutes.","This was Clardy's first year doing the course so it was a little rough around the edges.  The subject matter is super interesting and I definitely learned a lot, but I don't think the class lived up to its potential.  I'm sure with experience from this year it will be much better next year.\r\nClardy's lectures can be a little sleepy (he's pretty quiet) but are interesting if you pay attention.  Not many assignments so if you're looking for something easy this is a good one.","This class was a great low-stress introduction to neurobio. The weekly readings and problem sets (a term I use lightly since they usually only had 3 questions) were all helpful to understanding the course material. The seminars themselves could be a bit long, as there were no breaks, but overall the material was very interesting. And the course is absolutely true to its title - the first day we discussed opium poppies in Babylon and the last day we watched a short clip from Breaking Bad.","This class really interesting and a great introduction to neuropharmacology in a really fun way.","The seminar may be a little slow at the beginning, but it is a fun time when people start to speak out more in the seminar. He is very willing to help you learn if you ask him any questions and he is willing to speak about anything with you. He is very knowledgable and has a greats sense of humor on a very interesting topic.","A very interesting course where you can learn how drugs affect the brain.","Dr. Clardy is such a great guy, and what he teaches is legitimately interesting if you are into chemistry and the brain.  Definitely take it."]}},"mostRecentQ":{"overall":"4.20","workload":"1.30","difficulty":null,"recommendation":"4.30","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"FRSEMR 22C","course_id":"13774","cat_num":"159838","1s":"0","2s":"0","3s":"2","4s":"6","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 22C","course_id":"13774","cat_num":"159838","1s":"9","2s":"1","3s":"0","4s":"0","5s":"0"}},"success":true}