{"scores":{"Fall '14":{"course_score":{"overall":"4.80","workload":"3.10","difficulty":null,"recommendation":"4.80","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 49g","course_id":"10849","cat_num":"1208","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"FRSEMR 49g","course_id":"10849","cat_num":"1208","1s":"0","2s":"3","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 49g","course_id":"10849","cat_num":"1208","1s":"3","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 49g","cat_num":"1208","course_id":"10849","year":"2014","term":"1","id":"13548845a4d25d8736fd01d1e9976142","first":" Kevin","last":"Madigan","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Fall '13":{"course_score":{"overall":"5.00","workload":"2.00","difficulty":"2.20","recommendation":"4.80","enrollment":"4","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 49g","course_id":"10849","cat_num":"1208","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"FRSEMR 49g","course_id":"10849","cat_num":"1208","1s":"0","2s":"3","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 49g","course_id":"10849","cat_num":"1208","1s":"3","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 49g","cat_num":"1208","course_id":"10849","year":"2013","term":"1","id":"13548845a4d25d8736fd01d1e9976142","first":" Kevin","last":"Madigan","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '13":{"comments":["This course is one of the best that I have ever taken!  Professor Madigan is incredibly knowledgeable and kind.  I loved the discussion nature of the course.  You should definitely take this freshman seminar!","This class is amazing... take it! This was my favorite 2 hours of the week. Professor Madigan is fantastic and is such a wonderful mentor. What a great class!","This class is really great and thought inspiring.  Professor Madigan is a wonderful professor who leads really great discussion about really fascinating readings."]},"Fall '14":{"comments":["This course is great and I definitely recommend it to anyone interested in the Holocaust and this time period, or to anyone who just wants to learn more about this subject. The class is incredibly engaging and utilizes various different mediums to tell the story of the Holocaust, such as film, fictional literature, interviews, and historical documents. The class allows for great discussion and Professor Madigan is a great professor. I definitely recommend taking this course.","The class is really interesting and Professor Madigan is a great teacher and keeps you engaged the whole time.","This class is fantastic. The only work during the semester is interesting readings, and the discussions in class are usually very interesting. The final project can be a bit annoying. You will learn a lot about the Holocaust, which is fascinating from the psychological perspective in the midst of its abject horribleness.","Class is taught by an amazing professor and includes great discussions.  Classes periodically get a little boring, but if you are interested in the topic, most classes are awesome.","This is a solid, good seminar. The material is obviously emotionally charged, so be prepared when you walk into the two hour course for some serious moments. While you won't walk out of class chipper everyday, it is a very enriching experience. Madigan is a great guy. He is very understanding of any personal circumstances and very approachable. Perfect to take your freshman fall. Although you don't have to put in tons of time, you get a lot out of the course. While I there are 12 assigned books in the course, you don't have to read everyone word for words, so the work level is really manageable. A great freshmen seminar!","You must be able to handle more emotional and disturbing aspects of the Holocaust and have a true passion for the subject.","Prof. Madigan is delightful- he presents the course as a discussion-based, enjoyable seminar and conducts the class that way. This course provided a nice break from my heavy-workload courses.","Take this course if you have any interest in the Holocaust.  It is not that difficult, and it is extremely interesting."]}},"mostRecentQ":{"overall":"4.80","workload":"3.10","difficulty":null,"recommendation":"4.80","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 49g","course_id":"10849","cat_num":"1208","1s":"0","2s":"0","3s":"0","4s":"2","5s":"7"},"QDifficulty":{"number":"FRSEMR 49g","course_id":"10849","cat_num":"1208","1s":"0","2s":"3","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 49g","course_id":"10849","cat_num":"1208","1s":"3","2s":"6","3s":"0","4s":"0","5s":"0"}},"success":true}