{"scores":{"Spring '16":{"course_score":{"overall":"4.10","workload":"3.20","difficulty":null,"recommendation":"4.20","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"FRSEMR 40H","course_id":"13852","cat_num":"159742","1s":"0","2s":"0","3s":"3","4s":"2","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 40H","course_id":"13852","cat_num":"159742","1s":"4","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 40H","cat_num":"159742","course_id":"13852","year":"2015","term":"2","id":"e6a1f7aae55e8fe94912d09bb6c5f3cd","first":" Nathan","last":"Nunn","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"3.90","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.30"}]}},"comments":{"Spring '16":{"comments":["If you are looking for a seminar with no work and is just a time filler this is not it. However, if you have an interest in economics this is a great class. Proffesor Nunn is extremely smart and passionate about development. With that said, the workload really isn't bad its just a bit more than what I expected. It's just weekly readings and a paper with a presentation at the end.","This course focuses a on how economic theory applies to overarching themes of underdevelopment. You should not expect super exciting case studies or many pictures\/videos.","Will teach you an entirely new way of thinking about economic issues.","Worth it if you're really interested in the material, but the two hour class each week can get quite boring.","This is a wonderful seminar if you are interested in economic development! Professor Nunn is a great teacher, and gives interesting presentations on particular aspects of development each week. I have definitely learnt a lot.","Take it if you are interested in Development Economics and a broad overview of international development from an economist's perspective.","If you're looking for a \"warm and fuzzy\" freshman seminar where you sit around and eat cookies and talk about your feelings, this is not that (although Prof. Nunn did bring quite a spread of Starbucks coffee and pastries for our final class). However, I highly recommend the course and found the material very pertinent and interesting. Much more application-based than the purely theoretical intro\/macro courses, a lot of economic history, and a good bit of behavioral ec, which I liked and now plan to pursue further. Also good in that the professor did not act like he had all the answers to solve the world's ills - one of the major takeaways from the class was that poverty and development are far more complicated issues than usually presented, and no one has all the answers, nor is there a silver bullet solution, which is quite a refreshing thing to hear from a Harvard professor."]}},"mostRecentQ":{"overall":"4.10","workload":"3.20","difficulty":null,"recommendation":"4.20","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"FRSEMR 40H","course_id":"13852","cat_num":"159742","1s":"0","2s":"0","3s":"3","4s":"2","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 40H","course_id":"13852","cat_num":"159742","1s":"4","2s":"5","3s":"0","4s":"0","5s":"0"}},"success":true}