{"scores":{"Fall '14":{"course_score":{"overall":"4.70","workload":"1.60","difficulty":null,"recommendation":"4.80","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 26o","course_id":"12358","cat_num":"31229","1s":"0","2s":"0","3s":"0","4s":"4","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 26o","course_id":"12358","cat_num":"31229","1s":"10","2s":"1","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 26o","cat_num":"31229","course_id":"12358","year":"2014","term":"1","id":"4d1bbc241f46c4f2cf0e395ed530747c","first":" Paola","last":"Arlotta","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '14":{"comments":["This isn't a structured \"class\" in the familiar sense. It's a seminar that is designed to be low-stress with little difficulty, and inspire students with the craziest stuff coming out of laboratories (and sci-fi) in the modern world.","Good seminar for freshman year. Helps you ease into your first semester. Paola is a great professor!","This class was so laid back and fun. I would recommend it to anyone interested in neuroscience or regenerative biology.","This was the best class I took this semester. It was unlike any science class I'd taken before in that it encouraged me to think creatively about science.","Paola is super nice and passionate about the material. Discussions in class were interesting, and we took a cool field trip to the Wyss Institute in Boston. The readings outside of class were difficult to understand, but I got the main points from them through class discussion. Also, I felt that we skipped over the basics and jumped right into a high level of scientific discussion. This made me feel less prepared to tackle some of the more challenging concepts. Overall, this course was interesting and not stressful. It really gets you thinking and challenges you to think creatively.","This class was fantastic, super interesting without being stressful or difficult!","This was an excellent freshman seminar!  The material was very interesting, and Professor Arlotta was a great teacher.  We had a say in what we learned about and talked about current discoveries in the science field.","Paola is an amazing professor. She obviously works hard and values your opinion. This seminar is discussion based (as it should be), a low pressure environment (as it should be), and a wonderful learning experience - as only Paola could make it. \nI enjoyed every meeting and this class was exactly what i hoped college would be. I could get to talk to a world class professor and talk about what could be in the world of neuroscience.","Take this class to spark in you a powerful imagination of what secrets are held in the last frontier and one of the most mysterious aspects of the universe: the brain.\nAnd how to regenerate one, if possible."]}},"mostRecentQ":{"overall":"4.70","workload":"1.60","difficulty":null,"recommendation":"4.80","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 26o","course_id":"12358","cat_num":"31229","1s":"0","2s":"0","3s":"0","4s":"4","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 26o","course_id":"12358","cat_num":"31229","1s":"10","2s":"1","3s":"0","4s":"0","5s":"0"}},"success":true}