{"scores":{"Fall '14":{"course_score":{"overall":"4.60","workload":"5.10","difficulty":null,"recommendation":"4.40","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"FRSEMR 36z","course_id":"12369","cat_num":"50374","1s":"0","2s":"0","3s":"0","4s":"3","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 36z","course_id":"12369","cat_num":"50374","1s":"1","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 36z","cat_num":"50374","course_id":"12369","year":"2014","term":"1","id":"6e244a48614a6c8b155a42c9895e0852","first":" Christine Sang-Ah","last":"Lee","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"3.90"}]}},"comments":{"Fall '14":{"comments":["The course is very enjoyable. Be prepared to do a lot of course readings and blogs.","Exploring the nature of monstrosity and human nature through literature in this seminar is interesting and worthwhile. Not only will you have the opportunity to read a wide variety of notable texts and plays, but you'll have the chance to learn more about our own society as well.","Very manageable yet interesting class to take. The readings are very well chosen.","I loved Monstrous Literature! As a prospective Social Sciences concentrator interested in morality and infatuated with books, this course satiated my literary appetite while also making me grapple with philosophical questions that are pertinent to governance: Who determines what is good and evil? Is \"monstrosity\" contingent upon history?","It is a lot of reading, but the books are good and the discussions are very interesting and worthwhile.","It needs more time than a Freshman Seminar should because of the readings. However, it is also possible to get away with not doing the readings - but then you won't get as much from the course as you should.","If you are seriously interested in the general subject of this course and enjoy close reading passages, then I recommend that you consider enrolling in this seminar. Though some of the books can be a bit dense (Spenser comes to mind), the works as a whole are fascinating. The course falls into a nice rhythm, consisting primarily of weekly blog responses and class discussions. If you're worried that some of the texts look inaccessible, know that you will be provided will helpful reading notes written by the instructor. \n\nSome warnings: don't take this course if you do not think that you will be able to keep up with the reading. While you may be able to get by, the classroom discussions will not be nearly as enlightening. The reading pace was quite fast for a seminar (one book a week), so make sure you don't start the reading the night before.\n\nDon't let the daunting length of the essays discourage you from taking the course. There is a lot of help available, and if you start early then you will have more than enough time to get the work done. Again, as long as you're interested in the subject (the course title got you excited), you don't have anything to worry about."]}},"mostRecentQ":{"overall":"4.60","workload":"5.10","difficulty":null,"recommendation":"4.40","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"FRSEMR 36z","course_id":"12369","cat_num":"50374","1s":"0","2s":"0","3s":"0","4s":"3","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 36z","course_id":"12369","cat_num":"50374","1s":"1","2s":"5","3s":"1","4s":"0","5s":"0"}},"success":true}