{"scores":{"Spring '16":{"course_score":{"overall":"2.80","workload":"1.80","difficulty":null,"recommendation":"3.10","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 41C","course_id":"13631","cat_num":"159807","1s":"1","2s":"2","3s":"5","4s":"2","5s":"0"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 41C","course_id":"13631","cat_num":"159807","1s":"7","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 41C","cat_num":"159807","course_id":"13631","year":"2015","term":"2","id":"77ffed0ff6ba63862f7a3bd6b3205e91","first":" Theodore C","last":"Bestor","InstructorOverall":"3.20","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"3.30","GeneratesEnthusiasm":"3.30","FacilitatesDiscussionEncouragesParticipation":"3.00","GivesUsefulFeedback":"2.80","ReturnsAssignmentsinTimelyFashion":"2.30"}]}},"comments":{"Spring '16":{"comments":["It is definitely an interesting topic and professor Bestor is an expert in his field. The class lacks coherence, but it is easy to find a way to tailor it to your own specific interests. It is not challenging, but definitely a good addition to a challenging course load.","Talk. It makes the time go by more quickly","Don't take FSem 41C, unless you're really passionate about learning about oceans, since the culture part of this course is severely lacking. We didn't talk about pirates, ocean mythology, colonial settlements, modern-day fishing, etc.","Great course, great discussions","This course is relatively easy and somewhat engaging. I wouldn't rate it as particularly good or bad. Minimal work.","My caveat in how I critique this course is that it is new. Unfortunately, that is as generous as I can be. Professor Bestor and TF Andrew were both kind people but highly ineffective educators. Boring lectures, lackluster discussions\/readings (We spent an entire week on cod. Cod!): the only saving grace was that we frequently got out an hour to an hour and a half early because the professor could not fill the time. They arranged for us to tour the Peabody archives, which was by far my favorite day. That would be a good avenue for changing this course. However, I would advise that it not be offered in the future. Look elsewhere for a seminar, or just pass\/fail a random class that you would actually enjoy. A serious waste of a course.","Don't take this class expecting to become a scholar on oceans and cultures, but certainly enroll if you're interested in the subject.  Like any freshman seminar, the workload is very light and certainly not prohibitive."]}},"mostRecentQ":{"overall":"2.80","workload":"1.80","difficulty":null,"recommendation":"3.10","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 41C","course_id":"13631","cat_num":"159807","1s":"1","2s":"2","3s":"5","4s":"2","5s":"0"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 41C","course_id":"13631","cat_num":"159807","1s":"7","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}