{"scores":{"Fall '14":{"course_score":{"overall":"4.20","workload":"2.70","difficulty":null,"recommendation":"4.20","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"FRSEMR 41k","course_id":"12383","cat_num":"56418","1s":"0","2s":"0","3s":"2","4s":"2","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 41k","course_id":"12383","cat_num":"56418","1s":"4","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 41k","cat_num":"56418","course_id":"12383","year":"2014","term":"1","id":"82bc8c95c5a6d7a2068ce9e90164439f","first":" Susan H.","last":"Farbstein","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '14":{"comments":["It's good but the not the life-changing experience that the College says Freshmen Seminars can be. Susan is great, the material interesting enough and it's not difficult but it won't change your life. It will make you think more critically about the human rights campaigns you see all around you and international politics\/bodies in general.","If you're interested in law, human rights, or if you just find this topic interesting you'll love this seminar. Sometimes the readings can be a bit dry but studying the same material Harvard Law students would be reading is really cool! Even if you think you already know a lot about human rights advocacy this seminar presents critiques of modern approaches and hypothetical solutions as well. This was definitely the most applicable and memorable classes of my freshman year.","This course isn't to give you a history lesson. Yes you will learn about issues and conflicts but it's not the main part of the course. If you take it make sure you want to learn about legal issues and ways to get involved. This is not the course where you learn how to be a grassroots organizer but you do learn techniques and best practices that you can apply later.","Take this class! Susan Farbestein is an absolutely amazing professor and you'll love the course!","This is a great seminar that is really interesting but does not require a ton of work which is a nice way to ease into your freshman fall. Professor Farbstein is SO knowledgeable and it was really great getting to know her and learn about all of the incredible work she has done on all of these topics."]}},"mostRecentQ":{"overall":"4.20","workload":"2.70","difficulty":null,"recommendation":"4.20","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"FRSEMR 41k","course_id":"12383","cat_num":"56418","1s":"0","2s":"0","3s":"2","4s":"2","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 41k","course_id":"12383","cat_num":"56418","1s":"4","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}