{"scores":{"Fall '15":{"course_score":{"overall":"4.30","workload":"3.20","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"FRSEMR 34C","course_id":"13332","cat_num":"160199","1s":"0","2s":"0","3s":"3","4s":"0","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 34C","course_id":"13332","cat_num":"160199","1s":"4","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 34C","cat_num":"160199","course_id":"13332","year":"2015","term":"1","id":"afeeb8242ff10928d87dd4c2c4dd010d","first":" Courtney Bickel","last":"Lamberth","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Fall '15":{"comments":["A lot of reading, but if you enjoy philosophy and theology, or are even remotely interested, it's good stuff!!","You are expected to do a significant amount of reading, but there are very few evaluations, so skimming the material is satisfactory in most cases.","We can never actually pin down evil to a concrete definition. The value in talking and thinking about such a concept is formative in and of itself. Prof. Lamberth does an amazing job leading the class and it was a highlight of my freshman fall.","This class can be valuable if you are willing to commit to reading the material. If you are not planning on reading and actually understanding the meaning of the writings, then you will not get much out of this course and your understanding of \"evil\" will remain the same as it did on the first day. \r\n\r\nVery important to consider for this course","Dr. Lamberth is incredible - you should take this class to have this opportunity to learn from her. The seminar will introduce you to ideas spanning theology, philosophy, and literature that are often difficult to digest. Dr. Lamberth makes it enjoyable, and her enthusiasm for the topic is contagious. Also, the format of any freshman seminar (pass\/fail) makes this a great opportunity to be creative with ideas at no risk to your GPA. Take this seminar! Highlight of my freshman year.","Make sure if you take this class you are willing to read things and devote hours to analyzing materials that are sometimes difficult to get through. The discussion really is worth it though.","This class made my freshman fall semester so much better. Professor Lamberth is great. She facilitates thoughtful discussions about fascinating philosophical and religious works. I also liked the structure of the class because it was not too stressful. There's a lot of reading, but it is manageable. There are very few big assignments."]}},"mostRecentQ":{"overall":"4.30","workload":"3.20","difficulty":null,"recommendation":"4.20","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"FRSEMR 34C","course_id":"13332","cat_num":"160199","1s":"0","2s":"0","3s":"3","4s":"0","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 34C","course_id":"13332","cat_num":"160199","1s":"4","2s":"5","3s":"0","4s":"0","5s":"0"}},"success":true}