{"scores":{"Fall '15":{"course_score":{"overall":"4.20","workload":"2.50","difficulty":null,"recommendation":"4.10","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"FRSEMR 33C","course_id":"13104","cat_num":"159836","1s":"0","2s":"0","3s":"2","4s":"4","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 33C","course_id":"13104","cat_num":"159836","1s":"6","2s":"4","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 33C","cat_num":"159836","course_id":"13104","year":"2015","term":"1","id":"b113a1c6d7fc21bf79d923c1c611f693","first":" Mariano","last":"Siskind","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"3.70","ReturnsAssignmentsinTimelyFashion":"4.30"}]}},"comments":{"Fall '15":{"comments":["Take this class if you want an intro to Latin American writers a bit of history. It's low time commitment but at the same time really really interesting. Professor Siskind is truly passionate about the writers and is very knowledgable.","It is great if you are willing to do all the readings and you enjoy Latin American literature and want to learn more about it.","Take this class if you really enjoy literature and talking about literature.  It exposes you to a good bit of Latin American classics in a low-stress, enjoyable way.","The readings in this class are amazing and it was nice to have a class with only freshman during the fall, but Dr. Siskind can spend a lot of time lecturing rather than having us discuss the books. That being said, he had some really amazing analyses!","A low-maintenance, enjoyable class with a fantastic professor","This class was very interesting and Mariano is very passionate about his students. At the end of the semester, he invited us to his house to present our final projects.","Definitely take this course! This is a wonderful course with an amazing professor. Mariano really made the course for me: his selections for the readings were extremely interesting, and he was very knowledgeable on the subject. Additionally, he is extremely kind, personable, and very easy to approach and chat with. Really fantastic person who I feel lucky to have met my first semester.","This class can be very interesting, and although it helps to be somewhat familiar with the eras\/authors\/works (A lot of discussion involves some of the more detailed aspects of them), that is by no means necessary to enjoy this course and learn a lot about the literature."]}},"mostRecentQ":{"overall":"4.20","workload":"2.50","difficulty":null,"recommendation":"4.10","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"FRSEMR 33C","course_id":"13104","cat_num":"159836","1s":"0","2s":"0","3s":"2","4s":"4","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 33C","course_id":"13104","cat_num":"159836","1s":"6","2s":"4","3s":"0","4s":"0","5s":"0"}},"success":true}