{"scores":{"Fall '15":{"course_score":{"overall":"3.40","workload":"2.40","difficulty":null,"recommendation":"3.30","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"FRSEMR 22R","course_id":"13302","cat_num":"160118","1s":"0","2s":"3","3s":"1","4s":"3","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 22R","course_id":"13302","cat_num":"160118","1s":"5","2s":"4","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 22R","cat_num":"160118","course_id":"13302","year":"2015","term":"1","id":"c9d83a1a398d93e4b98fe5879e5f7f94","first":" Venkatesh","last":"Narayanamurti","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.30","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"3.00","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '15":{"comments":["Great introduction to technology, but might be not as interesting to already STEM-apt students. This class will focus on technology tackling modern worldly problems, not necessarily consumer tech or entrepreneur ventures.","This course is extremely low key","If you're looking to have a very broad introduction to topics involving the intersection & interaction between technology and society, this course is for you.  It is not a very heavy workload at all, and the class environment is very chill. Professor Venky and Ajinkya are both really awesome, and they have a ton of experience in this area.  It's especially wonderful when Professor Venky talks about his personal experience with Bell Labs during the internet security module.  \r\nHowever, if you are looking to delve deeply into discussing complicated technology\/society issues, this class is not as good of a fit.  Most issues, with the exception of the topics of the 2 group projects, are learned about at a very surface level. Class time itself is mostly spent on lecture and not group discussion.","Do not take this course if you have any background in CS\/Physics; it's a waste of your time. Course is overly focused on basic technology you most likely already know with virtually none of the promised engagement with the effects of technology on society.","Amazing class!","The course may be mostly the instructors lecturing, but it is a relaxed course that covers some very interesting topics.","The class people in the class were really nice to get to know but the lecture was boring. It was a good break from the rigor of my other classes but sometimes felt like a waste of time.","Technology in Society is definitely a worthwhile experience. The course allows you to really delve into some of the world's most pressing technological and societal issues, and I feel that if this is something one really values, there is definitely a lot to be gained from it."]}},"mostRecentQ":{"overall":"3.40","workload":"2.40","difficulty":null,"recommendation":"3.30","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"FRSEMR 22R","course_id":"13302","cat_num":"160118","1s":"0","2s":"3","3s":"1","4s":"3","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 22R","course_id":"13302","cat_num":"160118","1s":"5","2s":"4","3s":"0","4s":"0","5s":"0"}},"success":true}