{"scores":{"Fall '15":{"course_score":{"overall":"4.80","workload":"3.60","difficulty":null,"recommendation":"4.80","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"FRSEMR 31E","course_id":"10801","cat_num":"109471","1s":"0","2s":"0","3s":"0","4s":"3","5s":"9"},"QDifficulty":{"number":"FRSEMR 31e","course_id":"10801","cat_num":"40822","1s":"0","2s":"7","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 31E","course_id":"10801","cat_num":"109471","1s":"4","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 31E","cat_num":"109471","course_id":"10801","year":"2015","term":"1","id":"dbe48e9d70a571fdece50053a0d056e0","first":" Shigehisa","last":"Kuriyama","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Fall '13":{"course_score":{"overall":"4.10","workload":"1.80","difficulty":"2.20","recommendation":"4.20","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"FRSEMR 31E","course_id":"10801","cat_num":"109471","1s":"0","2s":"0","3s":"0","4s":"3","5s":"9"},"QDifficulty":{"number":"FRSEMR 31e","course_id":"10801","cat_num":"40822","1s":"0","2s":"7","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 31E","course_id":"10801","cat_num":"109471","1s":"4","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 31e","cat_num":"40822","course_id":"10801","year":"2013","term":"1","id":"dbe48e9d70a571fdece50053a0d056e0","first":" Shigehisa","last":"Kuriyama","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"3.20","ReturnsAssignmentsinTimelyFashion":"3.80"}]}},"comments":{"Fall '13":{"comments":["It's a fun and intriguing seminar.","A very mixed mag of a class, because you will learn everything from philosophy, to magic tricks, to money etc. If you are interested in those specific areas, take this class.","This class was very interesting because it combined a lot of different topics into a few very interesting themes throughout the class. We learned a lot of very useful techniques about creating and giving presentations. Learning magic tricks was also a very fun part of the class.","This seminar is really, really fun! Professor Kuriyama is a very interesting person, and the reading are strange but good. You'll be asked many vague\/hard questions that don't really have any answers to them. Be prepared to learn some cool magic tricks!","This is a low-stress class that addresses some interesting issues, although if you're looking for concrete and easily applicable answers about the nature of money, you may be hard-pressed to find them.","Interesting, fun course that will challenge a lot of what you think about the world. Kuriyama is a gem. Such a brilliant, open, fascinating professor. Not a lot of traditional assignments but you should have a fair bit of creativity! Almost everything I wanted out of a freshman seminar.","It's a really relaxed seminar, but you do get the chance to discuss and read about some interesting topics with philosophical implications.","This course will dramatically challenge what you think you know about money, movies, magic and the connections between the three. Your opinions will change, probably by the week."]},"Fall '15":{"comments":["One of the best seminars, was a great introduction to my first semester at Harvard","-The new perspective on money you get from this seminar will blow your mind! The course is great!","The material was very thought provoking. The class gathers a bunch of future Ec-concentrators and makes them question the very nature of money. The magic component is fun and the visual media component is very outside of the box. The material felt a bit unrelated sometimes (media theory, magic, economic history, etc), but it came together in an interesting way at the end.","Gained a completely new perspective on something I thought I knew so well. Kuriyama is a passionate professor and likes to teach new ideas and show some incredible magic tricks. Unfortunately the subject matter became a bit boring after a while as we started coming to a general idea, but this class has many things to learn about a wide variety of subjects.","This class is really fun and engaging","This class is amazing! A must take!","This is a brilliantly taught class by an enthusiastic instructor.  Discussions in class are always interesting and it's worth the effort to finish all of the readings.","This class was my favorite of the semester! You learn a lot but in a very creative way. You don't even notice you are doing work because all the readings are fascinating and the assignments fun to do!"]}},"mostRecentQ":{"overall":"4.80","workload":"3.60","difficulty":null,"recommendation":"4.80","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"FRSEMR 31E","course_id":"10801","cat_num":"109471","1s":"0","2s":"0","3s":"0","4s":"3","5s":"9"},"QDifficulty":{"number":"FRSEMR 31e","course_id":"10801","cat_num":"40822","1s":"0","2s":"7","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 31E","course_id":"10801","cat_num":"109471","1s":"4","2s":"7","3s":"1","4s":"0","5s":"0"}},"success":true}