{"scores":{"Fall '15":{"course_score":{"overall":"4.70","workload":"3.60","difficulty":null,"recommendation":"4.60","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"FRSEMR 38I","course_id":"11675","cat_num":"123725","1s":"0","2s":"0","3s":"0","4s":"3","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 38I","course_id":"11675","cat_num":"123725","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 38I","cat_num":"123725","course_id":"11675","year":"2015","term":"1","id":"f3c7ee5183c3dcd6a6d94993e5d54bd6","first":" Selim","last":"Berker","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '15":{"comments":["I was surprised to find out this course wasn't on the content of morality but rather the existence of morality. It involved a lot more logic than I expected and could sort of wear out your brain after two hours.","This course is ridiculously awesome. I'm pretty sure all 12 of us in the seminar loved it. Basically the course is you sitting down for two hours a week to discuss philosophy nonstop. If you think you'd love this take this seminar for sure.","I highly recommend this class.  You will become better at thinking.","Professor Berker is a great professor. He is passionate about his teaching and cares about your learning and improvement. This is evident in the helpful feedback he gives on papers--it is a lot more than that of any other class I've taken. I had initially anticipated this course to be something along the lines of applied ethics, but it turned out to be an analytical philosophy course. That said, taking this course has helped me think in new ways about philosophical arguments, learn how to read philosophical texts, and engage in challenging discussions.","Take this class. It will show you how to think in different, exciting ways. You will understand ethics completely, but also not at all. Most importantly you will discover the beauty of philosophy outside of a large intro course.","If you enjoy discussions on ethics, morality, and philosophy and you don't mind heavier and complicated readings, take this class! If none of those things appeal to you, don't - you're not gonna have a good time.","If you're interested in philosophy or looking to get interested in philosophy, this is a great course to take.  The format of the class and the close work you do with the professor will definitely pique your interest in the subject matter."]}},"mostRecentQ":{"overall":"4.70","workload":"3.60","difficulty":null,"recommendation":"4.60","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"FRSEMR 38I","course_id":"11675","cat_num":"123725","1s":"0","2s":"0","3s":"0","4s":"3","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 38I","course_id":"11675","cat_num":"123725","1s":"3","2s":"6","3s":"1","4s":"0","5s":"0"}},"success":true}