{"scores":{"Fall '14":{"course_score":{"overall":"4.70","workload":"5.10","difficulty":null,"recommendation":"4.60","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"FRSEMR 30v","course_id":"12360","cat_num":"97772","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 30v","course_id":"12360","cat_num":"97772","1s":"0","2s":"6","3s":"0","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 30v","cat_num":"97772","course_id":"12360","year":"2014","term":"1","id":"5ac5a6747d812595f815e299e5c9ea3a","first":" Jorge I.","last":"Dominguez","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '14":{"comments":["If you want a good history class about a nearby country with an incredible professor, take this class.","Because the material is not tested, I would tell students to take their time with their readings and spend more time on the readings they enjoy most, for learning's sake.","Professor Dominguez is clearly a skilled teacher, in addition to being a smart and nice human being. He knows how to run a class, both with in-class discussions and a structured syllabus. But be warned, there is a fair amount of reading (assuming you plan to do all of it). Also the course has more of a political focus than I expected at the outset.","This class is an incredible opportunity to learn about Mexico from a professor who is such an expert on the country. His commentary is just as valuable if not even more vital than the readings themselves.","\"I loved this class. It is evident that Dominguez puts a lot of effort into making the class enjoyable and intellectually stimulating. He's also a very nice man who cares not just about the course work, but about his students well being and their causes.","If you are at all curious about Mexico, take this course. Though there is quite a bit of reading per week, you will get used to it by the middle of the semester. Also, because this class is SAT\/UNS and a seminar, it's a great way to learn and meet other freshman. Furthermore, Professor Dominguez is a great guy to get to know; he is always willing to answer questions both about the course and adjusting to life at Harvard.","Make sure to thoroughly do all of the readings for the week and take notes on them. It helps a lot in section."]}},"mostRecentQ":{"overall":"4.70","workload":"5.10","difficulty":null,"recommendation":"4.60","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"FRSEMR 30v","course_id":"12360","cat_num":"97772","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 30v","course_id":"12360","cat_num":"97772","1s":"0","2s":"6","3s":"0","4s":"1","5s":"0"}},"success":true}