{"scores":{"Spring '17":{"course_score":{"overall":"5.00","workload":"1.30","difficulty":null,"recommendation":"5.00","enrollment":"3","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 22V","course_id":"13287","cat_num":"160194","1s":"0","2s":"0","3s":"5","4s":"2","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 22V","course_id":"13287","cat_num":"160194","1s":"5","2s":"1","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 22V","cat_num":"160194","course_id":"13287","year":"2016","term":"2","id":"88da9bcaf4b43bff3548ced1f6e9e45a","first":" Gerald","last":"Gabrielse","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '15":{"course_score":{"overall":"3.80","workload":"1.80","difficulty":null,"recommendation":"3.90","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"FRSEMR 22V","course_id":"13287","cat_num":"160194","1s":"0","2s":"0","3s":"5","4s":"2","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 22V","course_id":"13287","cat_num":"160194","1s":"5","2s":"1","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 22V","cat_num":"160194","course_id":"13287","year":"2015","term":"1","id":"88da9bcaf4b43bff3548ced1f6e9e45a","first":" Gerald","last":"Gabrielse","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '15":{"comments":["This course is fascinating and engaging without being a stress addition, an insightful combination that other courses might learn from!","This class is meant for students that are interested in concentrating in physics or something similar. Gabrielse goes out of his way to show his students different opportunities to work in the world of physics explaining different types of physics and bringing in different professors to speak about topics such as biophysics and astrophysics. The class is incredibly interesting for everyone though. However, the math can get pretty crazy and sometimes hard to understand, but you'll understand the concepts.","The course covered a variety of topics, all of which were interesting. These included the non-relativistic origin of quantum mechanics, special relativity, nuclear energy, and the faith+science question. Gabrielse had a lot of enthusiasm for the subject and a real interest in seeing his students understand the subject. He is a compassionate and humorous character. Additionally, he sought to maintain enough flexibility in the course to respond to his students' interests, which I personally appreciated (given that I had many *small* questions that I wanted answered), but at times the course felt a bit too unstructured. Moreover, there was not a large amount of discussion outside of clarification and\/or curiosity questions; this isn't a problem itself, but you should beware of that fact ahead of time. If you're looking for a light-workload course that gives you a peek beyond high school physics, then this seminar might be a good pick for you.","This seminar is a beginning to believe in both Science and Faith.","This course was a fantastic introduction to college physics for me, and it has convinced me to take other physics classes to see if that is the area in which I would like to concentrate.","Jerry is a great teacher, but you need to be able to keep up with the physics to get the best out of this course.","Professor Gabrielse is an excellent professor who has done incredible work in the field of physics; this fact is not particularly apparent in this particular course. I felt like Professor Gabrielse was not very challenged by this material and that he could have made a much more in depth and interesting class if the students in this class had had more exposure to physics beforehand and were more motivated. This is a good course to take if you have a basic interest in physics and would like to learn about it on a basic level. That being said, if you already know you love physics and are looking for something that you will find interesting at a deeper level, this is not your course."]},"Spring '17":{"comments":["Great Class. Low Stress and interesting material."]}},"mostRecentQ":{"overall":"5.00","workload":"1.30","difficulty":null,"recommendation":"5.00","enrollment":"3","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 22V","course_id":"13287","cat_num":"160194","1s":"0","2s":"0","3s":"5","4s":"2","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 22V","course_id":"13287","cat_num":"160194","1s":"5","2s":"1","3s":"0","4s":"0","5s":"0"}},"success":true}