{"scores":{"Fall '14":{"course_score":{"overall":"4.60","workload":"3.70","difficulty":null,"recommendation":"4.30","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"FRSEMR 35w","course_id":"12368","cat_num":"54211","1s":"0","2s":"0","3s":"0","4s":"3","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 35w","course_id":"12368","cat_num":"54211","1s":"1","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 35w","cat_num":"54211","course_id":"12368","year":"2014","term":"1","id":"5fd2870f337cf4844f674a3227211c46","first":" Jamey Elizabeth","last":"Graham","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"4.40"}]}},"comments":{"Fall '14":{"comments":["If you don't want a reading intensive course don't take it. Though the readings are discussed in class discussions and it is a seminar, so it's not that bad. But it gets awkward sitting in the room for 2 hours if you haven't done the reading, so if you don't like reading Shakespeare a few hours a week I wouldn't suggest taking this class.","If you like Shakespeare this is the class for you but if you do not then it can be pretty brutal.","It is incredibly interesting to think about the sex and gender components of Shakespeare in closer detail than is normally present in high school discussions of Shakespeare. This class is extraordinary for doing so.","This class was wonderful because Professor Graham is literally a genius.  She knows everything about everything, and learning from her is basically the dream.  If you like Shakespeare and WGS, take it.","This is a great class if you like Shakespeare! Dr. Graham is very knowledgeable and will provide you with great historical background to better understand his works. The format of the class is very manageable; you read a play each week and write three essays. The essays can seem overwhelming because her assignments are very vague, but she will clarify if you ask her too. Overall, this was a very fun class! I recommend it!","This course is a wonderful option for anyone interested in the humanities, whether you are a prospective concentrator or not. Thankfully, as a freshman seminar, it is not stressful, and the discussions are fun and thought-provoking.  The writing assignments are not laborious, and they are very helpful in developing your analytic skills and writing style. This was especially invaluable since I did not have Expos until the second semester. A semester of Shakespeare may seem a little daunting, but if you go along for the ride, it will definitely be a worthwhile experience."]}},"mostRecentQ":{"overall":"4.60","workload":"3.70","difficulty":null,"recommendation":"4.30","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":"FRSEMR 35w","course_id":"12368","cat_num":"54211","1s":"0","2s":"0","3s":"0","4s":"3","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 35w","course_id":"12368","cat_num":"54211","1s":"1","2s":"6","3s":"0","4s":"0","5s":"0"}},"success":true}