{"scores":{"Fall '14":{"course_score":{"overall":"4.00","workload":"3.90","difficulty":null,"recommendation":"3.70","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"FRSEMR 35v","course_id":"10814","cat_num":"1868","1s":"0","2s":"1","3s":"1","4s":"4","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 35v","course_id":"10814","cat_num":"1868","1s":"2","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 35v","cat_num":"1868","course_id":"10814","year":"2014","term":"1","id":"91c2aff4c02f25250e20fdadf19353bb","first":" Melissa Sara","last":"Feuerstein","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Fall '14":{"comments":["This class really taught me how to approach poetry and photography; it showed me how to enter a text and find my own meaning within it. The collaborative discussions we had in class opened my mind to other entry points and taught me to appreciate different perspectives.","This class was an overall positive experience, but be warned: Although it is a Sat.\/Unsat. class, it comes with a considerable amount of work. If you are looking for an easy freshman seminar to fit into your schedule, DO NOT take this course. If you are interested in the subject matter or in getting to know a wonderful and caring professor, then I would recommend the course.","I couldn't understand the poems and there was a lot of writing.","The texts are very engaging, but don't underestimate the amount of reading time required simply because this is a seminar. Structure your time well.","This class challenged my perceptions of the way space, time, materiality, and art as a whole work in the world. Take it if you're going to dedicate yourself to it, and read everything!","It's an interesting class but can be a bit boring sometimes.  Some of the discussions drag on because students aren't willing to say anything.  There are a lot of essays assigned and it's not advertised as a writing heavy class.  There are a lot of poems from the same writers, so sometimes it lacks variety.","This class does not require a large time commitment from week to week. Professor Feuerstein provides a lot of feedback week to week on essays and responses which can be helpful. There is a lot of freedom to chose areas of interest and you are free to write about whatever peaks your interest from the poems, photographs, and critical readings of the week. A very easy, yet interesting freshman seminar with a very caring and sweet professor. Take it!"]}},"mostRecentQ":{"overall":"4.00","workload":"3.90","difficulty":null,"recommendation":"3.70","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"FRSEMR 35v","course_id":"10814","cat_num":"1868","1s":"0","2s":"1","3s":"1","4s":"4","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 35v","course_id":"10814","cat_num":"1868","1s":"2","2s":"7","3s":"0","4s":"0","5s":"0"}},"success":true}