{"scores":{"Fall '15":{"course_score":{"overall":"4.10","workload":"2.40","difficulty":null,"recommendation":"4.10","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 32H","course_id":"13027","cat_num":"159808","1s":"0","2s":"1","3s":"2","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 32H","course_id":"13027","cat_num":"159808","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 32H","cat_num":"159808","course_id":"13027","year":"2015","term":"1","id":"0586b9f6943358b5ba57cd34253ba63e","first":" Benjamin","last":"Buchloh","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Fall '15":{"comments":["Pop Art is a weird place to start if you haven't learned much about art history before. I really appreciated it because I had taken art history in high school and had a broader understanding of Pop Art within the entire Western canon of art, but I'm not sure that I would have appreciated it as much without that previous knowledge.","take this seminar!! great chance to learn about one of the most famous art movements and the history around it.","This class is awesome. Buchloh is one of the foremost scholars in the abstract art field, and so this is a pretty spectacular opportunity to study with such a smart guy. Also, because there is no final, you can enjoy the class and discussions without having to worry about writing down everything he says.","Professor Buchloh is extremely impressive and a really interesting person to work with and learn from. It is exciting to be in such a small with him so that he knows you well and gets a sense of your perspective in class. The entire class is discussion based which is cool but a little hard for me as a pretty quiet person. I felt that it was hard for me to think of something interesting to add quickly enough. The subject was exciting and I do feel I learned a lot from the class.","This class is a fantastic introduction to Art History and Pop Art. It is very, very easy (less than an hour of reading a week and only one paper). Professor Buchloh is also incredible in his sheer volume of knowledge and his ability to critically analyze works of art. His terminology is very advanced, but don't be too afraid. Overall, an amazing course."]}},"mostRecentQ":{"overall":"4.10","workload":"2.40","difficulty":null,"recommendation":"4.10","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 32H","course_id":"13027","cat_num":"159808","1s":"0","2s":"1","3s":"2","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 32H","course_id":"13027","cat_num":"159808","1s":"6","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}