{"scores":{"Fall '13":{"course_score":{"overall":"4.40","workload":"1.20","difficulty":"2.30","recommendation":"4.40","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 32t","course_id":"10807","cat_num":"43513","1s":"0","2s":"0","3s":"2","4s":"3","5s":"6"},"QDifficulty":{"number":"FRSEMR 32t","course_id":"10807","cat_num":"43513","1s":"2","2s":"4","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 32t","course_id":"10807","cat_num":"43513","1s":"9","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 32t","cat_num":"43513","course_id":"10807","year":"2013","term":"1","id":"8fc8c5c36b7feff59adb9a31b621d6ba","first":" Richard F.","last":"Thomas","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Fall '13":{"comments":["This course provides one with the opportunity to fully engage with all the problems of translation and problems of poetry that are not very actively addressed in the public. No matter what language one has a background in, this class will provide you a deeper understanding of that specific language and the challenges faced with any pursuit of a poetic translation. Of all the courses freshman year, this one will have you looking forward towards class and even dinner with the professor afterwards.","Professor Thomas is the best! The class focuses a lot on group discussions. The workload is really nice and we have a lot of freedom in designing our own translation projects. Our seminar group was really fun and we all got to know each other well by the end of the semester (it's sad that it's over, actually).","Easy, interesting class although full of lengthy presentations and not so much discussion.","Professor Thomas is an excellent, fun teacher. You will not regret taking the class.","This course is a great opportunity to learn a lot without having to worry about being tested or graded on what you have learned. If there is a particular foreign language poet you would like to explore, this course is for you.","Low-key and very fun.","It is an interesting class, but take it if you have actual interest in both poetry and translation, and are interested in learning more about both.","Great fun seminar. Definitely has a classics focus. Prof, Thomas is fun, engaging, and very knowledgable. Yet this course could be amazing with a bit of added rigor. As it stands it is great, but not yet amazing.","An awesome seminar with an awesome professor"]}},"mostRecentQ":{"overall":"4.40","workload":"1.20","difficulty":"2.30","recommendation":"4.40","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 32t","course_id":"10807","cat_num":"43513","1s":"0","2s":"0","3s":"2","4s":"3","5s":"6"},"QDifficulty":{"number":"FRSEMR 32t","course_id":"10807","cat_num":"43513","1s":"2","2s":"4","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 32t","course_id":"10807","cat_num":"43513","1s":"9","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}