{"scores":{"Fall '15":{"course_score":{"overall":"4.00","workload":"3.20","difficulty":null,"recommendation":"4.10","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"FRSEMR 31H","course_id":"13045","cat_num":"159737","1s":"0","2s":"0","3s":"2","4s":"7","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 31H","course_id":"13045","cat_num":"159737","1s":"2","2s":"9","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 31H","cat_num":"159737","course_id":"13045","year":"2015","term":"1","id":"a35ce67647a31ef3afff9636a373e656","first":" Susanna","last":"Rinard","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Fall '15":{"comments":["This class is wonderful! It serves to evaluate different philosophies behind happiness and leads to very well thought out discussions about the nature of happiness and the values each individual holds. Assignments are simple, and all you need is to read and be able to discuss the ideas presented in the readings.","The discussions are really interesting, just make sure you stay on top of the material if you want to get something from them. The weekly responses are much less painful than a final paper you otherwise would have to write.","It was really good to take this class because of the people and the lack of stress, but the time (W 3-5) made it hard to be focused and engaged when material got monotonous.","Susanna is great, and the discussions are very engaging, educational, and enjoyable. The readings, however, leave something to be desired, but this is also somewhat unavoidable given the philosophical nature of the topic and course. Susanna would sometimes designate parts of class or even extra (optional) time out of class to actively talk about how to make our lives better, more fulfilling, and more in line with our ideals, and it was obvious she really cared about us.","I really loved being part of the class because it definitely challenged a lot of my views on what it means to be happy, satisfied with life, have a good life, etc. The readings were pretty philosophy based (except the second book which I loved because it talked about how to be happy), and the discussions were very interesting and definitely made you think a lot!","Though the class is a lot of reading, there are very little writing assignments (and so the class doesn't require a huge amount of time). Susanna's distinct teaching style, combined with the insightful discussions into both deep philosophy and real-life examples, make for a great class.","Take this seminar if you're interested in either of the following:\r\n1) Understanding the psychology behind self-reported happiness evaluations, and challenging the notion that more freedom--> more happiness. \r\n2) Improving your own decision-making and identifying new strategies to become happier\r\n3) Taking an easy an interesting seminar with a very knowledgeable and accessible professor\r\n\r\nP.S. You don't really have to do the readings since they're summarized super efficiently at the beginning of class."]}},"mostRecentQ":{"overall":"4.00","workload":"3.20","difficulty":null,"recommendation":"4.10","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"FRSEMR 31H","course_id":"13045","cat_num":"159737","1s":"0","2s":"0","3s":"2","4s":"7","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 31H","course_id":"13045","cat_num":"159737","1s":"2","2s":"9","3s":"0","4s":"0","5s":"0"}},"success":true}