{"scores":{"Spring '16":{"course_score":{"overall":"3.30","workload":"5.20","difficulty":null,"recommendation":"3.30","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 42F","course_id":"13605","cat_num":"160200","1s":"1","2s":"1","3s":"3","4s":"4","5s":"1"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 42F","course_id":"13605","cat_num":"160200","1s":"0","2s":"7","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 42F","cat_num":"160200","course_id":"13605","year":"2015","term":"2","id":"abe128aa0aa1fa1e62bd548659e07b4b","first":" Lisa M.","last":"McGirr","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"2.70","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"2.90","ReturnsAssignmentsinTimelyFashion":"3.20"}]}},"comments":{"Spring '16":{"comments":["Professor McGirr is very engaged and the books are great, but it's a lot of reading if you do it all and class can get a little boring because it's largely unstructured.","I really enjoyed this course. The topic is very interesting and it is a pretty comprehensive history of crime and punishment in America. The reading assignments each week were rather long but each was very interesting and informative. I would definitely recommend this seminar, it was a really great learning experience.","Although this class certainly has much more to read than other freshman seminars, if you find both historical and contemporary issues regarding crime and punishment interesting, it will be worth it. Prof. McGirr is also very easygoing and fun to learn from!","I would tell students to take this class if they want a wide survey on crime and punishment but to be aware that it does come with hefty reading requirements that aren't specified until you get the syllabus on the first day of class.","This class did an excellent job of looking into different ways that conceptions of crime and punishment have evolved in the US. It is an excellent survey course, and the material is very interesting. The professor is knowledgeable and expects her students to perform highly.","This class was incredibly interesting however the readings were a bit much and the section could get boring at times. If you are interested in criminal justice reform this is perfect.","This freshman seminar is a bit heavy on work-- we read on average a book a week (around 200-300 pages). It was all pretty interesting, and Professor McGirr was great at facilitating discussion and in general. But do beware that this probably isn't a great seminar to take if you're looking for light-coursework class, although the pass-fail does take considerable pressure off."]}},"mostRecentQ":{"overall":"3.30","workload":"5.20","difficulty":null,"recommendation":"3.30","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 42F","course_id":"13605","cat_num":"160200","1s":"1","2s":"1","3s":"3","4s":"4","5s":"1"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"FRSEMR 42F","course_id":"13605","cat_num":"160200","1s":"0","2s":"7","3s":"3","4s":"0","5s":"0"}},"success":true}