{"scores":{"Spring '16":{"course_score":{"overall":"4.10","workload":"5.00","difficulty":null,"recommendation":"4.00","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"GOV 94BB","course_id":"14004","cat_num":"161248","1s":"0","2s":"0","3s":"1","4s":"8","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94BB","course_id":"14004","cat_num":"161248","1s":"0","2s":"10","3s":"0","4s":"0","5s":"1"}},"instructor_scores":[{"number":"GOV 94BB","cat_num":"161248","course_id":"14004","year":"2015","term":"2","id":"2d5d1f81907cd6a97759c1a0fb1d3edc","first":" Beth Ann","last":"Simmons","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"3.90"}]}},"comments":{"Spring '16":{"comments":["Be prepared to write the massive paper at the end of the class. Working with other students can be very frustrating, especially when you leave a lot of work for the last few days. It is easy to do no work at all in this class for most of it, but it's way easier if you work on the paper steadily throughout the last month or month and a half of the course.","This class still has some figuring out to be done, the syllabus should be revisited, but it is a worthwhile experience.","Prof. Simmons and Angie are phenomenal. The class focused on the methods of producing government research a little more than the actual content of borders and boundaries. The thesis-length paper was really tough to bring together, but once over, was extremely refreshing, and a great experience. Start early on it.","The topic is super interesting, and I think that especially for sophomores (in Gov or Social Studies) thinking of writing a thesis in this subject matter it prepares you well with background and lots of thesis-like papers to read; the final assignment is a research prospectus for a thesis. However, find out if the group final essay is still a thing; it's a 100-125 page group paper and it's very difficult to find time to meet. I didn't know what I was getting myself into with this part. If that changes to a normal seminar 20-25 page individual paper, I would recommend this class with enthusiasm.","Professor Simmons and Angie were incredibly supportive in every way possible - would definitely recommend frequenting their office hours as much as you can because you'll learn so much and come away with a better idea of how to think about some of the class assignments, Gov research in general, and your thesis if you plan to write one! Class readings and discussions were exciting and interesting - definitely forces you to think about the research presented in a more structured way. Assignment details were sometimes provided or clarified later than expected, but other than that, this is the best Gov seminar I've taken!","It's a demanding course - would only recommend to those interested in PoliSci\/IR research","This course is very interesting because it allows you to understand a wide variety of issues related to borders. The course was poorly organized but I think that is because it had never been held before. Now that rubrics are written and expectations for the assignments have been developed, it should run more smoothly and not wait until the last minute to give out instructions. Angie was very nice but she did not have the right expertise to TF this course."]}},"mostRecentQ":{"overall":"4.10","workload":"5.00","difficulty":null,"recommendation":"4.00","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"GOV 94BB","course_id":"14004","cat_num":"161248","1s":"0","2s":"0","3s":"1","4s":"8","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94BB","course_id":"14004","cat_num":"161248","1s":"0","2s":"10","3s":"0","4s":"0","5s":"1"}},"success":true}