{"scores":{"Spring '17":{"course_score":{"overall":"4.40","workload":"3.40","difficulty":null,"recommendation":"4.60","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"0","2s":"2","3s":"2","4s":"9","5s":"8"},"QDifficulty":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"2","2s":"11","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"10","2s":"10","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 1270","cat_num":"110842","course_id":"2221","year":"2016","term":"2","id":"42fc4851dfbdf0e700c5ec7bf6d66005","first":" Daniel M.","last":"Smith","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '15":{"course_score":{"overall":"4.20","workload":"4.10","difficulty":null,"recommendation":"4.20","enrollment":"19","response rate":"84.21","QCourseOverall":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"0","2s":"2","3s":"2","4s":"9","5s":"8"},"QDifficulty":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"2","2s":"11","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"10","2s":"10","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 1270","cat_num":"110842","course_id":"2221","year":"2014","term":"2","id":"42fc4851dfbdf0e700c5ec7bf6d66005","first":" Daniel M.","last":"Smith","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.30"}]},"Spring '14":{"course_score":{"overall":"4.10","workload":"1.60","difficulty":"2.30","recommendation":"4.20","enrollment":"30","response rate":"70.00","QCourseOverall":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"0","2s":"2","3s":"2","4s":"9","5s":"8"},"QDifficulty":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"2","2s":"11","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"10","2s":"10","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 1270","cat_num":"11288","course_id":"2221","year":"2013","term":"2","id":"42fc4851dfbdf0e700c5ec7bf6d66005","first":" Daniel M.","last":"Smith","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Spring '13":{"course_score":{"overall":"4.83","workload":"1.89","difficulty":"2.83","recommendation":"4.89","enrollment":"23","response rate":"78.26","QCourseOverall":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"0","2s":"2","3s":"2","4s":"9","5s":"8"},"QDifficulty":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"2","2s":"11","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"10","2s":"10","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 1270","cat_num":"11288","course_id":"2221","year":"2012","term":"2","id":"e4329dba3b3bace13baf712a3a49b415","first":" Yumiko","last":"Shimabukuro","InstructorOverall":"4.94","EffectiveLecturesorPresentations":"4.94","AccessibleOutsideClass":"4.94","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.82","GivesUsefulFeedback":"4.88","ReturnsAssignmentsinTimelyFashion":"4.94"}]},"Spring '12":{"course_score":{"overall":"4.33","workload":"2.11","difficulty":"3.22","recommendation":"4.22","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"0","2s":"2","3s":"2","4s":"9","5s":"8"},"QDifficulty":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"2","2s":"11","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"10","2s":"10","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '14":{"comments":["Great class. Prof Smith is really cool and down to earth. This class feels like an elective but counts towards the gov concentration. You'll learn a lot about Japanese politics in the context of global politics.","If you are interested in Japanese politics\/Japan in general, take this class!  It's great and I learned so much!  The structure of the class is extremely organized, and the lectures incorporate information not only about Japanese politics but also about general approaches to comparative politics.  As for the exams, if you go to lecture and study your lecture notes, you will be fine!  Professor Smith is a great professor.  He knows his stuff, and he presents it in an organized and clear fashion.","Great overview of Japanese politics from an institutional stand point. Would highly recommend this course to people who are interested in getting an introduction to Japanese politics.","This class is great except right before the midterm and final there is a TON of material to study.","This was a fantastic class.  The professor was great and the exams were fair.  However, the exams are a vast majority of your grade, so check the syllabus if you don't want your grade decided by a few hours of work.","Take this course if you want a lot of information about Japanese politics!","Because there's no section, you should really work to do the reading and study your notes shortly after each lecture. I fell into the temptation of not doing the reading during the weeks on electoral reform because Prof. Smith pretty much summarized everything in lecture. But the later weeks delve into more complicated and varied material, and the lectures can't cover everything you need to know.","If you are interested in understanding how the Japanese political system works, this is the class for you. If you like political theory, you will be disappointed.","This class is awesome if you want to learn more about contemporary Japan. It covers everything that you need to know about Japan and gives insight into many of the customs and current events surrounding the country.","Even if you are not so interested in Japanese politics or government, you can get a sense of how you can use political scientific tool for analyzing politics. Learning foreign political system deepens my insights on US politics.","Take this course for a comprehensive coverage of Japanese politics. It's a specific topic but very relevant in this time of rising issues in Asia. Professor Smith knows what he's talking about and it is a great course. Be prepared to write a lot of notes and process a lot of material but it's definitely worth it.","Make sure that you are interested in Government because this class really goes into depth on how the japanese government operates and the history of how the current government was formed."]},"Spring '15":{"comments":["The information is interesting, no doubt. But, that being said, both the lectures and readings are a bit dry and it is hard to feel engaged.","Take this course if you are fairly interested in Japan in some capacity. It is a lot of material about a fairly specific subject so you have to enjoy learning about postwar Japanese politics if you want to enjoy this class. Prof. Smith is really relatable and helpful though, so it is certainly the class to take if East Asian politics interests you in any way.","With a midterm quiz and a final as the two major grade components, this course is great for a low-pressure environment for those who want to learn more about Japan.","In this class you will blindly copy down Professor Smith's PowerPoint presentations, and then memorize a condensed version of the notes to regurgitate on the final. Section will be the most brutal hour of your week. You will emerge with a lot of facts about the Japanese political system without having to really exercise your brain or use critical thinking.","If you are interested in Japanese politics, take this course at some point in your four years at Harvard. It will not disappoint.","Do yourself a favor and take this class!!!","Not very difficult, but super interesting and engaging. My focus is on China but I feel like understanding Japan more has helped me better understand East Asia as a whole. Great class, highly recommended.","This course is phenomenal in every way; not too overwhelming but also very interesting in its presented material. I'm pretty shocked enrollment is so low.","Gov 1270 is a great gov elective to take. The class is small, which allows for there to be more interaction in lecture and section. There are no essays, which I appreciated, but a quiz, midterm, and final. Grading is very fair. Section debates are fun and are about controversial topics in Japanese society today. Be prepared to review a lot of material before exams!","I think that the material and courses generally is well-designed and made even for those that are not government concentrators. The only problem I had is that the lecture slides are not posted \/ no video lecture, and that the professor sometimes rushed \/ went too fast on the slides. I did not appreciate this, since it doesn't allow students to get the full amount of content in class. Either decide to cut down the amount of material to make it fit into the classroom time, or provide slides or lecture videos to accommodate for rushing some points in lecture."]},"Spring '17":{"comments":["very easy if you put work in and are prepared to study hard for mid term and final.","Smith is a funny lecturer, however, I feel like the material can be very dry at times. I really like Chris, he was helpful and informative. Just so you know this is a survey course on Japan so if you get bored easily on one focus, I wouldn't recommend.","This class is very easy. You take notes in section and regurgitate them on the quiz, midterm, and final.","Not much work: no essays, just a midterm and a final and participation in section.  Great class to take to learn more about government and Japan in a low-pressure environment","This class is interesting, thorough, enjoyable, moves quickly, teaches relevant information, and has a great instructor in Professor Smith. The workload is manageable and completely worth it.","Take this class! If you know nothing about Japanese politics, this is the place to start; and even if you do know a lot, it's a great course to take to easily complete a concentration requirement. No papers, just a quiz, midterm, and final (each of which were incredibly doable if you took notes in lecture).","This is a great course to knock out the comparative subfield requirement. There are no papers - just a midterm, a final, and one short section presentation. Weekly readings are very manageable. All the information you need to know is in Professor Smith's lectures. Great course!"]}},"mostRecentQ":{"overall":"4.40","workload":"3.40","difficulty":null,"recommendation":"4.60","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"0","2s":"2","3s":"2","4s":"9","5s":"8"},"QDifficulty":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"2","2s":"11","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1270","course_id":"2221","cat_num":"11288","1s":"10","2s":"10","3s":"1","4s":"0","5s":"0"}},"success":true}