{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"2.40","difficulty":"3.30","recommendation":"4.60","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"GOV 94ga","course_id":"10872","cat_num":"63983","1s":"0","2s":"0","3s":"3","4s":"2","5s":"5"},"QDifficulty":{"number":"GOV 94ga","course_id":"10872","cat_num":"63983","1s":"0","2s":"0","3s":"7","4s":"3","5s":"0"},"QWorkload":{"number":"GOV 94ga","course_id":"10872","cat_num":"63983","1s":"0","2s":"6","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 94ga","cat_num":"63983","course_id":"10872","year":"2013","term":"2","id":"575dd89f1844ebf43d0eac514ba331d3","first":" Amanda Lynne","last":"Garrett","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '14":{"comments":["This is a very good class if you are interested in ethnic conflict. The workload is fairly minimal besides the weekly readings. Research paper at the end is tough, but not as long as other seminars (15-20 pages). One of the better seminars out there.","Its a great course to take if you are interested in learning more about ethnic conflict in general as well as going into depth on a specific case study.  It will be a lot of reading and you need to come prepared to section, but it was always worth it.","An strong survey of the literature and a helpful course for paper writing in general","Interesting content; great professor; and you have the intellectual freedom to pursue your own research about a case study of your choice throughout the semester","This course discusses really interesting topics, but the weekly readings are quite a bit and the quality of discussions definitely depends on how in depth every did the readings. Excluding important topics, the professor won't just recap the readings for those who haven't done the readings.","She is a good teacher. It would greatly help if there were more informative discussions.","Only take this class if there is a country (with ethnic violence) that you are passionate about researching. The readings are interesting, but are only relevant if you chose a case study with a country that has a predictable type of ethnic violence (civil war, riots, protracted conflict). Some countries fit into these categories easier than others, and those are the countries that the readings apply to most. \r\n\r\nAlso, get started on your research paper early and talk to Prof. Garrett about your topic ahead of time. Try to solidify a research question as soon as possible and show her the research you've found to make sure that it is a question she likes.","Prof. Garrett is really a standout. The topic is important and you have the flexibility to focus on a nation\/case study that interests you most."]}},"mostRecentQ":{"overall":"4.20","workload":"2.40","difficulty":"3.30","recommendation":"4.60","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"GOV 94ga","course_id":"10872","cat_num":"63983","1s":"0","2s":"0","3s":"3","4s":"2","5s":"5"},"QDifficulty":{"number":"GOV 94ga","course_id":"10872","cat_num":"63983","1s":"0","2s":"0","3s":"7","4s":"3","5s":"0"},"QWorkload":{"number":"GOV 94ga","course_id":"10872","cat_num":"63983","1s":"0","2s":"6","3s":"4","4s":"0","5s":"0"}},"success":true}