{"scores":{"Spring '17":{"course_score":{"overall":"3.90","workload":"5.90","difficulty":null,"recommendation":"3.80","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"GOV 94IP","cat_num":"203521","course_id":"14634","year":"2016","term":"2","id":"2e9b2b30720f81d97818aa8db3bacec7","first":" Ana Catalano","last":"Weeks","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Spring '17":{"comments":["Dr. Weeks does a great job selecting material on an extremely broad but relevant topic. The class is structured well, with the first few weeks focusing on explanations (institutions, social movements, etc.) and the other half on applications (LGBTQ issues, affirmative action, etc.). The weekly student presentations kept it from dragging, and the response papers (3 throughout the course of the class) were often extremely interesting to read. The final paper is difficult - a 15-25 page research design. It might be good to have some kind of methodological background (Gov 61\/62) going into that. Dr. Weeks is extremely helpful and widely-versed in all sorts of topics, though.","Such a great course! Great discussions and really interesting and diverse set of readings. Plus Dr. Weeks is incredible.","Great class if you know you are specifically interested in identity politics. It can get wonky so you should like the subject going in.","its a good base course, not great if youre looking for in depth discussion of a particular unit, very much a broad brush course","This is a great course, on an interesting topic! However, be prepared to leave class with a lot of questions. You won't always feel like you take a lot, unless you're doing all the readings and truly diving into the material. Class is set up so one student presents each class--that's about 20 min of the class and then discussion. So a lot of discussion--students drive the class. The class ends in a 15-25 final paper; if you're not engaged with the topic of your paper, this may be a lot to get through.","This class is wonderful! Dr. Weeks is amazing, and the assignments designed carefully to help us better understand the materials. I would highly recommend it!"]}},"mostRecentQ":{"overall":"3.90","workload":"5.90","difficulty":null,"recommendation":"3.80","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}