{"scores":{"Fall '15":{"course_score":{"overall":"4.80","workload":"4.70","difficulty":null,"recommendation":"5.00","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"GOV 94CA","course_id":"12406","cat_num":"156441","1s":"0","2s":"0","3s":"0","4s":"2","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94CA","course_id":"12406","cat_num":"156441","1s":"0","2s":"9","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 94CA","cat_num":"156441","course_id":"12406","year":"2015","term":"1","id":"2ca5625089ae385f1c4107040ed74acf","first":" Michael J","last":"Sandel","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"3.30","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"2.70","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '14":{"course_score":{"overall":"5.00","workload":"5.40","difficulty":null,"recommendation":"5.00","enrollment":"13","response rate":"76.92","QCourseOverall":{"number":"GOV 94CA","course_id":"12406","cat_num":"156441","1s":"0","2s":"0","3s":"0","4s":"2","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94CA","course_id":"12406","cat_num":"156441","1s":"0","2s":"9","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 94ca","cat_num":"43145","course_id":"12406","year":"2014","term":"1","id":"2ca5625089ae385f1c4107040ed74acf","first":" Michael J.","last":"Sandel","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '14":{"comments":["This is the ultimate Harvard course. The kind of college class you thought you would be taking all of the time back when you were a high schooler thinking about Harvard. Just getting to know such an amazing\/legendary professor is pretty cool; to be able to engage with Professor Sandel and thoughtful classmates on difficult subjects took this course a step further. This seminar was certainly one of my favorite classes at Harvard.","This course and the moral debate it incites will change the way you see the world in a way you would never have imagined.","By far the most thought-provoking class I've taken at Harvard. Prof. Sandel is incredible, and really lets the class run itself. You'll question a lot of things you previously took as truth, but you'll be a better person for it.","Best class I have ever taken at Harvard. Period.","This class is fantastic. Each class is two hours of discussion and debate that will challenge your intuitions and put your beliefs to the test.","This was easily one of the best courses I have taken at Harvard, and I urge you take any opportunity you can to learn from Professor Sandel.  I would often leave this class mentally exhausted, because each seminar was so challenging and engaging.  The subject is certainly something that deserves more attention here at Harvard.  Professor Sandel is as kind as he is intelligent, and he is truly what makes this class so special."]},"Fall '15":{"comments":["Professor Sandel is great at leading seminars and making students realize their strengths and weaknesses in reasoning. The course is very interesting, unique, and manageable.","This class is truly unique. The students provide a diverse set of perspectives and challenge you to consider your own assumptions. Professor Sandel has the unique ability to foster conversation among students, and not take over the class. His role was constructive and he guided conversation without injecting his own opinions obviously.","This class is amazing. First of all, the work is very manageable. Each week you read a bunch of interesting articles and then write a two page response on it. Beyond the manageable work load, the class was amazing and thought-provoking. Also, you don't often get a chance to talk with the leading philosopher of the world on a weekly basis. I couldn't recommend this class enough.","This course was a very cool way at looking at \"Casino Capitalism\". I never thought of financial speculation as a form of gambling and never considered why it may or may not be ethical. My way of thinking has changed and when evaluating whether something is ethical or not I've taken larger things into consideration.","This is the best class at Harvard College.","Easily one of my favorite classes. It is a crucial opportunity to discuss in real depth a topic that is extremely important to our society today. You'll come out with a completely different view of the world from your understanding of the financial industry to your perception of meritocracy."]}},"mostRecentQ":{"overall":"4.80","workload":"4.70","difficulty":null,"recommendation":"5.00","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"GOV 94CA","course_id":"12406","cat_num":"156441","1s":"0","2s":"0","3s":"0","4s":"2","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"GOV 94CA","course_id":"12406","cat_num":"156441","1s":"0","2s":"9","3s":"1","4s":"0","5s":"0"}},"success":true}