{"scores":{"Spring '13":{"course_score":{"overall":"4.33","workload":"2.33","difficulty":"3.20","recommendation":"4.67","enrollment":"8","response rate":"75.00","QCourseOverall":{"number":"GOV 94sl","course_id":"2187","cat_num":"52322","1s":"0","2s":"0","3s":"1","4s":"2","5s":"3"},"QDifficulty":{"number":"GOV 94sl","course_id":"2187","cat_num":"52322","1s":"0","2s":"0","3s":"4","4s":"1","5s":"0"},"QWorkload":{"number":"GOV 94sl","course_id":"2187","cat_num":"52322","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 94sl","cat_num":"52322","course_id":"2187","year":"2012","term":"2","id":"598dde89ef1a896915101110504b9e73","first":" Shawn Ling","last":"Ramirez","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.67","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.67","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"4.67"}]}},"comments":{"Spring '13":{"comments":["Provides a compelling and comprehensive overview of IR theory relation to war and peace and applying it to case studies! I also highly recommend this class for providing you the requisite tools to write solid seminar paper! Unfortunately Shawn is teaching at Emory next year so the class dynamic may be different.","Readings are decent and give good exposure to both qualitative and quantitative methods of gov research. Emphasizes mixed methods research to an extent, but that is appropriate as that is where the field is currently heading. However, there is a general lack of structure - many topics are surveyed, but they do not build up to any type of argument at the end of the semester. Professor Ramirez is very nice, though, and will give meaningful feedback and help with assignments. Recommend this class if looking for a gov seminar and interested in conflict.","A phenomenal opportunity to get a significant jump start on your thesis.  The course forces you to steadily work towards a research paper at the end.  All you need is an interest in international conflict and a research question.","I would highly recommend this course. This is a great seminar if you are interested in learning about intrastate war, audience costs, military interventions, negotiations and bargaining, terrorism etc. Due to the small size of the class, you will get personalized attention on assignments and a lot of help in developing a research question. Although the professor will not be here next semester, the topics covered within the course are very interesting and I definitely recommend if it it is being offered. We were able to do our research projects on any topic we wanted, and it is a great way to begin brainstorming on thesis topics."]}},"mostRecentQ":{"overall":"4.33","workload":"2.33","difficulty":"3.20","recommendation":"4.67","enrollment":"8","response rate":"75.00","QCourseOverall":{"number":"GOV 94sl","course_id":"2187","cat_num":"52322","1s":"0","2s":"0","3s":"1","4s":"2","5s":"3"},"QDifficulty":{"number":"GOV 94sl","course_id":"2187","cat_num":"52322","1s":"0","2s":"0","3s":"4","4s":"1","5s":"0"},"QWorkload":{"number":"GOV 94sl","course_id":"2187","cat_num":"52322","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"success":true}