{"scores":{"Fall '15":{"course_score":{"overall":"4.80","workload":"5.70","difficulty":null,"recommendation":"4.70","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"HAA 173G","course_id":"13403","cat_num":"159687","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HAA 173G","course_id":"13403","cat_num":"159687","1s":"0","2s":"8","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HAA 173G","cat_num":"159687","course_id":"13403","year":"2015","term":"1","id":"6554df6d5af17648b84e59cbbd390ffb","first":" Ewa","last":"Lajer-Burcharth","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"},{"number":"HAA 173G","cat_num":"159687","course_id":"13403","year":"2015","term":"1","id":"6d2d40177a0f712daa6f68abc0a87e9d","first":" Elizabeth","last":"Rudy","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '15":{"comments":["This course is wonderful. Professor Lajer-Burcharth's breadth of knowledge and insight on drawings are astounding, and I learned so much through this class. Also, this course provided an incredible and rare opportunity to work directly with the drawings from the Harvard Art Museums.","My favorite class I have taken at Harvard. Though the readings were challenging, Ewa and Elizabeth were excited at any and all attempts to step up to that challenge and dive in, head first. There is nothing as exciting as getting to work so closely with the materials you are learning about, and this class allows you to do that to its fullest extent.","This was one of the most interesting courses I have ever taken at Harvard. It is difficult--the readings can be dense and it can be especially hard to follow if you don't have any background knowledge about the subject. Still, it was incredibly rewarding and I had so much fun writing the final wall texts for the exhibition. As it is a seminar, it is a participation-heavy class, so be prepared to talk.","This is an incredible opportunity for anyone interested in museum curation. Also a fantastic way to get to know the museum's collection. I would highly recommend this course!!","This class was not only a great hands-on introduction to an art medium and period but also a fantastic way to begin to understand the effort that goes into creating an exhibition.","This was my favorite class this semester, partly because we got to work with the amazing Professor Lajer-Burcharth and curator Elizabeth Rudy, and partly because we got to be with the actual artworks while we were discussing them. The weekly activity of deciding which artworks would go well in an exhibition together, and choosing which ones would have to be left out was eye-opening, and taught me a lot about museum behind-the-scenes work. Going to each class with a goal, of providing the most didactic and interesting exhibition for the public, was a great challenge, and framed my thinking about the artworks in a productive way. The process was also very collaborative; both professor and curator responded to our comments, developed upon our comments, and provided important historical or ideological background. If a similar class is offered in the future, I would highly highly recommend it.","This course is absolutely wonderful. If it is offered again, and you have any background in art history, I would advise you without hesitation to do everything you can to take the class. The material is difficult, and the Ewa expects a lot of you as a student, but you will learn more than you could ever imagine. The course is an incredible opportunity to basically act as a curator of a show at the Harvard Art Museum, which is an incredible opportunity."]}},"mostRecentQ":{"overall":"4.80","workload":"5.70","difficulty":null,"recommendation":"4.70","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"HAA 173G","course_id":"13403","cat_num":"159687","1s":"0","2s":"0","3s":"0","4s":"2","5s":"9"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HAA 173G","course_id":"13403","cat_num":"159687","1s":"0","2s":"8","3s":"3","4s":"0","5s":"0"}},"success":true}