{"scores":{"Spring '16":{"course_score":{"overall":"4.70","workload":"4.60","difficulty":null,"recommendation":"4.90","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"HAA 122X","course_id":"13566","cat_num":"121805","1s":"0","2s":"0","3s":"0","4s":"3","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HAA 122X","course_id":"13566","cat_num":"121805","1s":"1","2s":"7","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HAA 122X","cat_num":"121805","course_id":"13566","year":"2015","term":"2","id":"39e095833ca4ea625e87d7450f1c90a3","first":" Gulru","last":"Necipoglu-Kafadar","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '16":{"comments":["This course was wonderful for a number of reasons - the instructors, the topic, the small seminar format, and the travel. Prof. Necipolgu and Prof. Payne are both experts in their respective fields. Being able to work with both of them in a collaborative course was a true treat. It was a gift to see how the two minds worked together and approached buildings\/topics differently, especially on site in Italy. To be able to work with these professor's in such an intimate group setting is one of the perks only HAA can provide. Prof Necipolgu did a wonderful job of making the Ottoman material accessible for those of us with more traditional Renaissance backgrounds. Moreover, her enthusiasm for the topic and for her students' success made the course highly enjoyable and interesting. I would recommend any HAA concentrator, whether knowledgable about the Mediterranean or not, to take this course. The professors have so much to offer, and you will be a better student for having this experience.","Professor Necipoglu is incredibly well-versed in Mediterranean architecture, and she was always willing to guide us in our own exploration of the field. There's a lot of freedom in terms of the topic you choose to focus on for the class, which is great.","This class encourages you to think in a way that includes spans both cultural and art historical boundaries. It introduces a Mediterranean way of thinking that is new, but definitely on the rise. Professor Necipoglu and Professor Payne work together with amazing cohesion and create a class that enables you to connect and consider art from around the world."]}},"mostRecentQ":{"overall":"4.70","workload":"4.60","difficulty":null,"recommendation":"4.90","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"HAA 122X","course_id":"13566","cat_num":"121805","1s":"0","2s":"0","3s":"0","4s":"3","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HAA 122X","course_id":"13566","cat_num":"121805","1s":"1","2s":"7","3s":"2","4s":"0","5s":"0"}},"success":true}