{"scores":{"Fall '15":{"course_score":{"overall":"4.70","workload":"3.70","difficulty":null,"recommendation":"4.30","enrollment":"3","response rate":"100.00","QCourseOverall":{"number":"HEB 1351","course_id":"12487","cat_num":"124949","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HEB 1351","course_id":"12487","cat_num":"124949","1s":"0","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1351","cat_num":"124949","course_id":"12487","year":"2015","term":"1","id":"671ea5ffd6d04572731db6b688b8604e","first":" Lara","last":"Durgavich","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"3.30","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.30"}]},"Fall '14":{"course_score":{"overall":"4.30","workload":"5.40","difficulty":null,"recommendation":"4.30","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"HEB 1351","course_id":"12487","cat_num":"124949","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HEB 1351","course_id":"12487","cat_num":"124949","1s":"0","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1351","cat_num":"3408","course_id":"12487","year":"2014","term":"1","id":"671ea5ffd6d04572731db6b688b8604e","first":" Lara","last":"Durgavich","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Fall '14":{"comments":["This is an amazing course, one of the best I have taken at Harvard and definitely one of the highlights of being an HEB concentrator. Lara did an incredible job of taking the complicated anatomy and physiological processes underlying the entirety of reproduction and explaining it in a way that both made sense and allowed me to easily pick up the relevant terminology. The three exam format may seem daunting, but it really helps you stay on top of the material and the paper at the end of the semester is really enjoyable if you pick a topic you are interested in. I would definitely, highly recommend this course!","interesting class, but be prepared to memorize and regurgitate everything on the slides for exams","This is a relatively low workload course (no section) and peaks in work around exam time. It was difficult toward the end of the course because you have an exam immediately after Thanksgiving and then a paper due just about a week later. The readings are not very long and are interesting; you do have to do them, as you have to submit two discussion questions per class.","This is a great class and I learned a lot, but it does focus on quite a specific topic, so just make sure you are really interested in that. If you are, you will have a great semester. The workload is very reasonable, the assignments are fair, and Lara is great!","This class is interesting and organized. There isn't usually an overwhelming amount of reading, although the readings can be very dense. The exams require a lot of memorizing and sometimes are graded a bit harshly.","For anyone interested in the reproductive system this is the class for you. The material itself is very interesting and there are a lot of different topics within this discipline. Lara is also great about meeting with people and talking about other studies that have been done.","great class! very interesting material. mainly physiology at the beginning (which i loved) and then the second two units were the ecology part of the course (energetics and lactation, etc) which was also interesting, but was a little bit repetitive but still great to learn about and discuss. The midterms are fair and the final paper is pretty open so you can really enjoy it. Lara is great."]},"Fall '15":{"comments":["This course is a great gateway into the HEB department and is also incredibly interesting.  I recommend it.","This course is very interesting. I learned a lot but I wasn't particularly inspired to continue with Human Evolutionary Biology.","This course covers extremely interesting material in a very organized way. The assessments are very fair and well spaced."]}},"mostRecentQ":{"overall":"4.70","workload":"3.70","difficulty":null,"recommendation":"4.30","enrollment":"3","response rate":"100.00","QCourseOverall":{"number":"HEB 1351","course_id":"12487","cat_num":"124949","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HEB 1351","course_id":"12487","cat_num":"124949","1s":"0","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}