{"scores":{"Spring '16":{"course_score":{"overall":"4.70","workload":"4.60","difficulty":null,"recommendation":"4.70","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"HEB 1600","course_id":"13966","cat_num":"161269","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HEB 1600","course_id":"13966","cat_num":"161269","1s":"1","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1600","cat_num":"161269","course_id":"13966","year":"2015","term":"2","id":"a90b70e9117b90a137b1a97e0a74d37e","first":" Maryellen","last":"Ruvolo","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.10"}]}},"comments":{"Spring '16":{"comments":["If you're interested in the topic and enjoy seminars this class is a great way to delve into genetics.","Professor Ruvolo is incredibly enthusiastic about this very interesting topic. Always come having read the papers thoroughly, but don't be afraid if you can't understand all the methods. The class encourages all questions and is a comfortable, relaxed environment that facilitates active participation. I highly recommend this class!","This is a really fun seminar. Definitely take if you're interested in genetics. Prof. Ruvolo makes sure to explain every paper so even if it's been a couple years since LS1b you won't be lost (but you won't be bored either, even if you've had a lot of experience in bio). The topics jump around a bit but are all interesting. Assignments include a short reading response every week and a big paper at the end of the semester on any topic in genetics.","Take it!!! This class covered challenging material, but you will grow so much for taking it. Genetics is an often overlooked part of HEB, and this class gives you an amazing opportunity to explore it further. You will learn so much in a short period of time. If you put the work in, you will leave the course as an infinitely more knowledgeable and experienced student.","Come to class prepared to contribute intensively to discussions. Keep your mind open and be receptive to the crazy ideas other people come up with because they can enrich your understanding.","If you like learning about the current research topics and methodologies in genetics, or if you're just interested in various complex diseases, this is a really good class to take."]}},"mostRecentQ":{"overall":"4.70","workload":"4.60","difficulty":null,"recommendation":"4.70","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"HEB 1600","course_id":"13966","cat_num":"161269","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HEB 1600","course_id":"13966","cat_num":"161269","1s":"1","2s":"5","3s":"1","4s":"0","5s":"0"}},"success":true}