{"scores":{"Fall '15":{"course_score":{"overall":"4.20","workload":"5.80","difficulty":null,"recommendation":"4.30","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"HEB 1480","course_id":"12488","cat_num":"156174","1s":"0","2s":"0","3s":"2","4s":"1","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HEB 1480","course_id":"12488","cat_num":"156174","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1480","cat_num":"156174","course_id":"12488","year":"2015","term":"1","id":"85c7bd61b373969d123929119c884f01","first":" Terence D.","last":"Capellini","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.50"},{"number":"HEB 1480","cat_num":"156174","course_id":"12488","year":"2015","term":"1","id":"ddb20dfc9b5f91b972afaba81c166398","first":" Neil Thomas","last":"Roach","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Spring '15":{"course_score":{"overall":"3.70","workload":"5.00","difficulty":null,"recommendation":"3.70","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"HEB 1480","course_id":"12488","cat_num":"156174","1s":"0","2s":"0","3s":"2","4s":"1","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HEB 1480","course_id":"12488","cat_num":"156174","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1480","cat_num":"156174","course_id":"12488","year":"2014","term":"2","id":"517763dd0fd2e6fd9a2fb9995263409a","first":" David","last":"Pilbeam","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.30"},{"number":"HEB 1480","cat_num":"156174","course_id":"12488","year":"2014","term":"2","id":"85c7bd61b373969d123929119c884f01","first":" Terence D.","last":"Capellini","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.00","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '15":{"comments":["This course was already excellent and will only get better with time. The material is dense, but the final project is incredibly rewarding because the Professors are committed to helping you pursue independent research. Make sure you are clear with what is expected of you on exams, and be prepared to have a few days where you walk out of the class feeling like your head is busting to the seam with info. It's worth it, though: even if you walk away having remembered very little of the facts presented to you, the way this class teaches you to think about evolution is well worth your time!","This course can be a great way to gain information on genetic and genomic analytical research. It teaches practical lab skills and thinking strategies that could be helpful for future thesis research or post-grad research.","Only take this class if you are a masochist. The grading is harsh, the group assignment is daunting. They expected everyone to come up with a potential thesis worthy project, despite the fact that 5 out of 7 students were seniors. Speaking of which, they did not respect the fact that we all had jobs to find\/athlete schedules\/theses to finish\/other classes to pass. I tried to enjoy the class, but it was painful. Don't put off your HEB requirements and only take this class if you want to turn it into a senior thesis.","I absolutely loved this class, but I knew going into it that it was \"up my alley.\"  If you love interdisciplinary fields and already have an interest in genetics and\/or primate morphology, I'd say definitely take this class.  If you don't already love these subjects, it could be worth taking a broader overview course first and then enrolling in this class.  That said, this is a very unique class, and Professor Capellini is one of the best professors I've had at Harvard...he is SO passionate about the subject, really cares about the success of his students, and explains concepts so clearly and thoroughly it's amazing!"]},"Fall '15":{"comments":["This is not an easy class by any means but you will learn a lot about evolutionary developmental biology. Definitely take this class if you are interested in the field but be prepared to think, read, and learn a lot of material! \r\nI highly recommend this class if you meet those criteria!","It will be very challenging, but very rewarding","The concept for this course is fascinating. In execution, the professors are always open to feedback and will really try to make the course what you want and need it to be. At the same time, this type of course really does demand initiative on the student's part- especially when it comes to the research projects. All of the grading -exams and quizzes- are very fair and reasonable. If you put in a little work, you'll have the support and expertise you need to execute an independent research project at your fingertips.","It's very difficult to know what the professors want. Vaguely worded questions on the quizzes and exams, and then the final project was just pretty disorganized. If you take this class, you should try to meet with the professors early and often (and together--they'll tell you different things if you go to one and then the other separately, and then everyone ends up on different pages and it's just chaotic) in order to really get them to be clear about what's expected of you and how you'll be graded. I spent most of the semester just being confused and getting tons of conflicting information. They need to step up their organization game."]}},"mostRecentQ":{"overall":"4.20","workload":"5.80","difficulty":null,"recommendation":"4.30","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"HEB 1480","course_id":"12488","cat_num":"156174","1s":"0","2s":"0","3s":"2","4s":"1","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HEB 1480","course_id":"12488","cat_num":"156174","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"}},"success":true}