{"scores":{"Spring '15":{"course_score":{"overall":"4.90","workload":"7.30","difficulty":null,"recommendation":"5.00","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"HIND-URD 101AB","course_id":"12645","cat_num":"156520","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIND-URD 101AB","course_id":"12645","cat_num":"156520","1s":"0","2s":"6","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIND-URD 101AB","cat_num":"156520","course_id":"12645","year":"2014","term":"2","id":"37954953ac0282d9fb7f598d265dbc44","first":" Richard Somers","last":"Delacy","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '15":{"comments":["TAKE THIS COURSE! Richard ji is the undoubtedly the GREATEST instructor I have encountered at Harvard so far. He is indomitably enthusiastic, profoundly knowledgeable, and deeply invested in his students' success. It is remarkable to reflect upon how much our class learned so much in such little time, while enjoying it. This compressed version requires a very serious interest in learning the language and an intense daily time commitment; however, if you want to learn Hindi-Urdu, the time will fly by and you will learn way more than you otherwise would in a less intense setting. Take it if you want to have something to look forward to everyday.","The teacher is great!","This class is incredible, whether or not you already know Hindi. It gives a comprehensive overview of Hindi grammar as well as an introduction to South Asian culture. It is exciting for students of all levels, and Professor Delacy is hilarious and makes the class so enjoyable. Even though the class was everyday, it did not feel like a burden at all and I actually looked forward to it.","Richard ji's name proceeds him. He is absolutely the best teacher I have had at Harvard. His ability to break down complex linguistic concepts into easy to swallow chunks is incredible.\r\n\r\nThe amount of time you have to put into this class (between the many hours of class and homework) may seem formidable, but there is no class I would recommend higher at Harvard. You will come away having learned a HUGE amount of Hindi. Probably even enough to go to India and learn to be functional within a few months through immersion.","Richard really made the course for me. If he continues to teach it, I definitely recommend taking the course. I could imagine things getting quite dreary with a less generous and entertaining instructor."]}},"mostRecentQ":{"overall":"4.90","workload":"7.30","difficulty":null,"recommendation":"5.00","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"HIND-URD 101AB","course_id":"12645","cat_num":"156520","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIND-URD 101AB","course_id":"12645","cat_num":"156520","1s":"0","2s":"6","3s":"1","4s":"0","5s":"0"}},"success":true}