{"scores":{"Fall '15":{"course_score":{"overall":"4.60","workload":"5.90","difficulty":null,"recommendation":"4.50","enrollment":"19","response rate":"73.68","QCourseOverall":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"0","2s":"0","3s":"1","4s":"4","5s":"9"},"QDifficulty":{"number":"URD 101","course_id":"4811","cat_num":"4078","1s":"1","2s":"4","3s":"8","4s":"1","5s":"1"},"QWorkload":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"2","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIND-URD 101A","cat_num":"113639","course_id":"4811","year":"2015","term":"1","id":"896d9c98bb849a3a2ffaa734db4fc68f","first":" Amy","last":"Bard","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '14":{"course_score":{"overall":"4.80","workload":"9.70","difficulty":null,"recommendation":"4.80","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"0","2s":"0","3s":"1","4s":"4","5s":"9"},"QDifficulty":{"number":"URD 101","course_id":"4811","cat_num":"4078","1s":"1","2s":"4","3s":"8","4s":"1","5s":"1"},"QWorkload":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"2","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HINDI-URDU 101","cat_num":"4078","course_id":"4811","year":"2014","term":"1","id":"896d9c98bb849a3a2ffaa734db4fc68f","first":" Amy","last":"Bard","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '14":{"course_score":{"overall":"4.60","workload":"2.60","difficulty":"2.80","recommendation":"4.70","enrollment":"19","response rate":"78.95","QCourseOverall":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"0","2s":"0","3s":"1","4s":"4","5s":"9"},"QDifficulty":{"number":"URD 101","course_id":"4811","cat_num":"4078","1s":"1","2s":"4","3s":"8","4s":"1","5s":"1"},"QWorkload":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"2","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2013","term":"2","id":"37954953ac0282d9fb7f598d265dbc44","first":" Richard","last":"Delacy","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"5.00"},{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2013","term":"2","id":"896d9c98bb849a3a2ffaa734db4fc68f","first":" Amy","last":"Bard","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Fall '13":{"course_score":{"overall":"4.30","workload":"2.40","difficulty":"2.80","recommendation":"4.60","enrollment":"18","response rate":"88.89","QCourseOverall":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"0","2s":"0","3s":"1","4s":"4","5s":"9"},"QDifficulty":{"number":"URD 101","course_id":"4811","cat_num":"4078","1s":"1","2s":"4","3s":"8","4s":"1","5s":"1"},"QWorkload":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"2","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2013","term":"1","id":"37954953ac0282d9fb7f598d265dbc44","first":" Richard Somers","last":"Delacy","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.90"},{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2013","term":"1","id":"896d9c98bb849a3a2ffaa734db4fc68f","first":" Amy","last":"Bard","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Spring '13":{"course_score":{"overall":"4.44","workload":"2.59","difficulty":"2.94","recommendation":"4.47","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"0","2s":"0","3s":"1","4s":"4","5s":"9"},"QDifficulty":{"number":"URD 101","course_id":"4811","cat_num":"4078","1s":"1","2s":"4","3s":"8","4s":"1","5s":"1"},"QWorkload":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"2","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2012","term":"2","id":"37954953ac0282d9fb7f598d265dbc44","first":" Richard Somers","last":"Delacy","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.65","AccessibleOutsideClass":"4.56","GeneratesEnthusiasm":"4.88","FacilitatesDiscussionEncouragesParticipation":"4.75","GivesUsefulFeedback":"4.31","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Fall '12":{"course_score":{"overall":"4.25","workload":"3.00","difficulty":"3.06","recommendation":"4.06","enrollment":"19","response rate":"84.21","QCourseOverall":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"0","2s":"0","3s":"1","4s":"4","5s":"9"},"QDifficulty":{"number":"URD 101","course_id":"4811","cat_num":"4078","1s":"1","2s":"4","3s":"8","4s":"1","5s":"1"},"QWorkload":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"2","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2012","term":"1","id":"b734a65a5e0b66fad7b18d12f2eab69d","first":"Ali S.","last":"Asani","InstructorOverall":"4.31","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.71","GeneratesEnthusiasm":"4.25","FacilitatesDiscussionEncouragesParticipation":"4.21","GivesUsefulFeedback":"4.09","ReturnsAssignmentsinTimelyFashion":"4.38"}]},"Spring '12":{"course_score":{"overall":"4.41","workload":"2.53","difficulty":"2.88","recommendation":"4.53","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"0","2s":"0","3s":"1","4s":"4","5s":"9"},"QDifficulty":{"number":"URD 101","course_id":"4811","cat_num":"4078","1s":"1","2s":"4","3s":"8","4s":"1","5s":"1"},"QWorkload":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"2","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2011","term":"2","id":"37954953ac0282d9fb7f598d265dbc44","first":"Richard Somers","last":"Delacy","InstructorOverall":"4.64","EffectiveLecturesorPresentations":"4.64","AccessibleOutsideClass":"4.64","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.55","GivesUsefulFeedback":"4.11","ReturnsAssignmentsinTimelyFashion":"4.22"},{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2011","term":"2","id":"5f2a8c9f029f6270a57d7a8eb9733c36","first":"Naseem A.","last":"Hines","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"4.67"}]},"Fall '11":{"course_score":{"overall":"4.55","workload":"2.18","difficulty":"2.77","recommendation":"4.57","enrollment":"25","response rate":"88.00","QCourseOverall":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"0","2s":"0","3s":"1","4s":"4","5s":"9"},"QDifficulty":{"number":"URD 101","course_id":"4811","cat_num":"4078","1s":"1","2s":"4","3s":"8","4s":"1","5s":"1"},"QWorkload":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"2","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2011","term":"1","id":"37954953ac0282d9fb7f598d265dbc44","first":"Richard Somers","last":"Delacy","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.93","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.69","ReturnsAssignmentsinTimelyFashion":"4.92"},{"number":"URD 101","cat_num":"4078","course_id":"4811","year":"2011","term":"1","id":"5f2a8c9f029f6270a57d7a8eb9733c36","first":"Naseem A.","last":"Hines","InstructorOverall":"3.71","EffectiveLecturesorPresentations":"3.86","AccessibleOutsideClass":"3.86","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.25","ReturnsAssignmentsinTimelyFashion":"4.33"}]}},"comments":{"Fall '11":{"comments":["Know Urdu ahead of time. Everyone else will already speak it, and your professor will probably increase the amount of work you have to do so other people aren't bored. If you are actually taking this because you don't speak a word of Urdu or Hindi and want to learn, be prepared for this to be the hardest you've ever worked just to earn a C.","Richard is an amazing language instructor!!! Take this class! It's a lot of fun you and genuinely come out of it having learned a lot.","If you have an interest in learning urdu\/hindi, you should definitely take this class. Professor Hines is a great teacher and really makes the class enjoyable.","The class is very well taught; I feel that I already have a good command over the basics of the language, especially with regards to reading and writing. The cultural component of the course is also very enriching (the use of Bollywood music to teach vocabulary is particularly fun).","This class is awesome and so much fun!! Richard Ji is the best instructor ever and he makes learning the language really fun and helps you not get discouraged when it's difficult. It's also not too hard to time-consuming, so if you're thinking about taking I would highly recommend it!","This class teaches so much in just a few months and Richardji is a wonderful, enthusiastic professor.","If you want a stress-free, fun introduction to Hindi\/Urdu, this is the class for you.","Richardji is amazing.. You learn Hindi\/Urdu quite well.","This class is a very good language class overall. If you're looking for a fun language or good language experience you should take Urdu! The professor is wonderful and the class environment is very encouraging. After the first semester I feel like I have learned a lot of useful things conversationally.","Class is full of heritage speakers; if you've not been exposed to Urdu-Hindi before, you'll find it difficult to keep up.","This class is really well taught.  I walked out of the first semester learning more than I thought I would. I can now read the news in Urdu and Hindi and understanding most things just after one semester!","Great course and a fun language to learn!","If you have any interest in Urdu\/Hindi, take this course, and take Richard Delacy if you can. He's brilliant and hilarious, a fantastic teacher, and the workload is quite reasonable."]},"Fall '12":{"comments":["This is a good introductory course for Hindi. It was significantly more time intensive than I thought it was going to be.","The teaching style is great and you'll find yourself effortlessly learning two new script. If you're taking this as an elective be warned that there is more homework than I expected. You may spend at least an hour a night on it.","This is a good start for learning Hindi-Urdu. You'll learn the scripts, and you'll probably have enough fun to want to continue. Perhaps an intensive course option would be good for those who want to cover more ground and get speaking sooner.","Intro Hindi\/Urdu is a wonderful class.  If you're looking for a fun and interesting foreign language, Hindi\/Urdu certainly will be fulfilling.  Professor Asani is a kind and encouraging instructor, and he makes tackling a challenging subject a manageable task.","It involves a lot of work! The homework can take up two three hours a day.","It is a lot of work so be ready to spend hours a day outside of class.","It is difficult to learn to speak the language but the teachers are very helpful.","With Professor Asani teaching, this class became probably much more work than it is when Richard-ji teaches it. However, it's still good, so if you're interested, go for it.","If you're interested in learning either Urdu or Hindi, take this course. It's well-taught, and relatively laid back, but you'll get some interesting language skills out of the deal. Professor Asani, if he teaches again, is excellent.","A comprehensive course in which you will learn the urdu and devanagari scripts as well as gaining a solid grasp on Hindi as a whole through song, skits, group work, and maybe even dance...."]},"Spring '13":{"comments":["It is a very good course but sometimes work intensive.  Don't take it to just satisfy a language requirement if you're not interested in the language itself.","The course is an effective introduction that will equip a motivated student with the resources needed to progress further. Relatively painless course, if with a somewhat chaotic class atmosphere at times. And lots of laughs!","This is a great introduction to Urdu-Hindi. It is fun, engaging, and very low stress.","This is a very laid-back language class. You'll get the grammar basics, but you won't learn as much as you could if the instructors made the course more demanding. You also won't necessarily improve much in listening comprehension and speaking.","It's a great class, though it can be a good amount of work to learn two scripts in one year.","I would tell future students that after completing this course they will have a strong handle on both the scripts and oral components of urdu\/hindi, as well as having a a knowledge of the cultures these languages are rooted in.","This class is a lot of fun. Richardji is an incredible instructor -- he generates so much enthusiasm and the class moves at a manageable but quick pace.  You learn a lot over the course of the year!  The assignments are fair and very helpful.","This course is so fun. Richard is awesome. Only warning is that homework varies a lot. Some days it will take you a lot longer than you expect.","Richard is literally the best language instructor in the world and just a great, great man.","This class is super fun. Richard-ji and Gokul-ji are both fantastic, fun, and knowledgeable.","a lot of work...but its worth it!"]},"Fall '13":{"comments":["This is the best language class I have ever taken. Please make the right choice and choose this class. Richard Delacy is one of the best instructors I have ever come across, and he is so funny.","Dr. Delacy is incredibly knowledgeable and an effective lecturer who truly has the right mindset when it comes to teaching. If you have any interest at all in Hindi-Urdu or doubt if this is the right language for you, please shop it. You will be convinced to take it.","This is definitely one of the best courses at Harvard. But its success is not the direct product of Urdu's being such a beautiful script. It is truly the professor, Richard Ji, and the TF, Nicolas, that make this course so wonderful.","Richard-ji is a very good teacher, and his lectures are hilarious. The class is a lot of work sometimes, but overall it was a really fun experience.","Fun, fun, fun!!!! A must take! Useful and a bit time consuming, but very knowledgeable.","Richard is amazing. Definitely take this course if you want to learn Urdu-Hindi in a fun environment! You can't go wrong here. Both Richard and Nicolas make themselves available for questions, and both are extremely knowledgeable about Urdu-Hindi.","This class is a good introduction to the basic grammar of Urdu\/Hindi. The first half of semester one moves a bit more slowly as you get accustomed to the script and basic sentence structure. The second half of the first semester speeds up a lot more once you start learning more complicated clauses and structures, so be ready for it!","This is a wonderful course if you have any interest in learning Urdu and Hindi. Needless to say, don't take it unless you're interested in learning these languages. Richard ji's section is not stressful and you can learn a tremendous amount in very little time."]},"Spring '14":{"comments":["The teachers are really good. They take measures to learn about each individual student and make the class useful for them. The teachers are also very hard-working, devoted, and enthusiastic. Going to class was always fun in addition to very educational. The teachers were always very available to meet outside of class and continue to be after the class is over. They clearly care about the progress, well-being, and improvement of their students beyond the call of duty. I asked to join the course half-way through and they let me join and participate however I could even though I did not read the Urdu script. I was worried at first (before meeting the teachers) that they would frown upon my joining, but from the very first few seconds of talking to them it became clear that they are true educators who just want students to learn and to do everything they can for students.","Don't wait until the last minute to do the daily homework assignments. They can be relatively long, especially if there's a conversation that needs to be translated.","Take this class! Really, do it.","PLEASE DO YOURSELF A FAVOR AND TAKE THIS CLASS!!!! It is one of the most amazing courses I have ever taken, and Richard Ji is amazingly understanding.","If you want to learn Urdu-Hindi, take the class. You'll come out of it able to read both Nastaliq and Devanagari, and with a working knowledge of most of the grammar. The teaching staff are all friendly, and the class feels very much like a community.","If you have an inch of an interest in this class or simply need to do your foreign language requirement, this is the course for you.","This class is a great way to learn the basic grammatical structures of urdu\/hindi as well as some useful vocabulary. There is not a lot of homework, and the instructors are very understanding. Class time can be a ton of fun. It's not a super rigorous course, so I wouldn't expect to know much more than the basics by the end of the year."]},"Fall '14":{"comments":["I would just say that if you have never had exposure to this language, make sure to go to office hours.  The material isn't hard but it takes time to master and the class is very fast paced thuspractice as much as possible!","Amy and Nicholas are great! Really good way to fulfill your language requirement, even if you have no exposure. Can be fast paced at times though.","Ask for help when needed and keep on top of the work--it adds up!","Hindi-Urdu is a great class if you're at all interested in ever travelling to South Asia. The regularity of class helps you practice and both the preceptor and TF are always looking to help you and meet outside of class.","If you're interested in learning a new language and new script absolutely consider it!","It's a great way for beginners to learn the languages."]},"Fall '15":{"comments":["Fantastic course, very well taught.","This class will actually teach you how to speak, write, and understand Urdu and South Asian culture\/religion\/practices. The workload is manageable and expected if you really wish to learn Hindi\/Urdu. This is the best class I have taken at Harvard so far.","Most of the kids know the language a little bit, so it would be hard to compete with them if you are coming into the class blind.","Like most language courses, this course requires a daily commitment to really get the most out of the course.","If you already speak Urdu-Hindi but are not familiar with the script, you may want to weigh the pros-cons of taking this class. Perhaps trying to learn the script on your own or by auditing the class (you would have to get special permission because it is not allowed) would be better because basic grammar is taught and if you are already advanced and can understand basic Urdu-Hindi, it may serve you better to move on to a higher level course.\r\n\r\nOther than that, this is a phenomenal intro course. Nicolas jÄ« is an amazing teacher and is really invested in the educational experience of his students. He is very knowledgeable and teaches you about the cultural undertones of things as well and it is just an overall awesome experience. Definitely recommend this class.","Nicolas (our TF\/teacher) is awesome! I think he may be graduating but I've only heard good things about the other potential professors. You rapidly learn in the class and as an intro class it's super forgiving and chill which makes for a great class. YOU ACTUALLY LEARN SOMETHING USEFUL IN THIS CLASS AND IT'S FUN!","Incredible that I can now read Urdu script and understand beginning Urdu-Hindi. This class is a portal to so many worlds (South-Asia and beyond because of understanding the Perso-Arabic script). The class is F A S T paced and was my biggest time commitment. If you want to feel comfortable with the material it will take time to learn the script, vocab, grammar, etc. This being said, this is the most rewarding class I have ever taken. \r\nMake sure to go to Office hours each week for extra help!","If you are a heritage Hindi speaker who never quite learned to speak Hindi fluently, like I am, then this is a great course to take. I already knew Devanagari and worried that the Urdu focus would feel like a waste of time. That worry was unfounded. I admittedly may not end up using Urdu script after I leave Harvard, but learning the script has actually been a fun challenge. I have already seen my Hindi improve and I am able to converse more freely with my parents in my native tongue. That has been a blessing. If you find the course a little bit too easy, just go to Office Hours. Nicolas-ji (or whoever is teaching it), will likely be very happy to challenge you and to converse with you in tenses that have not been covered in the course yet.","If you are interested in the South Asian culture, this is the right course for you. After all, you can't fully appreciate the culture without knowing a bit about the language.","You'll learn how to read and write urdu script really well and have basic conversational skills"]}},"mostRecentQ":{"overall":"4.60","workload":"5.90","difficulty":null,"recommendation":"4.50","enrollment":"19","response rate":"73.68","QCourseOverall":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"0","2s":"0","3s":"1","4s":"4","5s":"9"},"QDifficulty":{"number":"URD 101","course_id":"4811","cat_num":"4078","1s":"1","2s":"4","3s":"8","4s":"1","5s":"1"},"QWorkload":{"number":"HIND-URD 101A","course_id":"4811","cat_num":"113639","1s":"2","2s":"7","3s":"5","4s":"0","5s":"0"}},"success":true}