{"scores":{"Spring '15":{"course_score":{"overall":"4.50","workload":"3.60","difficulty":null,"recommendation":"4.60","enrollment":"20","response rate":"75.00","QCourseOverall":{"number":"HIST-LIT 90BJ","course_id":"12840","cat_num":"156734","1s":"1","2s":"2","3s":"8","4s":"11","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST-LIT 90BJ","course_id":"12840","cat_num":"156734","1s":"13","2s":"10","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST-LIT 90BJ","cat_num":"156734","course_id":"12840","year":"2014","term":"2","id":"e5607765bcd9f07bdebc23d8222b10c5","first":" Timothy Patrick","last":"McCarthy","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"3.90"}]}},"comments":{"Spring '15":{"comments":["A class that will be different from anything else you have experienced at Harvard! Though at times it is a bit disorganized or haphazard, that is totally outweighed by the opportunity to study with Professor McCarthy, the unique and thought provoking assignments, and the combination of archival materials and new works of theater (plus their artists) that make up the bulk of the syllabus. The class also draws a wonderful array of students with various expertise and personal experiences that it was great to get to know.","A once-in-a-lifetime class with the one and only Tim McCarthy. Talking with acclaimed playwrights about their work in an intimate setting, touring Harvard's archives, and thinking about academic material with a creative lens -- these things don't happen in Harvard classes normally. If this class is ever offered again, TAKE IT.","Take every class you can with McCarthy, he is the best. Getting to see Father Comes Home From the Wars and having playwrights and artists like Suzan-Lori Parks come in to talk with us was one of the most fantastic opportunities I've had in a class at Harvard. I loved doing the final scene especially because I have a passion for creative writing\/poetry\/theatre\/playwriting\/performance, and I rarely get to do this kind of creative work in an academic setting for credit. Not having to separate those two integral parts of myself was so refreshing. And the prime example of this is Professor McCarthy himself, who shows me that I can be artist and a scholar and pursue my passion for creative work, and that that's totally legitimate. Thank you for this class, now I can't wait to go write more scenes!","McCarthy is so accessible and so fun and very smart.","If you're interested in any one component of this class--theater, the Civil War, Tim McCarthy--then it will make you obsessed with the other components. Take a TPM class at some point while you're here if you're in the humanities. The dude will change you.","A really wonderful opportunity to consider the complex relationship between history and art.","This class was inspirational and powerful. A must take if you're interested in both performance art and history.","This was a life changing class. I grew so much as a student and as a person. While it was a bit disorganized the first time it was taught, the course will be even better next year I'm sure, so I highly recommend it. The balance of creative and analytical discussion and assignments allowed me to engage with painful and true ongoing dilemmas in a deep deep way.","I would enthusiastically recommend this course with reservations. It's an awesome adventure, and it was so cool to make a head first dive into creative writing from the comfort of the historical. I loved it all. That being said, it is an adventure, and you have to let go of the any need for stability\/control going in"]}},"mostRecentQ":{"overall":"4.50","workload":"3.60","difficulty":null,"recommendation":"4.60","enrollment":"20","response rate":"75.00","QCourseOverall":{"number":"HIST-LIT 90BJ","course_id":"12840","cat_num":"156734","1s":"1","2s":"2","3s":"8","4s":"11","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST-LIT 90BJ","course_id":"12840","cat_num":"156734","1s":"13","2s":"10","3s":"4","4s":"0","5s":"0"}},"success":true}