{"scores":{"Spring '16":{"course_score":{"overall":"3.30","workload":"6.70","difficulty":null,"recommendation":"3.50","enrollment":"11","response rate":"54.55","QCourseOverall":{"number":"HIST 2805","course_id":"2508","cat_num":"119090","1s":"1","2s":"1","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"HIST 2805","course_id":"2508","cat_num":"8070","1s":"0","2s":"0","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"HIST 2805","course_id":"2508","cat_num":"119090","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST 2805","cat_num":"119090","course_id":"2508","year":"2015","term":"2","id":"1e2c946cabb986206571f07b9324dc48","first":" Afsaneh","last":"Najmabadi","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '13":{"course_score":{"overall":"4.71","workload":"3.29","difficulty":"3.57","recommendation":"4.71","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"HIST 2805","course_id":"2508","cat_num":"119090","1s":"1","2s":"1","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"HIST 2805","course_id":"2508","cat_num":"8070","1s":"0","2s":"0","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"HIST 2805","course_id":"2508","cat_num":"119090","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST 2805","cat_num":"8070","course_id":"2508","year":"2012","term":"2","id":"1e2c946cabb986206571f07b9324dc48","first":" Afsaneh","last":"Najmabadi","InstructorOverall":"4.86","EffectiveLecturesorPresentations":"4.71","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.83","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '10":{"course_score":{"overall":"4.18","workload":"3.64","difficulty":"3.82","recommendation":"4.55","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"HIST 2805","course_id":"2508","cat_num":"119090","1s":"1","2s":"1","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"HIST 2805","course_id":"2508","cat_num":"8070","1s":"0","2s":"0","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"HIST 2805","course_id":"2508","cat_num":"119090","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST 2805","cat_num":"8070","course_id":"2508","year":"2010","term":"1","id":"1e2c946cabb986206571f07b9324dc48","first":"Afsaneh","last":"Najmabadi","InstructorOverall":"4.73","EffectiveLecturesorPresentations":"4.75","AccessibleOutsideClass":"4.82","GeneratesEnthusiasm":"4.82","FacilitatesDiscussionEncouragesParticipation":"4.43","GivesUsefulFeedback":"4.75","ReturnsAssignmentsinTimelyFashion":"4.86"}]}},"comments":{"Fall '10":{"comments":["This class is difficult but not impossible. Invest the time in the readings, talk to Prof Najmabadi outside of class, try to find a paper topic as early as possible (so you can do some real digging), and just be as open as possible to abstract theories!","This class focuses much more on the medieval period than on modern day gender and sexuality, which is not the impression that you necessarily get when glancing over the syllabus.","This class is a lot of work but very well worth it. The readings are excellent, however, class discussion can be very dependent on other students - prepare for the discussion to possibly go in a direction you may not find particularly constructive. This is nonetheless the best class I've taken at Harvard. It values critical thinking above all else and prof. Najmabadi is very helpful and knowledgeable.","The readings are incredible and Najmabadi sets you up for success with early deadlines for the paper components and insightful feedback. The class touches on more topics than can even be packed into the title, including race, language, ethnography and interdisciplinary research. It does go pretty light on East Asia, though- this is really an Islam-centered, Middle East\/South Asia-oriented course.","This is a serious course. The reading load is heavy and - partially because its just so interesting, partially because of the semianr format - you will be expected to have actually read it all. Also, start planning your final paper as early as possible. Professor Najmabadi devotes almost three weeks to paper presentions and draft-work but the more work you have done prior to these session the more work you will get out of it.","It's a lot of reading, but most of them are very interesting. The research paper is a great project, and the various components (bibliography, draft, final paper) are good for ensuring that you're on the right track.  They also provide ample opportunities for feedback BEFORE the final paper, when most classes first give feedback.","This course provides a spirited discussion and a helpfully disruptive way to think about gender and sexuality in history."]},"Spring '13":{"comments":["This class was excellent and you will learn much from both the professor and the students in the class. Professor Najmabadi's feedback is thorough and great. You will learn a lot about historical method as well as how to approach research. The workshop format for some class sessions where other students provided feedback on papers and research ideas can be very helpful. The multi-step research paper was beneficial in many ways including helping one to not be overwhelmed with most of the work later into the semester and because the feedback Professor Najmabadi provides is thorough and useful. And while to some students the assignments can seem a bit much, they are helpful and can develop you as a scholar: the multiple presentations will help you to develop your presentation skills, and the weekly assignments help one to think about the material in different ways.","An excellent course that gives insight into a topic that is always in the news but rarely analyzed or discussed with any clarity or historical grounding.","A great course that prepares you for your future research.  This is one of the few graduate classes in which you will receive serious feedback both from your peers and from the professor on your work.  It requires to work hard, but it's definitely worth it.  Professor Najmabadi is very dedicated to teaching, and she is genuinely interested in the students' contribution to class."]},"Spring '16":{"comments":["This has been one of the best classes I have taken at Harvard.","This course is phenomenal, in part because of the structured assignments surrounding the final paper in which not only the professor, but also the students, give immensely helpful critical feedback in order to develop a strong final paper by the end of the semester.","Far too broad. The instructor is not good at facilitating positive in-class discussion. There is no lecture component (this reviewer took this course after having read the instructor's first major publication; evidently, as one often realizes in academia, there is a disjuncture between a scholar's writing and lecture styles). The instructor requires very long and complex writing and a weekly response paper. Far too much and does not allow students to do what US academia teaches them to do: learn to not read everything and only read what you know you can, are interested in, and can talk about. Weekly response papers end up causing a mad rush to skim ALL readings for whatever simple citations once can find in order to compile a 2 page response to 4 + readings all 30+ pages each, if not more (e.g. entire book)."]}},"mostRecentQ":{"overall":"3.30","workload":"6.70","difficulty":null,"recommendation":"3.50","enrollment":"11","response rate":"54.55","QCourseOverall":{"number":"HIST 2805","course_id":"2508","cat_num":"119090","1s":"1","2s":"1","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"HIST 2805","course_id":"2508","cat_num":"8070","1s":"0","2s":"0","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"HIST 2805","course_id":"2508","cat_num":"119090","1s":"0","2s":"4","3s":"2","4s":"0","5s":"0"}},"success":true}