{"scores":{"Spring '12":{"course_score":{"overall":"4.60","workload":"3.00","difficulty":"4.00","recommendation":"4.40","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"HIST 80f","course_id":"2353","cat_num":"10546","1s":"0","2s":"0","3s":"1","4s":"2","5s":"7"},"QDifficulty":{"number":"HIST 80f","course_id":"2353","cat_num":"10546","1s":"0","2s":"0","3s":"2","4s":"6","5s":"2"},"QWorkload":{"number":"HIST 80f","course_id":"2353","cat_num":"10546","1s":"0","2s":"2","3s":"6","4s":"2","5s":"0"}},"instructor_scores":[{"number":"HIST 80f","cat_num":"10546","course_id":"2353","year":"2011","term":"2","id":"6b064b2df8489d2df57fdea2678e497d","first":"Michael","last":"McCormick","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.78","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.90"}]}},"comments":{"Spring '12":{"comments":["This class is a really fun way to build up research skills, as well as public speaking\/presentation skills, which aren't emphasized much in most Harvard humanities classes. The workload is a little intense, in terms of the amount of material you have to become familiar with, but is very manageable in terms of number\/type of graded assignments.","This was my favorite course I've taken at Harvard thus far.  The professor is wonderfully enthusiastic, and the workload definitely prepares you for writing a senior thesis.  It's demanding, but it is so worth it.  Just be warned, this course takes over your life.  Also, it really helps to know French, German, or Latin.","I took this course because everyone in McCormick's research seminar last spring absolutely raved about it on the Q. I thought this one was less than fantastic.","It's difficult work and far from the most interesting material, but you simply cannot graduate from Harvard with a history degree without taking a McCormick course. Take this one if you're at all passionate about medieval Europe.","If you have already taken a medieval history class and are interested in pushing yourself incredibly hard on a single topic, or are interested in producing publishable work, this is the class for you.","I highly recommend this course on the merits of the learning experience with Professor McCormick, but caution that only experienced history students take on the work load.","This is what a research seminar should be - a professor who truly believes that his students can come up with new, independent research, and who will do anything to make it happen."]}},"mostRecentQ":{"overall":"4.60","workload":"3.00","difficulty":"4.00","recommendation":"4.40","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"HIST 80f","course_id":"2353","cat_num":"10546","1s":"0","2s":"0","3s":"1","4s":"2","5s":"7"},"QDifficulty":{"number":"HIST 80f","course_id":"2353","cat_num":"10546","1s":"0","2s":"0","3s":"2","4s":"6","5s":"2"},"QWorkload":{"number":"HIST 80f","course_id":"2353","cat_num":"10546","1s":"0","2s":"2","3s":"6","4s":"2","5s":"0"}},"success":true}