{"scores":{"Spring '17":{"course_score":{"overall":"4.50","workload":"4.90","difficulty":null,"recommendation":"4.70","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"HIST 1055","cat_num":"121661","course_id":"10923","year":"2016","term":"2","id":"a7fdf5bc2488632fabb4290914abff77","first":" Daniel Lord","last":"Smail","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Spring '17":{"comments":["A really great course! Not exactly an easy A, but very enjoyable. Professor Smail is very interesting and engaging. Just make sure you participate from day one!","Professor Smail is amazing and so committed to making this class the best experience for the students both in terms of material and assignments. The course was fascinating and fun and one of the my favorite classes I've ever taken.","I genuinely looked forward to coming to class each day to listen to discussion and share my ideas. Professor Smail is one of the most exciting professors I have ever had and is genuinely passionate about the success of his students. I took this class as an elective but quickly found that I was spending more time on readings other than what was assigned, simply because it was just such an interesting topic. I cannot recommend this class highly enough.","This course thinks through some really interesting ideas. It is exceptionally well taught, and is super interactive and engaging. The assignments are unorthodox and really make you think, and the way course material is presented reconfigures how you'll think about historical scholarship.","This course is wonderful and the content is quite interesting. It is a fun way to engage with the medieval world in a discussion\/seminary course versus a traditional survey course. For that reason it is helpful if you have some background knowledge. Be aware that despite the non-traditional\/ fun assignments their expectations are quite high. You will benefit well from starting each essay early and asking plenty of questions in office hours along the way to make sure you are doing what the professor and TF are each looking for.","I took this class to fulfill my History pre-modern requirement, and ended up liking it a lot more than I expected to like any pre-modern course. Professor Smail is very enthusiastic, and it's contagious. Even though I had no experience with medieval history before this class, I found myself becoming interested in debt and Icelandic feud and saints in the Middle Ages. A lot of other students in the class had a specific interest in the time period, so be prepared for that, but don't let it discourage you from taking the class. The creative project was frustrating at first because it's so different from other assignments, but if you go see Dan and Eric in office hours, they'll help you through it. Professor Smail is becoming more and more interested in debt and the history of poverty, and I imagine his future classes will be focused more on that which is very cool.","The teaching staff for this course is great -- some of the most caring teachers that Harvard has to offer. Going into it though, don't expect to get a good grade. The grading for this course can be very confusing and it's hard to know how to do well\/","This is the best class I've ever taken at Harvard.  Even if you're not a history student you should take this class."]}},"mostRecentQ":{"overall":"4.50","workload":"4.90","difficulty":null,"recommendation":"4.70","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}