{"scores":{"Fall '14":{"course_score":{"overall":"4.80","workload":"3.30","difficulty":null,"recommendation":"4.80","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"HIST 1015","course_id":"12432","cat_num":"25449","1s":"0","2s":"0","3s":"0","4s":"2","5s":"10"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 1015","course_id":"12432","cat_num":"25449","1s":"2","2s":"10","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST 1015","cat_num":"25449","course_id":"12432","year":"2014","term":"1","id":"2645a5d58532af052b0acc5d74a2df24","first":" Steven Michael","last":"Press","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '14":{"comments":["This is a great survey class that covers some not so common periods of imperialism, e.g. the filibusters of the 19th century. Although focused on the 19th century, the last weeks look forward to the modern day, helping to contextualize the importance of studying that period. The response papers and mid-term are straight forward, and you have complete free reign to write about whatever you like. Professor Press is wonderful, deeply knowledgeable with a dry, sharp sense of humour that makes class really enjoyable, and very very supportive. If you have any interest in imperial history, take this class!","One of my favorite classes thus far! Steven is a great lecturer, really excited about the course material, accessible, and a nice guy. It was a terrific introduction to colonial and global history.","Excellent class! Great way to begin studying imperial history. Reading load was light and assignments were very manageable. Also Professor Press is a gem. He somehow manages to make classes on colonialism humorous in a way that is not offensive, so lectures are fun and engaging.","This class is a really interesting different look at imperialism from something like Ferguson's Western Ascendancy.  Press is a great lecturer, really open to questions and really cares about his students.  He is also really flexible and tries to be genuinely helpful and accessible. Also, this could easily be a first history course at Harvard.  The readings were a little weird and the lack of a geographic focus made things kind of disjointed.","This is one of the best courses at Harvard. If you are interested in imperial history, I highly recommend this course and the professor. Dr. Press is very bright, talented, and available and makes class always fun. The course covers a broad expanse of the globe in its examination of modes of nineteenth century imperialism.","This course will teach you what it originally meant to be an American. It also contextualizes current events in a way that reveals international conflict.","Press is a great teacher and this class is both interesting and not too hard. There aren't a lot of classes like that. The subject is pretty neat--Press knows his stuff and covers a wide variety. A must take.","He is an unbelievable professor.  Absolutely brilliant and interesting to listen to and talk to after class.","This course was pretty interesting, but maybe not my favorite course ever. It was helpful in my framing of imperial history as a series of major themes, situated in moments of time. Professor Press is very smart, and also has a ridiculously weird but fun sense of humor that made the class enjoyable for me. His lectures were mostly interesting I thought, especially those that pertained to my area of interest (I took this course for a Social Studies focus field requirement). The class is also small, too, so section discussion is great. Don't take it if you don't have a background\/interest in world\/imperial history."]}},"mostRecentQ":{"overall":"4.80","workload":"3.30","difficulty":null,"recommendation":"4.80","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"HIST 1015","course_id":"12432","cat_num":"25449","1s":"0","2s":"0","3s":"0","4s":"2","5s":"10"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 1015","course_id":"12432","cat_num":"25449","1s":"2","2s":"10","3s":"0","4s":"0","5s":"0"}},"success":true}