{"scores":{"Fall '10":{"course_score":{"overall":"4.54","workload":"1.84","difficulty":"2.96","recommendation":"4.68","enrollment":"29","response rate":"89.66","QCourseOverall":{"number":"HIST 1012","course_id":"2390","cat_num":"69822","1s":"0","2s":"0","3s":"1","4s":"10","5s":"15"},"QDifficulty":{"number":"HIST 1012","course_id":"2390","cat_num":"69822","1s":"0","2s":"8","3s":"11","4s":"5","5s":"1"},"QWorkload":{"number":"HIST 1012","course_id":"2390","cat_num":"69822","1s":"8","2s":"14","3s":"2","4s":"1","5s":"0"}},"instructor_scores":[{"number":"HIST 1012","cat_num":"69822","course_id":"2390","year":"2010","term":"1","id":"3267c80c65c067539f9206835d376078","first":"Emma","last":"Dench","InstructorOverall":"4.92","EffectiveLecturesorPresentations":"4.84","AccessibleOutsideClass":"4.83","GeneratesEnthusiasm":"4.96","FacilitatesDiscussionEncouragesParticipation":"4.74","GivesUsefulFeedback":"4.75","ReturnsAssignmentsinTimelyFashion":"4.92"}]}},"comments":{"Fall '10":{"comments":["I would HIGHLY recommend this class, especially if you have an interest in history and have never taken a history class before. The professor is exciting and welcoming, a great combination.","This is a wonderful class for anyone interested in learning more about Greek and Roman identity!  I had never taken an identity class before, and it was a fascinating way to look at history.","Great course, great overview of ancient history with a really interesting thematic approach.  Not too much work at all.","She is an amazing teacher and this is a great class. You will be interested, even if your not very into history like I was.","This course is super interesting and teaches you a lot not only on identity in classical antiquity but also on your own identity. However, you must be willing to do the homework on your own and participate in class.","An interesting class, but one that was difficult to figure out exactly what the TF wanted on the essays.  I felt like I learned more than I was able to express, and that probably hurt my grade.","This class is great. Professor Dench is a fabulous teacher. It's not easy so it's important to keep up with your reading, especially if you don't have prior knowledge of the subject.","This class is a great introduction to classical history from a distinct framework. Workload is challenging but manageable, and Prof. Dench is AMAZING! Talk to her and get to know her - she is fab.","This is the best class I have ever taken at Harvard.","This is a very interesting course (for concentrators and non-concentrators), and Prof. Dench is very animated during lectures (which helps in the morning when most off us are still waiting for the caffeine to kick in).","do the reading, especially those of the section :)","This class is great, and the workload is modest."]}},"mostRecentQ":{"overall":"4.54","workload":"1.84","difficulty":"2.96","recommendation":"4.68","enrollment":"29","response rate":"89.66","QCourseOverall":{"number":"HIST 1012","course_id":"2390","cat_num":"69822","1s":"0","2s":"0","3s":"1","4s":"10","5s":"15"},"QDifficulty":{"number":"HIST 1012","course_id":"2390","cat_num":"69822","1s":"0","2s":"8","3s":"11","4s":"5","5s":"1"},"QWorkload":{"number":"HIST 1012","course_id":"2390","cat_num":"69822","1s":"8","2s":"14","3s":"2","4s":"1","5s":"0"}},"success":true}