{"scores":{"Spring '15":{"course_score":{"overall":"4.80","workload":"3.50","difficulty":null,"recommendation":"5.00","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"HISTSCI 186V","course_id":"12480","cat_num":"156324","1s":"0","2s":"1","3s":"5","4s":"8","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HISTSCI 186V","course_id":"12480","cat_num":"156324","1s":"1","2s":"2","3s":"11","4s":"4","5s":"2"}},"instructor_scores":[{"number":"HISTSCI 186V","cat_num":"156324","course_id":"12480","year":"2014","term":"2","id":"37157e18d4cb574ec21234e0deaca5b1","first":" Jeremy Todd","last":"Blatter","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '15":{"comments":["Jeremy is awesome! He's so brilliant and enthusiastic about the material, he makes it fun!","The class set up is very open. You can choose from almost any topic for assignments and it's largely all based on discussion and the readings provided. You have to do all the readings, but they're very interesting and the lectures are as well.","this class was amazing. it was so interesting, and Jeremy is a great teacher. the small class facilitated lots of discussion about really interesting topics. the assignments were not very hard, but were actually very rewarding and fun to do, and there is a lot of wiggle room in terms of what you can write about. i really enjoyed this class and recommend it to everyone--i'm not a hist of sci concentrator, but now i want to take more of these classes","This class was really interesting and enjoyable. Jeremy was incredibly helpful and thoughtful throughout the course and I really learned a lot.","This is the best course I've taken at Harvard in my three years here. Jeremy is a fine instructor and his enthusiasm for the topics is truly infectious. This course has a very manageable workload and the assignments are genuinely enjoyable. Jeremy is also very approachable and a great resource for learning how to do research projects and improving your writing. The course covers a wide range of topic, but they have been seamlessly integrated. You'll walk away with a new perspective on history and current events.","It's a great class with laid back discussions about technologies that we have grown to take for granted. Also, Jeremy is awesome!","This course is one of those rare Harvard classes that is simultaneously incredibly interesting and easy. Jeremy is an amazing teacher and so passionate about everything discussed in the course.","This is a great class for those wanting to impress someone at a dinner party. The information we learned was widespread, but tied into a central theme. We looked at different perspectives of what technology is. Discussion-based class, and professor is very engaging."]}},"mostRecentQ":{"overall":"4.80","workload":"3.50","difficulty":null,"recommendation":"5.00","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"HISTSCI 186V","course_id":"12480","cat_num":"156324","1s":"0","2s":"1","3s":"5","4s":"8","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HISTSCI 186V","course_id":"12480","cat_num":"156324","1s":"1","2s":"2","3s":"11","4s":"4","5s":"2"}},"success":true}