{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"6.90","difficulty":null,"recommendation":"4.70","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"HIST 1512","course_id":"2435","cat_num":"88893","1s":"0","2s":"2","3s":"2","4s":"2","5s":"9"},"QDifficulty":{"number":"HIST 1512","course_id":"2435","cat_num":"88893","1s":"0","2s":"1","3s":"6","4s":"8","5s":"0"},"QWorkload":{"number":"HIST 1512","course_id":"2435","cat_num":"88893","1s":"1","2s":"4","3s":"9","4s":"1","5s":"0"}},"instructor_scores":[{"number":"HIST 1913","cat_num":"108531","course_id":"2435","year":"2016","term":"2","id":"e1cc39070028da9249d669ac64eca7f0","first":" Kirsten A.","last":"Weld","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Spring '13":{"course_score":{"overall":"4.20","workload":"2.67","difficulty":"3.47","recommendation":"3.93","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"HIST 1512","course_id":"2435","cat_num":"88893","1s":"0","2s":"2","3s":"2","4s":"2","5s":"9"},"QDifficulty":{"number":"HIST 1512","course_id":"2435","cat_num":"88893","1s":"0","2s":"1","3s":"6","4s":"8","5s":"0"},"QWorkload":{"number":"HIST 1512","course_id":"2435","cat_num":"88893","1s":"1","2s":"4","3s":"9","4s":"1","5s":"0"}},"instructor_scores":[{"number":"HIST 1512","cat_num":"88893","course_id":"2435","year":"2012","term":"2","id":"e1cc39070028da9249d669ac64eca7f0","first":" Kirsten A.","last":"Weld","InstructorOverall":"4.13","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.53","GeneratesEnthusiasm":"4.27","FacilitatesDiscussionEncouragesParticipation":"4.36","GivesUsefulFeedback":"4.21","ReturnsAssignmentsinTimelyFashion":"4.79"}]}},"comments":{"Spring '13":{"comments":["Professor Weld is amazing, so anyone who's even mildly interested in Latin America should take one of her classes. This course isn't easy, and you'll be challenged constantly and read a lot of difficult material. However, you'll learn so much and come to realize how relevant these Dirty Wars still are today.","A great history class - you learn more about these particular conflicts and examine how historical knowledge is produced more generally.","Great course! Provides a great survey of dirty wars in Latin America and great perspectives on their history and legacy.","This course certainly gets you to rethink history by focusing on a severely neglected region in typical American high school history classes. However, the readings are tedious and the instructor is biased, heavy-handed, and unsupportive. Take it if you are genuinely interested in the material and can handle the workload but if you are looking to be swept away by stellar teaching in a small environment this is not the course for you.","This course made me think deeply about the importance of history, a question I have never encountered so upfront before. What is incredible to me is what we all managed to take away - and our takeaways are so vastly different, even from a specific focused course. It was one of those few courses where you LEARN something you can imagine reflecting on and which will shed light on unexpected interests and parts of your life.","This is a great class for anyone looking to expand their knowledge of Latin American history. The professor is always there to help, so take advantage of it!","Great class about an interesting topic in modern latin american history","Any class taught by Kirsten Weld is worth taking I think, but this one is unique in that it offers close and sustained interaction on an important topic.","For anyone interested in the complex and recent histories of the countries studied, or, more broadly, the themes of the course (reconciliation, justice, and moving past difficult histories), this course is a must.  Prof. Weld is a stellar instructor and facilitator, and having her perspective guide you through this is instrumental.  This course, a seminar, isn't easy, but it's also completely fair.","The subject matter is riveting and so are the readings, although she assigns an almost unreasonable amount. I learned a lot and always looked forward to going to class because discussion was interesting and the topic was so REAL. However, Weld has a tendency to take over discussion and make it into a bit of a lecture, which can be annoying, since the readings are provocative enough that everyone has something to say."]}},"mostRecentQ":{"overall":"4.80","workload":"6.90","difficulty":null,"recommendation":"4.70","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"HIST 1512","course_id":"2435","cat_num":"88893","1s":"0","2s":"2","3s":"2","4s":"2","5s":"9"},"QDifficulty":{"number":"HIST 1512","course_id":"2435","cat_num":"88893","1s":"0","2s":"1","3s":"6","4s":"8","5s":"0"},"QWorkload":{"number":"HIST 1512","course_id":"2435","cat_num":"88893","1s":"1","2s":"4","3s":"9","4s":"1","5s":"0"}},"success":true}