{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"6.60","difficulty":null,"recommendation":"4.60","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"HIST 1909","cat_num":"203036","course_id":"14502","year":"2016","term":"2","id":"6b7356399a9eab69b4609e1ca8b3f79c","first":" Serhii","last":"Plokhii","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '17":{"comments":["If you are interested in the ongoing political situation in Ukraine, or in Eastern Slavic history more generally, Professor Plokhii is as knowledgeable a scholar as anyone in the world. More importantly, despite his busy schedule, he always makes himself available to his students to discuss papers, readings, and the course, and was an excellent facilitator of very interesting (and often heated) discussions. I would recommend this course without to anyone interested in the topic and willing to put in the effort necessary to learn about the complex historical relationships that have led to one of the modern world's most explosive political situations.","This is a very intensive course with a lot of reading material, but all of it is worth doing, and Professor Plokhii is very accessible beyond his office hours to discuss the material if something is unclear. He is also very helpful in discussing the final project and planning out the structure of the essay. There is not that much work that needs to be done outside of the readings, so I really recommend that you read them carefully because in a small class it becomes very evident who only gained a superficial understanding of the material.","I enjoyed this class. Serhii Plokhii is a great professor and the mix of people taking the class made for really interesting discussions. My one reservation is that I think it is a difficult class to teach in English. Because there are very few translated primary sources, most of the class readings were secondary sources, which I can be limiting, and I felt quite dissatisfied with the final paper I ended up writing, as I was so limited by the absence of sources. At the same time, if you speak Russian or Ukrainian or are really interested in this topic I would definitely recommend this class."]}},"mostRecentQ":{"overall":"4.80","workload":"6.60","difficulty":null,"recommendation":"4.60","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}