{"scores":{"Fall '14":{"course_score":{"overall":"4.70","workload":"3.80","difficulty":null,"recommendation":"4.30","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"HIST-LIT 90bh","course_id":"12767","cat_num":"16626","1s":"0","2s":"0","3s":"0","4s":"2","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST-LIT 90bh","course_id":"12767","cat_num":"16626","1s":"0","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST-LIT 90bh","cat_num":"16626","course_id":"12767","year":"2014","term":"1","id":"5c22bea8198e100f5056d90e59016753","first":" Mo","last":"Moulton","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '14":{"comments":["I know the topic of post-colonial Ireland might not seem very interesting at first. But it's actually an academic and historical wonder: a British colony, or just part of Greater Britain? Is Ireland really post-colonial? The class certainly addresses some very core questions for those with an interest in both Irish history and postcolonial theory in general. Not to miss. \n\nOtherwise, Mo is an amazing, passionate and engaging teacher. The class is not too much work, but there are number of assignments along the way that make for some busy weeks. Plus you get to read some cool\/weird Irish novels and plays that you might never get another chance to explore, beyond Joyce and Wilde.","This was a really great course that gave us a chance to read some fascinating literature and engage with history. As a non hist&lit concentrator, I found it gave me a lot of useful skills in historical and literary analysis that I might use elsewhere. Professor Moulton is incredible: accessible, understanding, knowledgeable, and very skilled at guiding discussions: not too heavy-handed, but knows when to step in with useful questions or insights. The small class size was also fantastic. This was one of those rare classes where everyone clearly did the readings every week. I learnt a lot about Ireland, and through it, about the many themes that relate to its remarkable rise over the last century.","For a hist and lit class, this class was awesome, and if you're interested in Irish history, it was also awesome.  Because it's an intense, small seminar, I wouldn't recommend it as just a casual class.  But Mo is fantastic, so I would definitely recommend any class with her.","This is a great class, and provides an interesting approach to post-colonial theories as well as gives a broad sense of Irish 19th-20th century history.","You read so many cool books that comprehensively explore the intersection of both Irish history + culture and postcolonial experiences! It's a very cool class in that its existence itself is sort of what you're trying to explore. There's a lot of writing and reading, though, but it's a sophomore tutorial, so you knew that already. Half of the class weren't sophomores and an even larger percentage weren't hist&lit concentrators, so don't hesitate to take this course for some kickass history and literature fun if you don't officially belong to that group."]}},"mostRecentQ":{"overall":"4.70","workload":"3.80","difficulty":null,"recommendation":"4.30","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"HIST-LIT 90bh","course_id":"12767","cat_num":"16626","1s":"0","2s":"0","3s":"0","4s":"2","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST-LIT 90bh","course_id":"12767","cat_num":"16626","1s":"0","2s":"6","3s":"0","4s":"0","5s":"0"}},"success":true}