{"scores":{"Spring '16":{"course_score":{"overall":"4.40","workload":"4.50","difficulty":null,"recommendation":"4.40","enrollment":"25","response rate":"80.00","QCourseOverall":{"number":"HISTSCI 148V","course_id":"13776","cat_num":"160370","1s":"0","2s":"2","3s":"0","4s":"6","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HISTSCI 148V","course_id":"13776","cat_num":"160370","1s":"4","2s":"13","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HISTSCI 148V","cat_num":"160370","course_id":"13776","year":"2015","term":"2","id":"5dba347b61206d36fe907fc239ef8180","first":" Alexander","last":"More","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Spring '16":{"comments":["This is a great class for the history or history and science concentrator, as well as a great addition to a premed track. If you're neither of those things, then while it's an interesting topic and important knowledge for anyone to have, it's not an altogether useful course. You should do the readings, but you don't have to. Just focus on the important ones mentioned in lecture.","I was very much surprised in learning some of the material in the class. It has definitely impacted my view of healthcare\/biomedical research in America.","This class offers a new way to approach the topic of health and disease in America. Do the readings--you learn a lot from them.","This class provides a comprehensive and interesting assessment of the history of medicine.  I would recommend it to anyone interested in public health or medicine","Definitely take this class!! The material is great, the professor is great, and you'll walk away learning a lot!","Get to know Prof. More! He is extremely dedicated and knowledgable.","It's a really well-crafted course with a dedicated and passionate lecturer in Alex More. Dr. More really cares about his students, and is a wonderful person to get to know. He has extensive knowledge of the history of medicine, while being incredible approachable and invested in teaching. He may not be around Harvard much longer, so take his courses while you can. The course is a great survey of the history of medicine, with a nice selection of relevant readings on the syllabus. In addition to classic issues in the field (smallpox\/cholera epidemics in the colonies and early United States, AIDS, medical professionalization), the class tackles contemporary issues of climate change, water security and industrial agriculture. The semester thus unfolds beautifully-- highly recommend!","The material is really fascinating and Dr. More really knows what he's talking about. It can get a bit dry however, and the reading are a bit tedious as well","This is a fantastic course!! You will learn a lot and also truly enjoy each lecture. The assignments are very interesting too!","Good course overall, although there is a lot of reading, but class time is minimal","Professor More is hands-down the best lecturer at Harvard. I can only hope I will be able to take more classes with him.","This is class was great! The material was highly interesting and taught in a very thorough manner."]}},"mostRecentQ":{"overall":"4.40","workload":"4.50","difficulty":null,"recommendation":"4.40","enrollment":"25","response rate":"80.00","QCourseOverall":{"number":"HISTSCI 148V","course_id":"13776","cat_num":"160370","1s":"0","2s":"2","3s":"0","4s":"6","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HISTSCI 148V","course_id":"13776","cat_num":"160370","1s":"4","2s":"13","3s":"3","4s":"0","5s":"0"}},"success":true}