{"scores":{"Fall '14":{"course_score":{"overall":"4.20","workload":"4.00","difficulty":null,"recommendation":"4.20","enrollment":"8","response rate":"62.50","QCourseOverall":{"number":"HISTSCI 167v","course_id":"12478","cat_num":"88209","1s":"0","2s":"0","3s":"0","4s":"4","5s":"1"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HISTSCI 167v","course_id":"12478","cat_num":"88209","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HISTSCI 167v","cat_num":"88209","course_id":"12478","year":"2014","term":"1","id":"0fd85bf7487764f4ccbe235a86c6a59f","first":" Matthew Benjamin","last":"Shindell","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Fall '14":{"comments":["This class was a very enjoyable seminar.  Reading is interesting, and the course work wasn't too demanding.","Matt was a really excellent discussion leader, and I enjoyed the reading material for the class. Exploration isn't something that many of us think about too much, but it was really interesting to be able to examine exploration from Columbus to astronauts. Overall, great and fun class!","I would say staying on top of the readings is important to be able to adequately discuss the material, but this course is really a fun introduction into talking about exploration over time and offers some really interesting trends to study over time. Dr. Shindell is awesome, and he really makes you think about the material in different contexts than you might be used to.","This class allows you to look in depth at topics that interest you within the broader topic of exploration. There is quite a bit of reading to prepare for each week, but the only assignments (a book review, a movie review, and a final paper) are pretty open ended when it comes to what you choose to write about. Overall this is a pretty relaxed course, but you get to read and discuss a variety of topics, some of which will probably be more interesting to you than others.","I would recommend this seminar to students both inside and outside the History and Science concentration as an elective.  The course material is clever and thought-provoking without being esoteric, and the papers allow students to combine discussion themes with students' personal book and movie interests in a fun way."]}},"mostRecentQ":{"overall":"4.20","workload":"4.00","difficulty":null,"recommendation":"4.20","enrollment":"8","response rate":"62.50","QCourseOverall":{"number":"HISTSCI 167v","course_id":"12478","cat_num":"88209","1s":"0","2s":"0","3s":"0","4s":"4","5s":"1"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HISTSCI 167v","course_id":"12478","cat_num":"88209","1s":"0","2s":"4","3s":"0","4s":"0","5s":"0"}},"success":true}