{"scores":{"Spring '16":{"course_score":{"overall":"4.70","workload":"9.20","difficulty":null,"recommendation":"5.00","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":"HIST 97H","course_id":"12428","cat_num":"110445","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 97H","course_id":"12428","cat_num":"110445","1s":"0","2s":"1","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST 97H","cat_num":"110445","course_id":"12428","year":"2015","term":"2","id":"f47371f1a7c6cdb4a0170e97c80b67de","first":" Elizabeth Kai","last":"Hinton","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '15":{"course_score":{"overall":"4.70","workload":"8.80","difficulty":null,"recommendation":"4.80","enrollment":"9","response rate":"66.67","QCourseOverall":{"number":"HIST 97H","course_id":"12428","cat_num":"110445","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 97H","course_id":"12428","cat_num":"110445","1s":"0","2s":"1","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST 97H","cat_num":"110445","course_id":"12428","year":"2014","term":"2","id":"f47371f1a7c6cdb4a0170e97c80b67de","first":" Elizabeth Kai","last":"Hinton","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Spring '15":{"comments":["Take this course! You will advance as a historical writer like you could never imagine. It will spark an interest that will develop into a passion.","Take this! It's an amazing History 97 and a window into an incredibly rich and multifaceted subfield of history. Being able to walk the streets of Boston and know exactly how and why they ended up as they are is worth the entire course on its own, honestly, but Professor Hinton is really engaging and some of the readings are truly great as well.","I would recommend this tutorial to anyone in the History concentration!","This is a very good history tutorial on a fascinating and relevant subfield. Like all History 97s, it's a lot of work, but no avoiding that if you want to concentrate in History."]},"Spring '16":{"comments":["If Urban history (97h) is offered at some point in the future (I know professor Hinton is taking next year off) DEFINITELY take it. I took my expos on urban history and I absolutely hated it, but this was the complete opposite. The readings are super interesting (if you are interested in urban history of course) and Professor Hinton knows so much\/leads discussions really well.","Professor Hinton is a fantastic teacher and by far the best of the 97 professors. She is attentive, cool, and compelling. The work is hard. They will claim you'll 'learn a lot about writing' from the class--I found this not to be the case (if you've taken other seminars at Harvard, they're quite similar). That being said, as department requirements go, this is definitely your best bet.","Definitely the best of all the history tutorials","Professor Hinton is an amazing professor. She really cares about her students and the subject matter of the course, and she brought passion to every class meeting. The History 97 courses all require history concentrators to do a lot of writing, but of all the options I think 97H had the best overall reviews from students.","This is a difficult class that feels infinitely rewarding when you can finally look back and see how much you have grown as a writer.","What is Urban History is definitely the best choice of all the history tutorials. Professor Hinton is amazing, and clearly cares about your progress. The 97 Tutorial is mandatory for history concentrators, and my only criticisms of it come from the structure of the deadlines. The structure of the seminar assumed that it was the only class I was taking this semester and I had no other responsibilities. If I gave more to this class I would have had to give my bone marrow.","History 97 is one of the most difficult classes you will have to take as a concentrator. However, \"What is Urban History?\" is the best option for this difficult requirement. Professor Hinton is amazing and generates a great class culture and environment. Sonia gave very helpful feedback and conducted very helpful essay tutorials. Over the course of the semester, I have vastly improved in my ability to write for history classes, which is the ultimate goal of the course. I would highly recommend this class to history concentrators."]}},"mostRecentQ":{"overall":"4.70","workload":"9.20","difficulty":null,"recommendation":"5.00","enrollment":"10","response rate":"70.00","QCourseOverall":{"number":"HIST 97H","course_id":"12428","cat_num":"110445","1s":"0","2s":"0","3s":"0","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST 97H","course_id":"12428","cat_num":"110445","1s":"0","2s":"1","3s":"5","4s":"0","5s":"0"}},"success":true}