{"scores":{"Fall '15":{"course_score":{"overall":"4.20","workload":"5.30","difficulty":null,"recommendation":"3.80","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"HIST-LIT 90BQ","course_id":"13120","cat_num":"159792","1s":"0","2s":"0","3s":"2","4s":"1","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST-LIT 90BQ","course_id":"13120","cat_num":"159792","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST-LIT 90BQ","cat_num":"159792","course_id":"13120","year":"2015","term":"1","id":"d1df8edce4299b9bef20fb425bf890f3","first":" Michael","last":"Tworek","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Fall '15":{"comments":["A very fun and unique course in its vast and wide-ranging material that will challenge your perceptions of histories and cultures across space and time. Great for inspiring interest in any number of fields within historical inquiry, but be prepared to engage in some fast-moving discussion!","I learned a lot from this course and actually had a surprising amount of fun!  I didn't really know much about global history before taking the course, and probably thought it was just a trendy name, but the class was actually an amazing introduction to a really useful and fascinating set of methods that can be applied to enhance any other work you do in hist and lit.  The readings balanced methods and secondary sources (which were all fairly recent and so helped us engage with very up-to-date debates) with primary sources perfectly.  Seminar discussions were the highlight of the class: they were facilitated really well, so we engaged with interesting ideas and had productive conversations that enhanced all of our understandings, but there was also time for us to share interesting or humorous asides and bond as a class.","Take this if you are really, really interested in the subject material. There is too much enthusiasm expected of the students for it to be passive.","This is a wonderful introduction to History & Literature as well as the Early Modern Field. Michael is a very kind and engaging instructor who leads lively seminar discussions and offers very helpful feedback on written assignments. Even if you do not end up concentrating in Hist & Lit (I am not), it is still a worthwhile course that will expose you to a bunch of fascinating topics as well as the methods of historical analysis.","Michael is awesome and a great professor who really cares about his students, and he gives the essay assignment out far in advance with lots of in-class exercises that can help with coming up with a topic\/argument. That said, there's a lot of weekly reading in addition to essay work, and I didn't feel like I learned a ton of stuff about the early modern period, because we never really tied anything together. The essay assignment was really cool though and I felt like I got to delve into my personal topic really thoroughly -- was glad I had the chance to write that (he was also really helpful with the essay).","This course is more history-focused than literature-focused. Nevertheless, there is quite a bit of reading. If you're considering hist and lit, but you're not sure if it's for you, this course will probably give you a good sense of whether or not it's for you. It's a really low-risk environment to test out your interests."]}},"mostRecentQ":{"overall":"4.20","workload":"5.30","difficulty":null,"recommendation":"3.80","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"HIST-LIT 90BQ","course_id":"13120","cat_num":"159792","1s":"0","2s":"0","3s":"2","4s":"1","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"HIST-LIT 90BQ","course_id":"13120","cat_num":"159792","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"}},"success":true}