{"scores":{"Fall '11":{"course_score":{"overall":"4.67","workload":"2.67","difficulty":"3.17","recommendation":"4.67","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"HIST 81j","course_id":"2357","cat_num":"75134","1s":"0","2s":"0","3s":"0","4s":"2","5s":"4"},"QDifficulty":{"number":"HIST 81j","course_id":"2357","cat_num":"75134","1s":"0","2s":"0","3s":"5","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 81j","course_id":"2357","cat_num":"75134","1s":"0","2s":"2","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HIST 81j","cat_num":"75134","course_id":"2357","year":"2011","term":"1","id":"81497fd91cf61783821fcf727ecd7ab6","first":"Ann M.","last":"Blair","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Fall '11":{"comments":["This is an exemplary theoretical survey of issues of authorship and the creation of texts in the Early Modern Europe and Colonial America. While it's particularly valuable to students of Early Modern history, culture, and literature, the theoretical toolbox that the course provides could easily lend itself across contexts in which authorship needs to be historicized.","Take this class! It can radically change or complicate many of our entrenched and seemingly natural ideas about authorship, literature, intellectual genius and individual agency. Some of the topics and approaches covered, especially book history, are those you may not encounter in any other coursework. The final project is especially good for developing your research skills.","I took this course on a bit of a whim, and it turned out to be absolutely wonderful. I'm not sure, though, that it's the course for everyone -- since it caters to a relatively small coterie of undergraduate history concentrators who are interested in the theoretical and methodological questions that surround authorship. Not to say that this isn't important stuff -- to the contrary, my sense is that questions of authorship are pretty hot right now in the academy, and with good reason -- but rather just to acknowledge the reality that most undergrads might not want to base their junior research papers around authorship at this point in their careers.   That said, I cannot imagine a better team of instructors that Prof. Blair and Meredith to guide you through a junior research seminar, and students are given almost complete freedom in identifying a topic that interests them."]}},"mostRecentQ":{"overall":"4.67","workload":"2.67","difficulty":"3.17","recommendation":"4.67","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"HIST 81j","course_id":"2357","cat_num":"75134","1s":"0","2s":"0","3s":"0","4s":"2","5s":"4"},"QDifficulty":{"number":"HIST 81j","course_id":"2357","cat_num":"75134","1s":"0","2s":"0","3s":"5","4s":"1","5s":"0"},"QWorkload":{"number":"HIST 81j","course_id":"2357","cat_num":"75134","1s":"0","2s":"2","3s":"4","4s":"0","5s":"0"}},"success":true}