{"scores":{"Fall '11":{"course_score":{"overall":"4.67","workload":"3.11","difficulty":"3.56","recommendation":"4.67","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"ISLAMCIV 103","course_id":"3805","cat_num":"13124","1s":"0","2s":"0","3s":"1","4s":"1","5s":"7"},"QDifficulty":{"number":"ISLAMCIV 103","course_id":"3805","cat_num":"13124","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ISLAMCIV 103","course_id":"3805","cat_num":"13124","1s":"0","2s":"1","3s":"6","4s":"2","5s":"0"}},"instructor_scores":[{"number":"ISLAMCIV 103","cat_num":"13124","course_id":"3805","year":"2011","term":"1","id":"e6948c0967ee2cd544963b4bed2aad8d","first":"Malika","last":"Zeghal","InstructorOverall":"4.89","EffectiveLecturesorPresentations":"4.89","AccessibleOutsideClass":"4.11","GeneratesEnthusiasm":"4.44","FacilitatesDiscussionEncouragesParticipation":"4.56","GivesUsefulFeedback":"4.56","ReturnsAssignmentsinTimelyFashion":"4.56"}]}},"comments":{"Fall '11":{"comments":["The professor is fantastic, although the weekly response papers are quite draining and the material can often be somewhat dense and obscure. It's still highly worth taking if you plan on doing any form of Middle East Studies, since Said's book has become so central to it","Not only is a great course in itself, but Professor Zeghal truly has perfected it. It's a great exercise in the entire activity of scholarship, too; truly helpful for any aspiring scholar \/ academic","It's a great class to learn about the concept of Orientalism, but also to get a wide variety of readings and authors under your belt. There are some great discussions and you can really get your own ideas out there if that's the sort of thing you like to do. Be prepared to put a lot of effort into the reading though, it's quite a bit and not the easiest stuff. Definitely worth it though!","This is an incredible course. Readings from Edward Said, Frantz Fanon, Dipesh Chabrakarty, Michel Foucault, and Bernard Lewis (to name a few) are intense, complex, and completely fascinating. You will think differently about literature and history - and the writing of literature and history - after taking this course. The written assignments (weekly summaries, a 5-page midterm paper, and a 15-page final paper) were well structured so that we could come to class every week and spend two hours in (often) heated discussion about the given texts without having to recall every point made for a written exam. So this course really combines rigorous reading and writing with a pressure-free seminar environment - that's a hard balance to achieve. You want to take this course. Your friends won't understand what it means when you tell them that you're going to \"Orientalism,\" but you will be much better off for it.","This is a must-take class for students of Middle Eastern Studies."]}},"mostRecentQ":{"overall":"4.67","workload":"3.11","difficulty":"3.56","recommendation":"4.67","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"ISLAMCIV 103","course_id":"3805","cat_num":"13124","1s":"0","2s":"0","3s":"1","4s":"1","5s":"7"},"QDifficulty":{"number":"ISLAMCIV 103","course_id":"3805","cat_num":"13124","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ISLAMCIV 103","course_id":"3805","cat_num":"13124","1s":"0","2s":"1","3s":"6","4s":"2","5s":"0"}},"success":true}