{"scores":{"Spring '13":{"course_score":{"overall":"4.70","workload":"2.70","difficulty":"3.00","recommendation":"4.70","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"KORHIST 113","course_id":"888","cat_num":"78737","1s":"0","2s":"0","3s":"0","4s":"3","5s":"7"},"QDifficulty":{"number":"KORHIST 113","course_id":"888","cat_num":"78737","1s":"0","2s":"1","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"KORHIST 113","course_id":"888","cat_num":"78737","1s":"0","2s":"4","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"KORHIST 113","cat_num":"78737","course_id":"888","year":"2012","term":"2","id":"a391da453d8cc83c4b5bdda2e0f3d6eb","first":" Avram Asenov","last":"Agov","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.89","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '13":{"comments":["To better understand the current situation in North Korea, we need to understand its history. This class dives deeply into the \"why?\" of North Korea, giving historical and political background.","Take it!!! Professor Agov is one of the most caring professors you will ever have - he not only makes himself available outside the classroom, but is also someone who is more than happy to go through the trouble of staying in the classroom, long after the class has officially ended long, just so that a meaningful discussion amongst students can organically continue to a natural end. He did this several times! This class may seem \"easy\" - but please respect both Professor Agov and your own time in the classroom and do the readings and do the work, even if there is an apparent lack of exams of written exams (with the exception of a large research paper and book presentation towards the end). I promise you that it is worth it and that if you do all the readings, this class will be a much more rewarding experience than if you simply trudge through daily attendance and the minimum requirements for passing (as some of my peers sadly did). While Professor Agov's lecutres may be interesting and easy to follow (even if you didn't do the readings), this class is a thousand times better when you are prepared to participate with your own thoughts and questions. if your schedule does not allow you to enroll in the course, for whatever reason, I do want to say that this one is worth auditing, but if you sign up for it, I assure you that you will not regret it!","I would certainly recommend this course for anyone with a genuine interest in either North Korea or political history in general. Professor Agov's ultimate goal is to provide historical insight to these interests while giving his students valuable exposure to renowned scholars who specialize in different facets of Korean history and politics."]}},"mostRecentQ":{"overall":"4.70","workload":"2.70","difficulty":"3.00","recommendation":"4.70","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"KORHIST 113","course_id":"888","cat_num":"78737","1s":"0","2s":"0","3s":"0","4s":"3","5s":"7"},"QDifficulty":{"number":"KORHIST 113","course_id":"888","cat_num":"78737","1s":"0","2s":"1","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"KORHIST 113","course_id":"888","cat_num":"78737","1s":"0","2s":"4","3s":"5","4s":"1","5s":"0"}},"success":true}