{"scores":{"Fall '15":{"course_score":{"overall":"4.90","workload":"7.00","difficulty":null,"recommendation":"4.90","enrollment":"6","response rate":"116.67","QCourseOverall":{"number":"LATIN 106A","course_id":"12130","cat_num":"156306","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"LATIN 106A","course_id":"12130","cat_num":"156306","1s":"0","2s":"3","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"LATIN 106A","cat_num":"156306","course_id":"12130","year":"2015","term":"1","id":"8fc8c5c36b7feff59adb9a31b621d6ba","first":" Richard F.","last":"Thomas","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '15":{"comments":["If you like to read Latin poetry at all, this class is wonderful. The material is extremely interesting, and Professor Thomas's knowledge of and passion for it makes it a great class.","The texts are vitally important to an understanding of the overall arc of Vergil's work, even though they are far less widely read than the Aeneid. This might even give them the appeal of being fresher and less familiar. Prof. Thomas knows these poems inside and out, as well as the entire canon to which they are attached thematically and allusively; although you are by no means required to absorb all the knowledge he provides and discusses in class, you can learn so much more about classical literature in this course than just the Eclogues and Georgics. The work load doubles after the midterm, which makes sense just because of the volume and style of the Georgics. You should strongly consider the course if it rolls around again.","If you're at all interested in Virgil's works, take this course.","Latin 106a (Virgil: Eclogues and Georgics) with Professor Thomas was one of my favorite classes I have ever taken in my educational career. I studied the most brilliant Latin poet, Virgil, under one of the most brilliant scholars of Virgil, Professor Thomas. That is an opportunity that should not be passed up by any competent student of the Latin language. This course does in fact require a fair amount of work on the part of the student, but the rewards I reaped from that work were incredible. I developed an entirely new understanding of and appreciation for Latin poetry from this class. Professor Thomas taught everything from Vergil's many poetic tricks to his heart-wrenching passages to his famous acrostic poems. So if you have a few years of Latin experience and have a passion for studying Latin poetry, you should make every effort to take this class."]}},"mostRecentQ":{"overall":"4.90","workload":"7.00","difficulty":null,"recommendation":"4.90","enrollment":"6","response rate":"116.67","QCourseOverall":{"number":"LATIN 106A","course_id":"12130","cat_num":"156306","1s":"0","2s":"0","3s":"0","4s":"1","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"LATIN 106A","course_id":"12130","cat_num":"156306","1s":"0","2s":"3","3s":"3","4s":"1","5s":"0"}},"success":true}