{"scores":{"Spring '15":{"course_score":{"overall":"3.80","workload":"5.50","difficulty":null,"recommendation":"4.00","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"LING 174","cat_num":"123350","course_id":"2805","year":"2014","term":"2","id":"4dc76df908fbaf5657883c375107881b","first":" Wesley Mark","last":"Jacobsen","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '15":{"comments":["Professor Jacobsen is incredibly knowledgeable and Professors like him are very few and far between. If you've got any interest in Japanese and things like why æ›¸ã\u0081„ã\u0081¦ã\u0081„ã\u0081¾ã\u0081™ has two potential meanings, definitely take this class! You'll learn so much that you can't really learn in a Japanese class.","The strength LING 174 is in the interfaces that it explores. Take this course if you are interested in learning more about how tense and aspect are closely related in Japanese, as well as how tense and aspect interact with the transitivity, agentivity, and modality (reality status) of events in Japanese.","This class really gave me a lot of new tools to work with in terms of learning about tense and aspect, a topic that I felt I knew vaguely about but never had the chance to formally learn. So this definitely is a class that will cover material that otherwise is hard to learn about in undergrad linguistics courses. The pacing is relatively slow, because we started from the basics and slowly moved to some more interesting interactions between aspect and other linguistic phenomena. Definitely helpful for getting a good basic sense of how tense and aspect fit into the larger picture of linguistics.\r\n\r\nAlso for students who are just interested in Japanese, taking this class cleared up a few things that we learned (such as the different ways to combine two verbs, the interpretation of conditionals, how to use past tense and present tense within relative clauses, etc.), so it's definitely helpful for that too!","If you are learning Japanese and want to better understand some of the intricacies of the language, this class will surely help you. Even if this would be your first linguistics course, rest assured that the professor will prepare you well with the necessary knowledge before moving on to the next topic. However, if you are not one to ask questions in class (which is easy due to the small class size), you better be able to handle listening to a 2-hour lecture (w\/ a small break).","Will really help you gain an appreciation of the complexity of the TE-IRU structure in Japanese - it does not always mean \"-ing\"! However, this is linguistics, not your Japanese class, so do not expect it to be that interactive."]}},"mostRecentQ":{"overall":"3.80","workload":"5.50","difficulty":null,"recommendation":"4.00","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}