{"scores":{"Fall '15":{"course_score":{"overall":"4.50","workload":"7.40","difficulty":null,"recommendation":"4.50","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 213A","cat_num":"110880","course_id":"2878","year":"2015","term":"1","id":"aad0ec5cb56cf1893c61c0327c85fc79","first":" Wilfried","last":"Schmid","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '13":{"course_score":{"overall":"4.40","workload":"2.90","difficulty":"3.40","recommendation":"4.40","enrollment":"18","response rate":"83.33","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 213a","cat_num":"1621","course_id":"2878","year":"2013","term":"1","id":"aad0ec5cb56cf1893c61c0327c85fc79","first":" Wilfried","last":"Schmid","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"2.00","ReturnsAssignmentsinTimelyFashion":null}]},"Fall '12":{"course_score":{"overall":"4.67","workload":"3.00","difficulty":"3.67","recommendation":"4.67","enrollment":"8","response rate":"75.00","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 213a","cat_num":"1621","course_id":"2878","year":"2012","term":"1","id":"6f9611dd1819a76374143e4f64b797e9","first":"Sukhada","last":"Fadnavis","InstructorOverall":"4.83","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.83","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.33"}]},"Fall '11":{"course_score":{"overall":"4.70","workload":"3.25","difficulty":"3.50","recommendation":"4.45","enrollment":"28","response rate":"71.43","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 213a","cat_num":"1621","course_id":"2878","year":"2011","term":"1","id":"e6f18d4634271edac6e6dc1f6d6cffed","first":"Joseph D.","last":"Harris","InstructorOverall":"4.74","EffectiveLecturesorPresentations":"4.63","AccessibleOutsideClass":"4.61","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.56","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '10":{"course_score":{"overall":"5.00","workload":"3.50","difficulty":"3.93","recommendation":"4.93","enrollment":"18","response rate":"77.78","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 213a","cat_num":"1621","course_id":"2878","year":"2010","term":"1","id":"16bc4f605a0f5ccc7546ddfbf7d36c88","first":"Curtis T.","last":"McMullen","InstructorOverall":"4.93","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.85","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.29","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '09":{"course_score":{"overall":"4.25","workload":"4.25","difficulty":"4.25","recommendation":"4.25","enrollment":"7","response rate":"57.14","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 213a","cat_num":"1621","course_id":"2878","year":"2009","term":"1","id":"80d12e5368e47ce0480832555eb3f7e0","first":"Yum-Tong","last":"Siu","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.75","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '08":{"course_score":{"overall":"4.45","workload":"2.82","difficulty":"3.36","recommendation":"4.45","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 213a","cat_num":"1621","course_id":"2878","year":"2008","term":"1","id":"aad0ec5cb56cf1893c61c0327c85fc79","first":"Wilfried","last":"Schmid","InstructorOverall":"4.55","EffectiveLecturesorPresentations":"4.55","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.55","FacilitatesDiscussionEncouragesParticipation":"3.33","GivesUsefulFeedback":"2.00","ReturnsAssignmentsinTimelyFashion":null}]},"Fall '07":{"course_score":{"overall":"4.89","workload":"2.78","difficulty":"3.33","recommendation":"4.67","enrollment":"14","response rate":"64.29","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 213a","cat_num":"1621","course_id":"2878","year":"2007","term":"1","id":"59904b659eb44512386bd81aab1c0178","first":"Andreea C.","last":"Nicoara","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.56","AccessibleOutsideClass":"4.62","GeneratesEnthusiasm":"4.56","FacilitatesDiscussionEncouragesParticipation":"4.67","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '06":{"course_score":{"overall":"4.87","workload":"3.20","difficulty":"3.60","recommendation":"4.87","enrollment":"23","response rate":"65.22","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 213a","cat_num":"1621","course_id":"2878","year":"2006","term":"1","id":"16bc4f605a0f5ccc7546ddfbf7d36c88","first":"Curtis T.","last":"McMullen","InstructorOverall":"4.93","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.29","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.12","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '07":{"comments":["I would strongly recommend the course to anyone I could find...however, Andreea is moving on after this semester, so a major component of that recommendation would have to be directed at students in another university.  The course itself, in the abstract, is still a wonderful piece of mathematics  for anyone who wants to know where the subject goes after you learn to compute weird integrals, or wants to see the proofs of some famous theorems, and some of the topics are basically essential as pieces of mathematical culture (the stuff on elliptic functions, for example).","Take it, even if you have absolutely no need for this course, this is mathematics at its best!!!\r\n\r\nOtherwise I would recommend looking out for Prof. Nicoara lectures, everything she does should be worth taking."]},"Fall '09":{"comments":["Find out what the instructor is planning on covering at the start of the semester, and ask yourself whether this is actually what you want to be learning.","If you ever get the chance to take a class with Professor Siu, you are in for a wild ride.","study hard with strong interest"]},"Fall '10":{"comments":["Professor McMullen is an excellent teacher, and he presents ideas in a very clear and motivated way.","McMullen is an excellent teacher whose course notes and problem sets are really helpful. I learned a lot from this course.","it's quite enlightening. There's some crazy stuff that goes down.","This was the best-taught math course I have ever attended.","It's challenging, but if it's taught by McMullen, it is definitely worth taking. He is a gifted, inspiring lecturer - probably one of the best teachers at Harvard.","Professor McMullen is an incredible math lecturer, and complex analysis is a truly beautiful topic.","This class was SO AWESOME. The material was interesting, especially (in my opinion) the elliptic curves and modular forms stuff. Wow... my mind is blown. A lot of what made the class awesome was Professor McMullen. Don't worry about dozing off or getting bored in lecture -- he will grab you and take you on a 90 minute tour of some really exciting mathematics. Honestly, I've taken three math classes here that I really enjoyed, and they were all taught by McMullen. What a great lecturer. The homework was pretty tough (for me), but stimulating and challenging and not messy to write up once you saw the trick. One thing though -- I'm writing up my problem set from over Thanksgiving vacation right now, and I'm also looking at a massive take-home final. This class has an intense workload!","One of the best courses I have taken at Harvard.","If you are interested in modern mathematics, you should absolutely take this course. The material is central to many diverse research areas, and the lecturer does a great job of highlighting these connections. Using an algebraic perspective and some basic geometric tools, Professor McMullen really simplifies the proofs of many of the classical theorems presented in the course, enabling him to cover more material than in most second courses in complex analysis. It was a joy to attend this course every day of the semester, because each lecture overflowed with clarity and insight."]},"Fall '11":{"comments":["Though numbered as a graduate course, it is attended exclusively by undergraduates.","Complex Analysis is beautiful. Harris was great (except for when he messed up, but he's still a chill professor).","The course covers material very quickly. Make sure to keep up with the course through the problem sets, office hours and sections. \r\nStein and Shakarchi is a good supplement for additional reading.","Harris is a boss, and the material's pretty cool.","Interesting content; Prof. Harris does a good job with this. Substantial work required. Broad preparation is very helpful.","Joe Harris is an amazing professor who motivates things superbly with a stellar geometric intuition.","Harris is an excellent lecturer.","Professor Joe Harris is among the absolutely best lecturers you will find at Harvard, and he is a wonderful person who genuinely cares about his students. It is worth taking any class taught by him, just because of his geometric insights, clear explanations and great heuristics.","This is the best complex analysis class. Ever.","Complex numbers are magic.","Professor Harris is great. The material is central to a lot of mathematics, and the later topics of the course (conformal mapping, elliptic functions, and analytic number theory) were fascinating."]},"Fall '12":{"comments":["Sukhada is a great professor and incredibly accommodating. The material is tough but the presentation is good.","Awesome subject, awesome prof.","Was really great - not too difficult but really interesting material.","Complex analysis is something that every math concentrator should take, especially at the graduate level because it's so beautiful. We were lucky to have Suk teach it this year, since Suk is very laid back and the pace of the class gave us enough time to fully absorb all the material before moving on.","Like any math class, this will vary greatly from year to year. Since it was our lecturer's first year, and CA is not her primary field of study, we moved more slowly than some years in the past (namely we did most of Ahlfors, excepting ch. 8, and a few additional topics). Still, it was a very good introduction to more advanced topics (elliptic functions, Picard theorems) than you might find in a first course. Overall, it was very enjoyable and laid back. I would definitely recommend this class for undergrad math concentrators with sufficient preparation."]},"Fall '13":{"comments":["This is a great class.  The material is very interesting.","The class is very interesting. You learn lots of cool theorems. Lecture can be a bit boring at times though.","complex analysis is nice, schmid is a super nice guy but doesn't give much intuition or motivation sometimes, so lecture can be a bit dry","Pretty straightforward class if you understand 110 material. Blitz is fun. The class can overlap with the book a lot (as in the lectures may be nothing new), but the material itself is quite engaging.","Review topology (especially topics such as covering maps) before taking this course.  If Professor Schmid is teaching the course again, enroll with caution; I found his lecture style exceedingly dry, and he makes far less of an effort to motivate new topics than other professors do.","I really enjoyed the material in this course.  Definitely consider taking.","It is not strictly necessary to take math 113 before taking this class -- but if you want to skip it, you should read a little before, and take extra care to practice actually computing contour integrals.","The class was good and logically presented, but sometimes it moved a little slow and didn't feel motivated (of course later we learned why we were doing certain things).  The homework was mostly pretty easy, though the take-home final was challenging.","Professor Schmid is a very good lecturer and this class is generally pretty awesome. The psets were a bit lacklustre, however; it would have been nice if they had contained more difficult problems.","This was quite an enjoyable class. Not only is it fundamental for every mathematician to learn, but the material taught is some of the most beautiful and surprising elementary material in mathematics. The big results are mostly simple to state, but unbelievable. Many of the computation techniques learned are useful in other fields.","Once you get used to Prof Schmid's style, he is a very good lecturer. I enjoyed talking with him in office hours.","Complex analysis is... really cool. This statement seems to apply to complex analysis more than other subfields of math, for some reason or another. A lot of the results are extremely nice, and problems are fun to think about. Also, Schmid is an excellent professor, so definitely take this class if he's teaching it again.","Complex analysis is a really nice topic (this sentiment seems widespread). Most of the material in this course seemed relatively accessible, so I would definitely recommend taking it."]},"Fall '15":{"comments":["This course was a very solid introduction to complex analysis. That said, Professor Schmid is very particular about the way he does. Lectures often got bogged down in the details and it was difficult to grasp the main idea. Professor Schmid rarely provided intuition behind proofs. His iteration of math 213a also heavily uses matrix groups, which was at times annoying, confusing, and felt beside the point.","Schmid was very detail-oriented, and I learned a lot from just how careful everything was done in class. I highly recommend this type of course -- I've learned more in this math class than most others.","Very solid class on functions of 1 complex variable. If you've already taken a first course like 113 there will be a fair amount of review, but it goes fast.","Professor Schmid doesn't always motivate things well, but the results you'll cover are extremely cool and useful.","Professor Schmid is quite adept at teaching complex analysis, and if you take is course, you will experience a very detailed, rigorous introduction to the subject. That being said, you might often find yourself wondering where the course is going, because little motivation and intuition is provided. It certainly helps to read a complex analysis textbook in addition to attending the lectures.\r\n\r\nAlso beware that the final exam is unusually annoying in this course -- not only is there a written take-home test, but there is also an oral exam, and it is difficult to prepare for the latter. Although the idea of an oral exam is justified, as there is no way of verifying whether a student's homework is their own work, giving a take-home test contradicts this justification.","This class is a pretty typical difficult math class. The professor is dry and uninspiring, but he is a very kind person and is of course very knowledgeable. It is worth emphasizing how Schmid is a truly kind person: he is flexible and understanding. The class is very easy the first half or so, but the last few weeks are incredibly difficult. The final exam is difficult, and frankly I have no idea what was going on in class the last few weeks, as the level of abstraction radically increases, and the material becomes a lot more sophisticated. I think the class is overall worth taking, but don't expect to change your life."]}},"mostRecentQ":{"overall":"4.50","workload":"7.40","difficulty":null,"recommendation":"4.50","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"MATH 213a","course_id":"2878","cat_num":"1621","1s":"0","2s":"2","3s":"6","4s":"6","5s":"1"},"QWorkload":{"number":"MATH 213A","course_id":"2878","cat_num":"110880","1s":"0","2s":"3","3s":"8","4s":"0","5s":"0"}},"success":true}