{"scores":{"Spring '13":{"course_score":{"overall":"4.43","workload":"3.14","difficulty":"3.86","recommendation":"4.29","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"MATH 168","cat_num":"31297","course_id":"2875","year":"2012","term":"2","id":"c3c05f71bcef4f9b323963dd58428786","first":" Rachel Louise","last":"Epstein","InstructorOverall":"4.14","EffectiveLecturesorPresentations":"4.14","AccessibleOutsideClass":"4.67","GeneratesEnthusiasm":"4.14","FacilitatesDiscussionEncouragesParticipation":"4.33","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.67"}]}},"comments":{"Spring '13":{"comments":["Computability theory is pretty awesome! Go to section and develop good relationships with your peers and tf.","Computability theory is intrinsically an interesting branch of math. That said, the methods and mechanisms required for working with it are quite unique. Educational, but frustrating.","This class, unlike CS124, is more interested in how to classify noncomputable problems rather than classifying computable ones.","This is a really different kind of math. Take it if you're interested in what sorts of things computers can and can't do, and if you're interested in various ideas regarding noncomputability (which has applications in game theory, set theory, number theory, etc.), but not if you just want another math class. I enjoyed it a lot.","Be warned that the intuition behind the material in this course is completely different from the intuition you develop from most other math courses you have likely taken - especially if you naturally think about mathematical problems in physical or pictorial terms.  You get a VERY good grounding in the material, and it's mind-expanding to get used to a new set of proof techniques (you have to, as many of the homework problems involve adapting other people's proofs of theorems), but until then, you're likely to wonder why Dr. Epstein mentioned that the homework problem you spent four hours trying \"should be easy.\"  You need time to think over the readings (especially the proof techniques) if you want to understand them, so be careful taking this with a busy schedule.  Also, the course textbook is an unpublished draft written by our professor's doctoral adviser, and it is imperfect or idiosyncratic in several respects (notably, in giving \"hints\" for exercises that turn the entire exercise into a quest to understand why the hint is useful) - but with luck, it should be substantially improved for the next time the course is offered."]}},"mostRecentQ":{"overall":"4.43","workload":"3.14","difficulty":"3.86","recommendation":"4.29","enrollment":"9","response rate":"77.78","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}