{"scores":{"Spring '15":{"course_score":{"overall":"4.80","workload":"9.00","difficulty":null,"recommendation":"4.80","enrollment":"13","response rate":"69.23","QCourseOverall":{"number":"MATH 161","course_id":"12500","cat_num":"110438","1s":"0","2s":"0","3s":"1","4s":"2","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MATH 161","course_id":"12500","cat_num":"110438","1s":"0","2s":"7","3s":"2","4s":"1","5s":"0"}},"instructor_scores":[{"number":"MATH 161","cat_num":"110438","course_id":"12500","year":"2014","term":"2","id":"7fc93f54d5f76c3338d09bab688f164e","first":" Emily Elizabeth","last":"Riehl","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '15":{"comments":["This course is amazing.  The material is really interesting, the lectures are engaging, and on the whole the course does an excellent job of tying the material back to realizations of the theory in various areas of math.  On the whole, the course lived up to its billing of seeking to unify the various fields of math that we had studied previously.  One of my favorite classes I have taken at Harvard.","Riehl speaks quickly, so be ready to write. I found it fun. The best piece of advice I could give would be review Riehl's online notes quickly after class, and make sure you can recreate the proofs if they moved too quickly during class.","It is a shame that Dr. Riehl will not be at Harvard next year. She taught this course masterfully, and is clearly extremely passionate about the subject. So many people like to frame problems categorically at Harvard; it is highly recommendable to take a course like this on category theory (which is even more abstract than the usual math classes at Harvard - and that's saying something!). It gives one a neat - in fact, I'd say, profound perspective. Additionally, the stuff taught, I have been told, has use in functional programming.\r\n\r\nIn learning category theory, one learns how numerous things that we are familiar with are interconnected at the structural level (i.e., the tesnor product of rings is the same as the gluing together of topological spaces; the 'direct sum of modules' is to the 'free product' of groups as the 'Cartesian product' of modules is to the 'Cartesian product' of groups, how the Induced representation is a [pointwise] Kan extension, etc.). Category theory is a highly useful language, and allows one to make explicit many of the heuristic insights of the \"science of analogy\" (a term Atiyah used to describe all of mathematics). Dr. Riehl is clearly a world-class expert on this subject; it was a privilege to take this class with her.","In general the proofs are not too crazy, but the ideas can take some time to feel like you can completely hold them in your head.  Very nice math though, would recommend!","So cool! It's abstract nonsense, but in the best possible way. Distill math down to it's fundamental skeleton and see what you can prove. Also you get to draw pretty diagrams. What's better than proof by pretty diagram?"]}},"mostRecentQ":{"overall":"4.80","workload":"9.00","difficulty":null,"recommendation":"4.80","enrollment":"13","response rate":"69.23","QCourseOverall":{"number":"MATH 161","course_id":"12500","cat_num":"110438","1s":"0","2s":"0","3s":"1","4s":"2","5s":"7"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MATH 161","course_id":"12500","cat_num":"110438","1s":"0","2s":"7","3s":"2","4s":"1","5s":"0"}},"success":true}