{"scores":{"Spring '15":{"course_score":{"overall":"4.80","workload":"8.50","difficulty":null,"recommendation":"4.80","enrollment":"53","response rate":"26.42","QCourseOverall":{"number":"MATH 266","course_id":"12509","cat_num":"156055","1s":"0","2s":"0","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MATH 266","course_id":"12509","cat_num":"156055","1s":"1","2s":"6","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MATH 266","cat_num":"156055","course_id":"12509","year":"2014","term":"2","id":"e6f18d4634271edac6e6dc1f6d6cffed","first":" Joseph D.","last":"Harris","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '15":{"comments":["This is hands down the best class I've taken at Harvard so far. Intersection theory is a beautiful topic and Professor Harris makes the material clear and exciting.","A must-take class for anyone interested in algebraic geometry. Professor Harris' lectures are incredibly clear and well-organized, and in addition to walking away with improved geometric intuition and an upgraded toolkit for solving problems in enumerative geometry, you'll finally be able to impress all your friends with your knowledge, among other things, of the number of conics tangent to five general conics.","This class is a fantastic introduction to some of the techniques used in research-level algebraic geometry and related fields. You will get to answer interesting questions from the beginning, and all the techniques are well-motivated by concrete problems. Plus, Harris is a fantastic lecturer.","Math 266 is a once-in-a-lifetime opportunity to learn algebraic geometry (specifically intersection theory) at the highest level with Joe Harris, who is one of the greatest professors at Harvard. The course is fast-paced, informative, and amazingly taught; the assignments are tough but well-structured and extremely useful. Harris' enthusiasm for the subject is contagious, and he succeeded in making the whole class excited about the material. I learned so much more in this course than I could have ever imagined!","This is a great class, and you should take it whenever it is offered and taught by Professor Harris. It gives you great intuition about geometry, and you learn to think about geometric problems in an intuitive way."]}},"mostRecentQ":{"overall":"4.80","workload":"8.50","difficulty":null,"recommendation":"4.80","enrollment":"53","response rate":"26.42","QCourseOverall":{"number":"MATH 266","course_id":"12509","cat_num":"156055","1s":"0","2s":"0","3s":"2","4s":"4","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MATH 266","course_id":"12509","cat_num":"156055","1s":"1","2s":"6","3s":"2","4s":"0","5s":"0"}},"success":true}