{"scores":{"Spring '17":{"course_score":{"overall":"4.50","workload":"24.10","difficulty":null,"recommendation":"4.00","enrollment":"23","response rate":"78.26","QCourseOverall":{"number":"MCB 99B","course_id":"13875","cat_num":"159651","1s":"0","2s":"1","3s":"1","4s":"3","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MCB 99B","course_id":"13875","cat_num":"159651","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"}},"instructor_scores":[{"number":"MCB 99B","cat_num":"159651","course_id":"13875","year":"2016","term":"2","id":"86a43299f1f8c37a6a995a95abcf686f","first":" Martin A.","last":"Samuels","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '16":{"course_score":{"overall":"4.10","workload":"25.80","difficulty":null,"recommendation":"3.80","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"MCB 99B","course_id":"13875","cat_num":"159651","1s":"0","2s":"1","3s":"1","4s":"3","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MCB 99B","course_id":"13875","cat_num":"159651","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"}},"instructor_scores":[{"number":"MCB 99B","cat_num":"159651","course_id":"13875","year":"2015","term":"2","id":"86a43299f1f8c37a6a995a95abcf686f","first":" Martin A.","last":"Samuels","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '16":{"comments":["The question of whether to write a thesis in MCB requires a great deal of consideration.  The first consideration to make is whether you will have enough data to really justify a thesis.  Students are often told that they should be working in a lab by junior spring in order to write a thesis, but I'm not sure this is a sufficient amount of time regardless of the student's prior lab experience.  Molecular biology requires an incredible amount of optimization, and experiments (especially those involving cell-based or in vivo assays) take inordinate amounts of time.  When my experiments hit barriers in the fall semester, I spent the remainder of the year worrying about whether my thesis would have insufficient data and result in a poor grade (because yes, MCB theses are graded, which my lab didn't even know because there is such poor communication between the department and the medical school labs).  Students with relatively little lab work might be better served doing MCB 91r, which may allow them to get closer to a publication (which is probably better for career purposes than even an award-winning thesis).\r\n\r\nAnother important consideration is the other commitments students will have during their senior year.  It's wonderful to talk about thesis during medical school interviews, but it's also incredibly difficult to do the research and the interviews at the same time!  Think about how much you are willing to sacrifice (time, sleep, health, an enjoyable senior year) before committing to a thesis while going on the interview circuit for graduate\/professional school or post-Harvard jobs.  \r\n\r\nIn the end the decision to write a thesis must be made upon a thorough evaluation of the individual's circumstances.  Tutors in Biochemical Sciences are probably the best people to consult since they know their students, serve as thesis readers, and do not have the biases of concentration advisers or lab supervisors when it comes to writing a thesis.","MCB99 is mandatory if you plan to write a thesis. If you feel prepared for a tough year of balancing research, writing, classes, and extracurriculars, then you're ready for this course.","Writing my thesis was a nice way to practice writing a lot, and synthesize all the work I had done, but it was frustrating to have such little guidance and useless feedback from my advisers.","it's a great way to gain experience doing individual research, and you can do it doing a project your deeply interested in."]},"Spring '17":{"comments":["Writing a thesis was an incredibly enjoyable experience because of the amazing concentration advising staff, how exciting I found my thesis topic, and my incredible lab thesis adviser. If you're passionate about exploring a scientific area of interest, write a thesis!","If you are comfortable with scientific writing and flexible with your research timeline, you will enjoy producing lab results and writing a thesis!","n\/a","Do a thesis it's great. Don't expect much department help so get your logistical questions out early.","Gives you time to do your lab work, so.. :)","It's a thesis, you've been warned."]}},"mostRecentQ":{"overall":"4.50","workload":"24.10","difficulty":null,"recommendation":"4.00","enrollment":"23","response rate":"78.26","QCourseOverall":{"number":"MCB 99B","course_id":"13875","cat_num":"159651","1s":"0","2s":"1","3s":"1","4s":"3","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MCB 99B","course_id":"13875","cat_num":"159651","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"}},"success":true}