{"scores":{"Fall '11":{"course_score":{"overall":"4.73","workload":"2.10","difficulty":"3.60","recommendation":"5.00","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"MUSIC 101r","course_id":"3625","cat_num":"71843","1s":"0","2s":"0","3s":"0","4s":"3","5s":"8"},"QDifficulty":{"number":"MUSIC 101r","course_id":"3625","cat_num":"71843","1s":"0","2s":"1","3s":"4","4s":"3","5s":"2"},"QWorkload":{"number":"MUSIC 101r","course_id":"3625","cat_num":"71843","1s":"2","2s":"6","3s":"1","4s":"1","5s":"0"}},"instructor_scores":[{"number":"MUSIC 101r","cat_num":"71843","course_id":"3625","year":"2011","term":"1","id":"15c8e104b5b6c3a44838025a5cf4254d","first":"Elizabeth","last":"Lerman","InstructorOverall":"4.89","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.89","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Fall '11":{"comments":["I wish that future students could take this class!  It's such a shame that Liz is only here for a semester.","Liz Lerman is a brilliant educator who lives her pedagogy. She is accessable, genuine and honnest.","This class was the best class I have ever taken. It helped me expand my thinking for what is possible in the world and in my life.","It was an incredibly valuable course and I think that was the general consensus among students, regardless of their experience with dance and movement or their professional interests. It was truly a one-of-a-kind learning experience.","Seriously? This is a great course if you want to prepare yourself for talking to anyone about anything, creating structure, planning, working with others, and giving feedback on others' work. All around this course will help anybody and everybody...","I don't know if this will ever be taught again, but if it is, and Liz is here on campus, and you are reading this, please, PLEASE at least shop this class. This class changed me as an artist and as a person.","Take it! It will change your life!","I was initially searching for a course engaged with dance either physically or intellectually, as a complement to my thesis research on new typologies for performance space. Liz's course description lured me in. There was incredible wisdom in the wording: \"Ask a big enough question and you will need more than one discipline to answer it;\" or \"inquiry based problem solving in the public arena.\" I sensed that the instructor had something important to teach us.","The relationships formed are genuine and the class is incredibly rewarding if you give it a chance.","This class will make you think about everything and everyone around you with new clarity and understanding."]}},"mostRecentQ":{"overall":"4.73","workload":"2.10","difficulty":"3.60","recommendation":"5.00","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"MUSIC 101r","course_id":"3625","cat_num":"71843","1s":"0","2s":"0","3s":"0","4s":"3","5s":"8"},"QDifficulty":{"number":"MUSIC 101r","course_id":"3625","cat_num":"71843","1s":"0","2s":"1","3s":"4","4s":"3","5s":"2"},"QWorkload":{"number":"MUSIC 101r","course_id":"3625","cat_num":"71843","1s":"2","2s":"6","3s":"1","4s":"1","5s":"0"}},"success":true}