{"scores":{"Fall '15":{"course_score":{"overall":"4.70","workload":"2.90","difficulty":null,"recommendation":"4.80","enrollment":"16","response rate":"81.25","QCourseOverall":{"number":"MUSIC 16A","course_id":"11325","cat_num":"110128","1s":"0","2s":"0","3s":"0","4s":"4","5s":"9"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 16A","course_id":"11325","cat_num":"110128","1s":"4","2s":"4","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 16A","cat_num":"110128","course_id":"11325","year":"2015","term":"1","id":"6209a69d76655ddaaa4b8c9a2c4fa33d","first":" Andrew Gregory","last":"Clark","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '14":{"course_score":{"overall":"4.70","workload":"5.70","difficulty":null,"recommendation":"4.80","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"MUSIC 16A","course_id":"11325","cat_num":"110128","1s":"0","2s":"0","3s":"0","4s":"4","5s":"9"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 16A","course_id":"11325","cat_num":"110128","1s":"4","2s":"4","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '14":{"comments":["RCS as a class is wonderful and as long as you don't have major attendance issues, is pretty much the same as doing it as an extracurricular.","RCS is great. If you have even the inkling of an urge to audition, do it! Beth is amazing (though she'll be leaving next year, but I'm sure whoever replaces her will be amazing too!), the group is amazing, and the music is beautiful.","Take RCS for credit! The chorus is amazing and gets to sing a variety of repertoire, the conductors are nice and expect a lot of you, and the organization is almost completely student run, and gives lots of opportunities for members to get involved and have a say in decisions. There is very little difference between taking RCS for or without credit, so long as one remembers to go to rehearsal. \n\nBefore I joined RCS, I had played classical violin for 12 years and had never sung before. This chorus is open not only to people with prior singing experience, but also to people who are willing to learn how to sing and who are interested in choral music. Because it is a women's chorus, the repertoire sung here is very different from the music sung in co ed and men's choirs, and is both musically and historically interesting.","Singing in RCS is such a community experience! I have bonded with amazing girls, gained confidence in myself, and learned that even groups work together with other groups (RCS sings with Glee Club).","RCS has been one of the best things that has happened to me at Harvard. Not only is it incredibly rewarding to have the opportunity to work with such an amazingly talented group of women (and men when we collaborate with Glee Club and COllegium), but RCS provides you with a home on campus.","It takes more time than you think and it has to be a priority if you take it as a class.","RCS is far more than a class. It is a choir and a sisterhood.","I love RCS so much. It's not only a class, but a choral community and a sisterhood. <3","This is just like being in RCS, but you get credit for it! Rehearsals take 5 hours a week, and the music and people are fun. Beth is a great conductor.","RCS IS BY FAR the best experience I've had at Harvard <3"]},"Fall '15":{"comments":["This class is a really great experience","If you enjoy singing, this is an awesome way to get credit for it while learning about different musical styles, furthering yourself as a singer, and meeting an amazing community of women.","The directors and students are very kind, and the course is very very enjoyable.  It takes up more time than you expect, but I think it's worth it.","RCS is a great opportunity to grow your vocal skills and work with other singers in a supportive, collaborative community.","RCS is a wonderful environment, and I am so grateful for all of the wonderful opportunities it has provided me."]}},"mostRecentQ":{"overall":"4.70","workload":"2.90","difficulty":null,"recommendation":"4.80","enrollment":"16","response rate":"81.25","QCourseOverall":{"number":"MUSIC 16A","course_id":"11325","cat_num":"110128","1s":"0","2s":"0","3s":"0","4s":"4","5s":"9"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 16A","course_id":"11325","cat_num":"110128","1s":"4","2s":"4","3s":"0","4s":"0","5s":"0"}},"success":true}