{"scores":{"Fall '14":{"course_score":{"overall":"4.70","workload":"6.30","difficulty":null,"recommendation":"4.60","enrollment":"19","response rate":"84.21","QCourseOverall":{"number":"PHIL 139","course_id":"12566","cat_num":"4546","1s":"0","2s":"0","3s":"1","4s":"3","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PHIL 139","course_id":"12566","cat_num":"4546","1s":"0","2s":"9","3s":"5","4s":"0","5s":"1"}},"instructor_scores":[{"number":"PHIL 139","cat_num":"4546","course_id":"12566","year":"2014","term":"1","id":"b41e46a9f0ec4f42b6db21ac94ca579d","first":" Sean D","last":"Kelly","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.60"}]}},"comments":{"Fall '14":{"comments":["Heidegger is magnificent. He will challenge you and madden you, but the insights you glean are well worth it. I have never encountered writing so applicable to living and thinking, in spite of its extreme complexity. Heidegger is indeed transformative. Finally, Professor Kelly is excellent and very willing to work through the texts.","Heidegger's later writing can seem pretty vague and incomprehensible. But it's worth a read. Professor Kelly is also an excellent lecturer and is so good at making the material more accessible.","This course will change your perspective of philosophy! Sean Kelly is a great professor, very friendly and easy to talk to. I loved the course, but it is an advanced course. If you are not very interested in philosophy, this course will be hard to understand and perhaps boring.","This is a challenging and wonderful class, and a delightful change-up from the more typical courses offered in our philosophy department.","Professor Kelly and Paul the TF were both very genial and approachable. The lectures were fantastic, probably some of the more mindbending sets of lectures I've had as an undergraduate. You'll tackle truth, art, meaning, history, technology and even thinking itself in a way you're most certainly not acclimated too unless you've read Heidegger before. Heidegger is not the sort of system builder or analyst that you've studied in your previous philosophy class. Derivations from some declared \"axioms\" are really not his thing.\n\nGo to office hours, you'll be able to have some great discussions there.","This class does't only tell you what is the later philosophy of Heidegger, but to teach you think freely with Heidegger, with no constrain of the pre-defined philosophical tradition.","Heidegger is a scintillating writer and the course subject is hard to wrap your mind around, but ultimately you get to understand one of the great thinkers of the western world.","Not only is this course a terrific introduction to later Heidegger, it is a good entryway into the history of philosophy--- Professor Kelly does a good job of elucidating Heidegger's place in intellectual history, without getting bogged down or unfairly representing the philosophers Heidegger is building off of.","If you're at all interested in Heidegger, you need to take this class.","Heidegger is hard, but Prof. Kelly is good at making sense of him. If you would like to learn about Heidegger, you should take this course."]}},"mostRecentQ":{"overall":"4.70","workload":"6.30","difficulty":null,"recommendation":"4.60","enrollment":"19","response rate":"84.21","QCourseOverall":{"number":"PHIL 139","course_id":"12566","cat_num":"4546","1s":"0","2s":"0","3s":"1","4s":"3","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PHIL 139","course_id":"12566","cat_num":"4546","1s":"0","2s":"9","3s":"5","4s":"0","5s":"1"}},"success":true}