{"scores":{"Fall '14":{"course_score":{"overall":"4.30","workload":"4.20","difficulty":null,"recommendation":"4.30","enrollment":"25","response rate":"76.00","QCourseOverall":{"number":"PHIL 117","course_id":"4047","cat_num":"3897","1s":"0","2s":"0","3s":"1","4s":"10","5s":"7"},"QDifficulty":{"number":"PHIL 117","course_id":"4047","cat_num":"3897","1s":"0","2s":"1","3s":"10","4s":"3","5s":"0"},"QWorkload":{"number":"PHIL 117","course_id":"4047","cat_num":"3897","1s":"2","2s":"10","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PHIL 117","cat_num":"3897","course_id":"4047","year":"2014","term":"1","id":"25857a432afc38d32abf45843107be01","first":" Jeffrey K.","last":"McDonough","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '12":{"course_score":{"overall":"4.14","workload":"2.14","difficulty":"3.14","recommendation":"3.93","enrollment":"18","response rate":"77.78","QCourseOverall":{"number":"PHIL 117","course_id":"4047","cat_num":"3897","1s":"0","2s":"0","3s":"1","4s":"10","5s":"7"},"QDifficulty":{"number":"PHIL 117","course_id":"4047","cat_num":"3897","1s":"0","2s":"1","3s":"10","4s":"3","5s":"0"},"QWorkload":{"number":"PHIL 117","course_id":"4047","cat_num":"3897","1s":"2","2s":"10","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PHIL 117","cat_num":"3897","course_id":"4047","year":"2012","term":"1","id":"25857a432afc38d32abf45843107be01","first":"Jeffrey K.","last":"McDonough","InstructorOverall":"4.64","EffectiveLecturesorPresentations":"4.64","AccessibleOutsideClass":"4.79","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.69","GivesUsefulFeedback":"4.75","ReturnsAssignmentsinTimelyFashion":"4.75"}]}},"comments":{"Fall '12":{"comments":["This course is a great overview of Augustine and Aquinas especially (I didn't know much about Ockham before the course), it's good for getting a feel for how they write and think, as well as a source for grappling with them.","If you have a strong interest in philosophy, this course will be very interesting and enjoyable. The material can, at times though, feel a bit torturous and confusing. Nevertheless, the discussion is enjoyably difficult and you will certainly develop your critical thinking skills!","This class provides an interesting, thought-provoking look at a period of philosophy with which many are unacquainted. I'd recommend it to anyone with an interest in history of philosophy, or also the relation between theology and philosophy.","I fail to see why this is required for a philosophy concentration. The professor was good and the work load was manageable, but neither of those things were enough to keep me interested in the extremely dry and fruitless-feeling material. If these problems were discussed as effectively and then solved more satisfactorily by a later philosopher...why are we reading them from these authors?","This class was wonderful! Professor McDonough is the best - his lectures are engaging and his lecture notes are superb. The class atmosphere was relaxed, but I learned a lot. Also, medieval philosophy might not initially sound like your favorite field, but the topics were all very interesting and worth studying, especially with this professor and Olivia, who was the TF.","Don't count the medievals out! Augustine, Aquinas, and particularly Ockham have novel answers to the great philosophical questions; and they are a missing link between the ancients and the moderns. Professor McDonough is great.","A very helpful study of Medieval philosophy.","Take this class, even if you think you don't have any particular interest in Medieval Philosophy. The discussions are very enjoyable and thought-provoking. You will learn a lot about the most important philosophical traditions (Aristotelianism, Platonism, and Nominalism through Aquinas, Augustine, and Ockham) that led to Early Modern Philosophy."]},"Fall '14":{"comments":["Take. This. Class. Prof. McDonough is amazing. 90 minutes fly by.","This is a very good introduction to medieval philosophy, but it does require that you be interested in it for it not to be boring. It was well taught, but it's hard to make Aquinas fun!","I came into this course thinking it would be more interesting than it actually turned out to be. Perhaps that is simply because I learned medieval philosophy does not excite me as I thought it did, but the course itself does not seem to be the most thrilling among the philosophy department offerings. You will learn a fair amount especially if you keep up with the readings, and the professor is very nice, but you should seriously consider whether this course really excites you.","Try to ask lots of questions instead of just letting things go by without understanding them. Try doing the readings after we go through them in class because they will probably make a lot more sense than if you just try to hack at them on your own.","Prof McDonough is a fun and easygoing teacher, and the readings were very interesting and well motivated. Lectures were helpful in explaining the main themes of the readings. The writing assignments were not stressful. Overall the class was fun and not difficult. My only regret is that it felt difficult to engage with the medievals at a deep level, beyond these broad-brushstroke sketches.","Great material to get through. Really gives you a solid base of knowledge to understand modern thought. Just be prepared to change your engagement strategies depending on the different thinkers: for Augustine the readings are imperative, for Aquinas the readings are less important but you will have to think a lot harder.","Fairly easy fly-over of medieval philosophy","McDonough is great! If the class is small. He leads wonderful discussions and makes it easy to discuss philosophy.","This was the last class I had to take as a philosophy concentrator, mostly because I find the medieval stuff to be pretty dry. However, Professor McDonough is one of the best professors in the department, and I love taking his classes. Would recommend taking any class with him, because of his good sense of humor and strength in explaining difficult, seemingly convoluted material.","Do Phil 117. Work with Prof. McDonough. You will not regret it.","This is a really great class. I didn't think I would be interested in the material and came mostly for the teaching, but I ended up becoming pretty enthusiastic about the material too!"]}},"mostRecentQ":{"overall":"4.30","workload":"4.20","difficulty":null,"recommendation":"4.30","enrollment":"25","response rate":"76.00","QCourseOverall":{"number":"PHIL 117","course_id":"4047","cat_num":"3897","1s":"0","2s":"0","3s":"1","4s":"10","5s":"7"},"QDifficulty":{"number":"PHIL 117","course_id":"4047","cat_num":"3897","1s":"0","2s":"1","3s":"10","4s":"3","5s":"0"},"QWorkload":{"number":"PHIL 117","course_id":"4047","cat_num":"3897","1s":"2","2s":"10","3s":"2","4s":"0","5s":"0"}},"success":true}