{"scores":{"Spring '17":{"course_score":{"overall":"4.50","workload":"10.70","difficulty":null,"recommendation":"4.20","enrollment":"19","response rate":"68.42","QCourseOverall":{"number":"PHYSICS 201","course_id":"13997","cat_num":"161201","1s":"0","2s":"0","3s":"2","4s":"6","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PHYSICS 201","course_id":"13997","cat_num":"161201","1s":"0","2s":"2","3s":"3","4s":"1","5s":"6"}},"instructor_scores":[{"number":"PHYSICS 201","cat_num":"161201","course_id":"13997","year":"2016","term":"2","id":"d5da4ad9a60144994d3e0594c41e3f09","first":" Vinothan N","last":"Manoharan","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '16":{"course_score":{"overall":"4.20","workload":"12.00","difficulty":null,"recommendation":"4.40","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"PHYSICS 201","course_id":"13997","cat_num":"161201","1s":"0","2s":"0","3s":"2","4s":"6","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PHYSICS 201","course_id":"13997","cat_num":"161201","1s":"0","2s":"2","3s":"3","4s":"1","5s":"6"}},"instructor_scores":[{"number":"PHYSICS 201","cat_num":"161201","course_id":"13997","year":"2015","term":"2","id":"d5da4ad9a60144994d3e0594c41e3f09","first":" Vinothan N","last":"Manoharan","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Spring '16":{"comments":["Great, great class on python and data analysis. Ran really, really smoothly, especially for a first time class.","I would be likely to recommend this course with enthusiasm but also reservations.  I think this has the potential to be a great course for any physicist (or really any scientist with a good quantitative background) to develop good (and actually useful!) data analysis skills.  However, I think that potential isn't fully realized (yet - I'm guessing this course will get better in future years!).  This course felt at times like 101 ways to fit a straight line and until the very end seemed to gloss over the fact the most data analysis is way more complicated than that.  Also, the workload increase by a factor of 3 or 4 at the end of the semester when we started working on the final project.  - And, unfortunately, most of this work seemed to be on what felt like trival details (focused mainly around making the analysis a package that anyone could download over the actual data analysis.  Taught with a lot of focus on Bayesian analysis.","This course provided an amazing introduction to statistical inference in a way that is useful for physicists, whether or not they are conducting experiments. It reviewed the pros and cons of Bayesian vs. Frequentist inference and then proceeded to introduce important algorithmic tools, such as Markov-Chain Monte Carlo. The course did, however, require a significant weekly commitment to problem sets that was much larger than was completely necessary to learn important concepts and techniques from the course. Future versions of the course will, hopefully, demand less work out of class and have fewer separate assignments.","It's an incredibly useful class, but it is rather time consuming. It covers really all of the essentials of statistical analysis, though. Your python skills will have improved by the end of the course.","A lot of work, but I also learned more than I have in any other grad class so far","Data analysis is a crucial skill for physicists, and this course does a great job of providing rigorous tools for statistical inference (especially with an eye towards experimentalists). The pedagogy is well thought out and provides consistent ties to 'real world' applications. I would highly recommend this course early in your physics career, as it provides a useful framework for a lot of work you will likely do moving forward. Be aware that the workload is very manageable during most of the semester, then ramps very sharply during the project. Plan for this.","This course includes everything I had wished I learned in undergraduate physics, including Bayesian and Frequentist statistics and python programming. This is a very practical course in terms of enhancing your own research skills. I would highly highly recommend it. The final project is a lot of work but Vinny invested an enormous amount of time in making sure we succeeded, and we got to work on our own research, which was a plus.","A great introduction to Bayesian and frequentist inference as applied to experimental data analysis. All experimentalists should learn this!","This is a good class to take if you want to learn practical methods for data analysis and you'd like to improve your programming skills. It's not a difficult class, and has a good return-on-investment."]},"Spring '17":{"comments":["great course, really useful information, and well taught","This is an excellent class to pick up skills that are very useful for research (python programming, statistics) and in which you get to actually apply them at the end in a quite open ended project.","The class is a lot of work, especially the final project. You have to design and produce an entire python package and also write a report. It's a useful learning process that is worth doing, but be prepared to put in many hours.","This is a very good class for those who want to learn applicable statistical techniques. It forces you to actually apply the approaches learned in class to real world problems and derive useful answers from your results. The class is moderately difficult, in that it requires probably 4-8 hours\/week on a pset, and the final project increases the intensity of the workload to maybe 10-12 hours\/week.","Vinny is an extraordinary professor: he's clear and engaging in lecture, and exceedingly dedicated to the course. The material is both interesting and practical\/pertinent to research. The assignments were useful and not overwhelming. And the final project is a great chance to work on something relevant to your research. I recommend this class very highly!","I think that every physicist should take a course like this--for experimentalists, so that they can do their research properly; for theorists, so that they can have an idea of what a scientific prediction or model is.  Vinny teaches it very well, and the tools the course teaches are very general--it covers both Bayesian and frequentist methods, and gives good guidance on which are appropriate when."]}},"mostRecentQ":{"overall":"4.50","workload":"10.70","difficulty":null,"recommendation":"4.20","enrollment":"19","response rate":"68.42","QCourseOverall":{"number":"PHYSICS 201","course_id":"13997","cat_num":"161201","1s":"0","2s":"0","3s":"2","4s":"6","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PHYSICS 201","course_id":"13997","cat_num":"161201","1s":"0","2s":"2","3s":"3","4s":"1","5s":"6"}},"success":true}