{"scores":{"Spring '17":{"course_score":{"overall":"4.40","workload":"4.20","difficulty":null,"recommendation":"4.80","enrollment":"12","response rate":"41.67","QCourseOverall":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":"PHYSICS 211r","course_id":"4116","cat_num":"0469","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"0","3s":"4","4s":"0","5s":"8"}},"instructor_scores":[{"number":"PHYSICS 211R","cat_num":"117201","course_id":"4116","year":"2016","term":"2","id":"0480f9b4524e6d7fd30275e60d5a8676","first":" Lisa","last":"Randall","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '16":{"course_score":{"overall":"4.20","workload":"13.90","difficulty":null,"recommendation":"4.20","enrollment":"20","response rate":"65.00","QCourseOverall":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":"PHYSICS 211r","course_id":"4116","cat_num":"0469","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"0","3s":"4","4s":"0","5s":"8"}},"instructor_scores":[{"number":"PHYSICS 211R","cat_num":"117201","course_id":"4116","year":"2015","term":"2","id":"188f086237c7da9462568fb259aac74d","first":" Andrew","last":"Strominger","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"3.20","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '15":{"course_score":{"overall":"4.00","workload":"11.50","difficulty":null,"recommendation":"4.20","enrollment":"33","response rate":"87.88","QCourseOverall":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":"PHYSICS 211r","course_id":"4116","cat_num":"0469","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"0","3s":"4","4s":"0","5s":"8"}},"instructor_scores":[{"number":"PHYSICS 211R","cat_num":"117201","course_id":"4116","year":"2014","term":"2","id":"188f086237c7da9462568fb259aac74d","first":" Andrew","last":"Strominger","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.30"}]},"Spring '14":{"course_score":{"overall":"3.90","workload":"2.00","difficulty":"2.20","recommendation":"4.00","enrollment":"11","response rate":"63.64","QCourseOverall":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":"PHYSICS 211r","course_id":"4116","cat_num":"0469","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"0","3s":"4","4s":"0","5s":"8"}},"instructor_scores":[{"number":"PHYSICS 211r","cat_num":"0469","course_id":"4116","year":"2013","term":"2","id":"0480f9b4524e6d7fd30275e60d5a8676","first":" Lisa","last":"Randall","InstructorOverall":"3.20","EffectiveLecturesorPresentations":"3.00","AccessibleOutsideClass":"2.00","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"2.70","ReturnsAssignmentsinTimelyFashion":"2.70"}]},"Spring '12":{"course_score":{"overall":"4.71","workload":"4.00","difficulty":"3.86","recommendation":"4.71","enrollment":"14","response rate":"50.00","QCourseOverall":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":"PHYSICS 211r","course_id":"4116","cat_num":"0469","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"0","3s":"4","4s":"0","5s":"8"}},"instructor_scores":[{"number":"PHYSICS 211r","cat_num":"0469","course_id":"4116","year":"2011","term":"2","id":"188f086237c7da9462568fb259aac74d","first":"Andrew","last":"Strominger","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.71","AccessibleOutsideClass":"4.75","GeneratesEnthusiasm":"4.57","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '12":{"comments":["This class was maximally interesting, difficult, and at the frontier of the field.","This course is a must take for anyone interested in High Energy Theory. It is a very tough course, but it is worth every second spent. One learns a lot about the AdS\/CFT correspondence and its origins. Andy is an amazing teacher and makes things very clear."]},"Spring '14":{"comments":["This course covers a wide range of fascinating material that you may not encounter in other physics courses. Since it's oriented around presentations and discussions, the course can be frustrating when people are unprepared.","Don't expect a comprehensive coverage of how you calculate things, different concepts, etc, in cosmology, but do expect an interesting taster menu of different topics that may inspire you to learn more on your own.","Why not? You'll learn a lot without too much stress.","Very nice style in general; particularly the flexible nature of the presentation (very nice aspect).\r\n\r\nA particularly supportive and very understanding lecturer."]},"Spring '15":{"comments":["This is an excellent course. Professor Strominger is a renowned expert on black hole physics, and you should definitely take the class if he is teaching it.","This class is can be very all-over-the-place with difficulty. The material learned in lecture only barely lined up with the material on the problem sets, and involved reading a lot of journals to catch up on things. Many problems were deep and insightful, but took a lot of calculation to get there (which I suppose is the nature of general relativity). If you want to get really good at performing general relativistic calculations really fast, though, there's no better class at Harvard to take.","Class is pretty good, but could be better.  It is nice to see GR in action, though, as there isn't much talk about solutions to the Einstein's equations in 210.","This class is a great introduction to some classic topics on black holes. It is part 1 of a larger course on black holes and is absolutely amazing!","Strominger covers a lot of cool material, but make sure you have enough time to spend on the problem sets, which become more and more difficult and confusing. The pace of the class speeds up near the end.","This is an awesome course.  In addition to covering in depth material about black holes, it teaches you about the current approach to solving high level problems at the frontier of physics.  You should be ready to spend significant time outside of class thinking about the material and be comfortable finding outside resources to help you learn techniques which are not taught in class but are required for problem sets.","Andy Strominger is the best lecturer in the physics department.","This course is a fascinating introduction to the classical and quantum nature of black holes. This is a real graduate class with very little guidance on problem sets.","Physics 211r covers a wide variety of topics related to black holes. This course is useful if you want to do research in string theory and\/or quantum gravity. QFT in curved space also presents an interesting perspective on quantization.","The course provides a survey of many topics related to black holes, quantum gravity, and the information puzzle. The details tend to be skipped over and the discussions of physical results can be lacking at time.","This class is basically \"whatever Strominger feels like talking about that day.\" We started out the beginning of the semester with a plan to cover the classical aspects of black holes, and halfway through we were doing QFT in curved spacetime. It was interesting to basically get a summary course on some of Strominger's research on black holes in the 80's and 90's (the key on the problem sets is just to find the paper where he originally solved whatever problem you're working on). Altogether, the class was interesting but I feel like it will take time for me to appreciate much of what we covered in the second half of the class.","For undergraduates, take this class pass\/fail. It will make your life infinitely better. I think I'm glad I took this class, but also glad that I didn't feel beholden to finishing some very, very difficult assignments. Be very comfortable with 210 material and ready to pay attention to very long lectures (2 hours is a lot of time to be sitting there). This all said, fascinating topics. Isn't every budding physicist captivated by black holes?"]},"Spring '16":{"comments":["Taking Physics 211r with Prof. Strominger is like a rite of passage for students interested in physics. Every Harvard physics student should do it at least once, because it is a transformative and enlightening experience. I found this course to be very useful in that it allowed me to apply my understanding of general relativity and quantum field theory to do modern physics.\r\n\r\nThat being said, I spent around 40-50 hours per problem set, because they were extremely difficult and because the problems were not always worded clearly. Most of the problem sets involved reproving theorems from the research of great physicists like Strominger, Hawking, etc. Beware of the enormous workload associated with this course.","This is a very difficult course. It changes from year to year, but this year it was about Professor Strominger's recent research and its lead-up to his paper with Professors Hawking and Perry. Though the material is interesting, it was very difficult seeing how everything connected and the big picture of it all without going to office hours to talk about it. That said, once the big picture was understood the material really is neat!","I would tell them that it is very difficult especially if they are a first year student without a master's like me.","In this year's version of the class, it was a bleeding-edge seminar working its way up to Strominger and Hawking's recent paper on soft black hole hair. In other words, not for the faint of heart. It was extremely cool to be working so close to the cutting edge of this field  but at times I felt like I lost the physical picture of what was going on and got bogged down in the math. Overall, I'd recommend this class if you have the preparation for it but be careful as it takes a lot of work to actually answer the psets fully.","The problem sets are very hard and take a long time. I took the class pass\/fail, which was fine, but some of the problem sets were still non-trivial work (the pass\/fail requirement is about one-third of each problem set)."]},"Spring '17":{"comments":["The course material was extremely interesting and Professor Randall had great insight during the presentations.","This class is really cool. Admittedly, I took with Randall and I expect my experience would have been considerably different with a different professor, but for us it was pretty much just read\/hear about research topics in cosmology from a leading scholar in the field."]}},"mostRecentQ":{"overall":"4.40","workload":"4.20","difficulty":null,"recommendation":"4.80","enrollment":"12","response rate":"41.67","QCourseOverall":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":"PHYSICS 211r","course_id":"4116","cat_num":"0469","1s":"0","2s":"5","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"PHYSICS 211R","course_id":"4116","cat_num":"117201","1s":"0","2s":"0","3s":"4","4s":"0","5s":"8"}},"success":true}