{"scores":{"Spring '14":{"course_score":{"overall":"4.70","workload":"1.60","difficulty":"2.30","recommendation":"4.80","enrollment":"16","response rate":"75.00","QCourseOverall":{"number":"PSY 1054","course_id":"11330","cat_num":"27075","1s":"0","2s":"0","3s":"0","4s":"4","5s":"8"},"QDifficulty":{"number":"PSY 1054","course_id":"11330","cat_num":"27075","1s":"1","2s":"6","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1054","course_id":"11330","cat_num":"27075","1s":"6","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1054","cat_num":"27075","course_id":"11330","year":"2013","term":"2","id":"835925eb9be555e6decbd941b81d3925","first":" Justin J.","last":"Lehmiller","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '14":{"comments":["This has been one of my favorite classes at Harvard and I'm really glad I took it. Reading these papers and discussing these topics every week has really informed the way I think about sexuality in ways that I'm sure I'll now carry with me for the rest of my life. I had no idea so much literature on these issues already existed nor would I have probably figured out which papers\/books would be a good place to start learning more. It's been a really great experience discussing sexuality from an academic perspective instead of an anecdotal one. Professor Lehmiller created an incredible syllabus and is an incredible discussion facilitator. He is very passionate about these topics and it clearly shows during class. He's also very openminded but also very critical of research methods so it has been eye-opening to see different ways that different results can be interpreted. It's a shame this class will not likely be offered again in the near future.","Unfortunately, Dr. Lehmiller is leaving, so I'm not sure how helpful these reviews can be. I doubt this course will be offered again. That said, it was AMAZING, and I highly recommend it if by chance another professor offers the course in the future.","This was a fantastic class! This is the only class I've found at Harvard that really digs deep into the interdisciplinary research on sexual orientation, and explores its relevance and importance in a scientific but very critical\/analytical way. I've come away from the class better understanding the bio\/psycho\/social roots of sexual orientation, and also understanding that there's not any single answer to explain how sexual orientation comes to be (and that even labeling something as sexual orientation can be limiting). Also, Dr. Lehmiller is a wonderful instructor, and generates enthusiasm for the material on a daily basis. He sent me multiple articles that he thought I would find interesting, based on personal interests I expressed in the class. I'm sad this won't be offered again in the near future!","This is a course was an amazing and unique experience that has helped shape my academic interests. I highly valued the opportunity to enroll. Dr. Lehmiller is an exceptional teacher, and each class served to empower us to think like psychologists and collaborate on ideas. To gain such deep insight into the specific field of sexual orientation research, learn the ways the research reflects policy and has affected policy, was a wonderful learning experience. If you are not able to take this class with Dr. Lehmiller, you should still follow him on his blog http:\/\/www.lehmiller.com\/ as he tackles different media claims about sexuality and posts intriguing research. Amazing class!!","I really enjoyed this course. Professor Lehmiller is an incredibly thoughtful professor and really challenges the ways we think about research and sexual orientation in general. He also does a great job of facilitating productive discussions so that people don't go off on tangents that aren't academic in nature, so the class was a heck of a lot less frustrating than I was expecting (and I was expecting to be enraged.) Overall, I enjoyed it - manageable workload, and you can get a lot out of the class if you do all the readings.","Great class. Super interesting discussions and a really thorough scientific approach to examining sexual orientation.","Lehmiller is amazing, and the material is super interesting. Great class - really eye-opening and just overall fantastic.","Dr. Lehmiller is leaving. but if he weren't, i'd say take it. He is awesome.","Unfortunately, prof. lehmiller is leaving. but this was a brilliant class."]}},"mostRecentQ":{"overall":"4.70","workload":"1.60","difficulty":"2.30","recommendation":"4.80","enrollment":"16","response rate":"75.00","QCourseOverall":{"number":"PSY 1054","course_id":"11330","cat_num":"27075","1s":"0","2s":"0","3s":"0","4s":"4","5s":"8"},"QDifficulty":{"number":"PSY 1054","course_id":"11330","cat_num":"27075","1s":"1","2s":"6","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1054","course_id":"11330","cat_num":"27075","1s":"6","2s":"5","3s":"1","4s":"0","5s":"0"}},"success":true}