{"scores":{"Spring '17":{"course_score":{"overall":"4.40","workload":"2.90","difficulty":null,"recommendation":"4.40","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"PSY 1559","course_id":"12788","cat_num":"156640","1s":"0","2s":"0","3s":"0","4s":"0","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1559","course_id":"12788","cat_num":"156640","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"}}},"Spring '16":{"course_score":{"overall":"5.00","workload":"4.50","difficulty":null,"recommendation":"5.00","enrollment":"6","response rate":"66.67","QCourseOverall":{"number":"PSY 1559","course_id":"12788","cat_num":"156640","1s":"0","2s":"0","3s":"0","4s":"0","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1559","course_id":"12788","cat_num":"156640","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1559","cat_num":"156640","course_id":"12788","year":"2015","term":"2","id":"3249b34decf98e3ac6f165bf48c16d0e","first":" Katherine E","last":"Powers","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '15":{"course_score":{"overall":"4.70","workload":"4.80","difficulty":null,"recommendation":"4.70","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"PSY 1559","course_id":"12788","cat_num":"156640","1s":"0","2s":"0","3s":"0","4s":"0","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1559","course_id":"12788","cat_num":"156640","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1559","cat_num":"156640","course_id":"12788","year":"2014","term":"2","id":"3249b34decf98e3ac6f165bf48c16d0e","first":" Katherine E","last":"Powers","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '15":{"comments":["I really enjoyed this seminar! It was a combination of neuroscience and social psychology, which made it really interesting. Katie is a great professor and super nice which made class enjoyable. Aside from the 2 hour class once a week, we had about 3-4 articles to read each week and reading commentaries due Sunday by 5pm.","Good introductory course to social cognitive neuroscience. Katie is extremely helpful, and uses diverse activities, resources and assignments to cover the contents of the course.","This class was absolutely amazing. The material is fascinating, and Katie does an amazing job of structuring the course so that all of the topics build on each other. If you have any interest in social psych, cognitive psychology, or just want to learn more about how important it is to have a social life, I would highly recommend this class. It is a good deal of work, but I loved every reading we had, and I looked forward to class every week. Really, take this class, it's great.","Very helpful to be able to relate to other courses, readings, or experiences- coming in with questions or comparisons is most engaging"]},"Spring '16":{"comments":["Do the readings! The class revolves around your participation, so be ready to contribute.","This class is simply incredible. The lectures were effective, interactive, and fun. I always left class feeling more insightful and informed about cognitive psychology. Moreover, this is just such a fascinating topic! If you have any interest at all about the social behavior of human beings, take this class.","Katie does a wonderful job teaching the course. This is the best way to learn about the budding field of Social Neuroscience. You'll learn so much about the field and develop your ability to design studies.","This class was a really cool psychology course that integrated the areas of social psychology and cognitive neuroscience. Take this course if you want to get a chance to learn in a seminar style, discuss your ideas with your peers, and develop your scientific analytical skills! Before I took this class, I had difficulty developing my ideas for experiments and asking research questions. Thanks to the practice I got from weekly reading comments, I feel much more comfortable."]},"Spring '17":{"comments":["Katie is a great professor. She really makes you understand the material. The workload is also light enough so you are able to finish all of it in a short amount of time and pay attention to what you are doing.","This class is heavily focused on the brain and its connections to social psychology. It is more brain heavy than most psychology seminars so if that turns you away I would not recommend taking this class. That being said, Katie is amazing and a great teacher so she will help you out quite a bit if you are not comfortable with neurobio content.","This is a GREAT course to really think more deeply about important topics in social psychology, and to see how they connect and come together to form the social brain. The assignments also help you understand the materials more. Would highly recommend.","This class was really enjoyable!  Katie is a fantastic instructor and just very very nice.  The readings were interesting and the workload quite manageable.","Great class! Very chill, but you actually learn a lot through all the assignments. Katie is wonderful and very helpful."]}},"mostRecentQ":{"overall":"4.40","workload":"2.90","difficulty":null,"recommendation":"4.40","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"PSY 1559","course_id":"12788","cat_num":"156640","1s":"0","2s":"0","3s":"0","4s":"0","5s":"4"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1559","course_id":"12788","cat_num":"156640","1s":"1","2s":"2","3s":"1","4s":"0","5s":"0"}},"success":true}