{"scores":{"Spring '12":{"course_score":{"overall":"3.14","workload":"1.79","difficulty":"2.64","recommendation":"3.14","enrollment":"17","response rate":"82.35","QCourseOverall":{"number":"PSY 1901d","course_id":"4297","cat_num":"78347","1s":"0","2s":"4","3s":"4","4s":"6","5s":"0"},"QDifficulty":{"number":"PSY 1901d","course_id":"4297","cat_num":"78347","1s":"0","2s":"5","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1901d","course_id":"4297","cat_num":"78347","1s":"4","2s":"9","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1901d","cat_num":"78347","course_id":"4297","year":"2011","term":"2","id":"3918f1a9b1dac463f83262a97a8e372d","first":"Felix","last":"Warneken","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.29","AccessibleOutsideClass":"4.23","GeneratesEnthusiasm":"3.79","FacilitatesDiscussionEncouragesParticipation":"4.14","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '11":{"course_score":{"overall":"3.39","workload":"1.89","difficulty":"2.33","recommendation":"3.39","enrollment":"22","response rate":"86.36","QCourseOverall":{"number":"PSY 1901d","course_id":"4297","cat_num":"78347","1s":"0","2s":"4","3s":"4","4s":"6","5s":"0"},"QDifficulty":{"number":"PSY 1901d","course_id":"4297","cat_num":"78347","1s":"0","2s":"5","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1901d","course_id":"4297","cat_num":"78347","1s":"4","2s":"9","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1901d","cat_num":"78347","course_id":"4297","year":"2010","term":"2","id":"3918f1a9b1dac463f83262a97a8e372d","first":"Felix","last":"Warneken","InstructorOverall":"3.67","EffectiveLecturesorPresentations":"3.56","AccessibleOutsideClass":"4.07","GeneratesEnthusiasm":"3.35","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"4.40"}]}},"comments":{"Spring '11":{"comments":["There is a good amount of work, but it's manageable. The important thing is that you get to design and run your own experiment! How cool is that?","It's a requirement, so you just have to do it. But for a requirement, it's quite painless. Warneken ran the class well and made each assignment clear.","The statistical analysis portion is more fun if you have data that you are interested in, so pick a topic for study that you would like to know more about even outside of the context of a class requirement.","It's required, so take it. It was a kind of cool opportunity to do your own research, but by nature it kind of drags. Nour was a really helpful fun tf, though.","You may not want to take the class because it's required by the department, but Prof. Warneken makes mundane material really interesting. Also, it is such a great experience to design your own study. Nour is the best tf.","sucks but you have to take it","This course is required, unfortunately...good luck!","Pick a group that you think you will work well with on the research project because it makes all the difference. Also, pick a project with some previous literature on it: groups that just chose an \"interesting\" topic had a really hard time when it came to analyzing the results because there was no evidence before them on how the results should turn out. Most of these groups go no significance in their results. Previous research also makes it easier when writing the Introduction of your research project.","This class will be redundant if you've taken tutorial and ever worked in a lab before","The main focus of the course is designing and carrying out the empirical study. Choose something you're actually interested in. The textbook is not that necessary. Paying attention in lecture may be hard but that's all you really need to do well on the midterm."]},"Spring '12":{"comments":["But you gotta take it","You have to take this course, so, yea. Good luck, and may the odds be ever in your favor. No, seriously.","While taking the class, I thought the material was (too) straightforward\/easy. However, after completing the class and working on other research projects I have realized how valuable the skills are that you learn here. I just wish it was presented in a more engaging manner.","It's useful, but I felt it was a semester-long review of running a research study, which you might have already done in a previous psych class or learned about by working in a lab.","I mean its required  so theres no point in me reccomending anything. I heard they are trying to restructure the course. The whole idea of running your own experiment is fun but labs are so long and pointless and lectures are informative but you can learn it all from the book. Basically its just a course every psych concentrator has to take.","This 1901 is by far the best option. Class lecture is great and Professor Warneken is a great teacher. Assignments were very reasonable, and feedback was helpful. The final paper is written in segments which makes reading period a lot better."]}},"mostRecentQ":{"overall":"3.14","workload":"1.79","difficulty":"2.64","recommendation":"3.14","enrollment":"17","response rate":"82.35","QCourseOverall":{"number":"PSY 1901d","course_id":"4297","cat_num":"78347","1s":"0","2s":"4","3s":"4","4s":"6","5s":"0"},"QDifficulty":{"number":"PSY 1901d","course_id":"4297","cat_num":"78347","1s":"0","2s":"5","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1901d","course_id":"4297","cat_num":"78347","1s":"4","2s":"9","3s":"1","4s":"0","5s":"0"}},"success":true}