{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"1.50","difficulty":"1.70","recommendation":"4.50","enrollment":"14","response rate":"78.57","QCourseOverall":{"number":"PSY 1360","course_id":"11380","cat_num":"11758","1s":"0","2s":"1","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"PSY 1360","course_id":"11380","cat_num":"11758","1s":"5","2s":"4","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1360","course_id":"11380","cat_num":"11758","1s":"7","2s":"3","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1360","cat_num":"11758","course_id":"11380","year":"2013","term":"2","id":"1300138f26505c0c0c0d9a6c64acd835","first":" Nicole M.","last":"Rosa","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '14":{"comments":["This was a very enjoyable course and the work it demanded was little and super interesting. The class discussions are very valuable because of the different perspectives people have, and the education you get from the class is actually invaluable (I learnt so much for my own life). I recommend taking this greatly - it will also well balance out the more demanding classes you have and give you some fun assignments and great discussions to look forward to!","Professor Rosa is phenomenal first of all, if you get the chance to take a course with her - do it. This class was also incredibly interesting and engaging. The students were given the chance to shape the class to cover material related to Traumatic Brain Injury that we were interested in. Each of the assignments was in a different format and didn't ask us to memorize route facts but to explore and learn more and then show that.","Not a super interesting course. Material is very bland.","This is a great course and Professor Rosa did an excellent job of facilitating fascinating discussions and incorporating speakers with first-hand experience.","Good, but a bit hollow. However, Professor Rosa is certainly nice, so definitely a pleasant experience.","EVERYONE AT HARVARD needs to take this class.  The info on brain injury will blow your mind.","This class is a wonderful opportunity to learn more about brain injury and you should absolutely, definitely take it. And write your papers in strict APA","This is a really fascinating class that allows you to gain a varying perspective on the effects of TBIs across many different populations.  The class covers a wide range of topics which enables you to really hone in on specific interests within TBI while still gaining a lot of knowledge about other areas that may be less interesting.  The assignments are fun, and the readings aren't too lengthy.  It's definitely a great class!"]}},"mostRecentQ":{"overall":"4.20","workload":"1.50","difficulty":"1.70","recommendation":"4.50","enrollment":"14","response rate":"78.57","QCourseOverall":{"number":"PSY 1360","course_id":"11380","cat_num":"11758","1s":"0","2s":"1","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"PSY 1360","course_id":"11380","cat_num":"11758","1s":"5","2s":"4","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1360","course_id":"11380","cat_num":"11758","1s":"7","2s":"3","3s":"1","4s":"0","5s":"0"}},"success":true}