{"scores":{"Fall '15":{"course_score":{"overall":"4.70","workload":"4.20","difficulty":null,"recommendation":"4.60","enrollment":"16","response rate":"75.00","QCourseOverall":{"number":"PSY 1553","course_id":"12787","cat_num":"156639","1s":"0","2s":"0","3s":"0","4s":"4","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1553","course_id":"12787","cat_num":"156639","1s":"2","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1553","cat_num":"156639","course_id":"12787","year":"2015","term":"1","id":"3249b34decf98e3ac6f165bf48c16d0e","first":" Katherine E","last":"Powers","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '15":{"course_score":{"overall":"3.90","workload":"3.80","difficulty":null,"recommendation":"4.00","enrollment":"19","response rate":"78.95","QCourseOverall":{"number":"PSY 1553","course_id":"12787","cat_num":"156639","1s":"0","2s":"0","3s":"0","4s":"4","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1553","course_id":"12787","cat_num":"156639","1s":"2","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1553","cat_num":"156639","course_id":"12787","year":"2014","term":"2","id":"3249b34decf98e3ac6f165bf48c16d0e","first":" Katherine E","last":"Powers","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '15":{"comments":["I think this is a great class to learn about many different components and kinds of relationships. Definitely take it if you're interested in social psychology!","This course is fair in amount of work, level of reading, and weekly thought questions. Toward the end of the semester, it got a bit hectic with the pop science critique, poster session, and final essay, but overall its not bad. The course is 100% discussion based, so be prepared to know your readings and to discuss them thoroughly in class.","the topic matter sounds interesting\/relevant, but what it basically amounts to is a re-hash of psych 15 in a less compelling\/substantive format. so much of it is \"discussion\" where people get to just talk about their own stereotypes with little basis in evidence while pretending that they're discussing the readings. it's really fluffy, but also not super conducive to zoning out, so frustrating all around. also felt like grading could be pretty arbitrary which is additional frustration on top of it all.","Class has a lot of busy work, but professor is straightforward about expectations and assignments are more numerous than difficult per se.","That the quality of the course is very dependent on the quality of thought and discussion of your peers. So it could be good or bad based on who takes the course with you","Interesting subject matter. Katherine is super nice and helpful and cool. All the assignments are nicely spread out and there aren't too many, except weekly thought questions were sometimes annoying. Opportunity to come up with a research proposal at the end. Cool class discussions. Learned a lot!","Fun, great teacher, very engaging and a great topic!","The readings are good, but the seminar could be more engaging. The pop science critique was very interesting. The thought questions aren't bad, but the poster presentation and research paper could use more fine-tuning. Katie is a good facilitator, but the seminar discussion could be improved."]},"Fall '15":{"comments":["Great class! Katie is the best and the subject matter is so applicable to everyday life!","One of my favorite psych classes at Harvard. Deeply interesting. The readings are totally manageable. And while the two hour discussion based class intimidated me, it ended up being a wonderful experience and really helped me think through the material.","Definitely the best psych class I've taken at Harvard, would highly recommend.","This course allows students to explore research in a critical aspect of human behavior, namely social interaction.  The studies covered in the course are quite interesting (though there is some overlap in some weeks, particularly when it comes to friendships and romantic relationships).  The course is very much focused on behavioral evidence, though there are some occasional forays into neuroscience.  The workload is manageable and Dr. Powers is a very supportive instructor.","Interesting, relevant, and engaging course. Very manageable too!","If you are interest in knowing more about relationships over the life span and how you may be able to improve your own relationships, I highly recommend this course. Dr. Powers is a wonderful teacher who makes the material very engaging with a variety of activities to really prompt you to apply the concepts you learn to your own experiences.","I would definitely recommend this class to anyone who is interested in social psychology and even more generally in developing a broader understanding of the relationships in their own life."]}},"mostRecentQ":{"overall":"4.70","workload":"4.20","difficulty":null,"recommendation":"4.60","enrollment":"16","response rate":"75.00","QCourseOverall":{"number":"PSY 1553","course_id":"12787","cat_num":"156639","1s":"0","2s":"0","3s":"0","4s":"4","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1553","course_id":"12787","cat_num":"156639","1s":"2","2s":"7","3s":"1","4s":"0","5s":"0"}},"success":true}