{"scores":{"Spring '16":{"course_score":{"overall":"4.40","workload":"2.90","difficulty":null,"recommendation":"4.80","enrollment":"18","response rate":"77.78","QCourseOverall":{"number":"PSY 1858","course_id":"12596","cat_num":"156561","1s":"0","2s":"0","3s":"0","4s":"8","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1858","course_id":"12596","cat_num":"156561","1s":"5","2s":"9","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1858","cat_num":"156561","course_id":"12596","year":"2015","term":"2","id":"e9d8a7b390aabb9d3b869634caa6ebe3","first":" Evan","last":"Kleiman","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '15":{"course_score":{"overall":"4.50","workload":"2.80","difficulty":null,"recommendation":"4.50","enrollment":"19","response rate":"73.68","QCourseOverall":{"number":"PSY 1858","course_id":"12596","cat_num":"156561","1s":"0","2s":"0","3s":"0","4s":"8","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1858","course_id":"12596","cat_num":"156561","1s":"5","2s":"9","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1858","cat_num":"156561","course_id":"12596","year":"2014","term":"2","id":"e9d8a7b390aabb9d3b869634caa6ebe3","first":" Evan","last":"Kleiman","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '15":{"comments":["The professor is really awesome and the topic is very interesting. Be open-minded and take this class in context of everything. Don't get too focused on the topic, think how it connects to everything around you. I think you might gain more that way (although it's a good class without having to do that. I just think it's valuable in life).","Awesome and easy discussion class. Sometimes the discussion meanders off topic and I get bored, but most of the time things are interesting. Assignments are fun and the easy grading really encourages you to devote more effort into putting your thoughts on paper rather than constantly guessing at what the professor actually wants, which is great.","This is a great way to learn about the cross between positive psychology and clinical psychology and also to learn about how any two fields might meet (i.e. how to develop pi-shaped skills). Evan was fantastic in motivating the exciting but limited work done in the field and offered prompt, supportive, and critical feedback on our assignments. Discussion appropriately dominated the class, from sharp analytical critiques of the research to the  face validity and relevance the concepts studied had in our own lives.","Evan is an amazing teacher and the class is a gem! It is very laid back but you learn a ton of great stuff about resilience and positive psychology. Would definitely recommend taking this class I loved it!","THIS CLASS IS AWESOME! Must take if you are looking for psych classes. Evan is awesome, and he really wants to make sure you succeed. I really enjoyed this course, and it is a great way to learn the material without it being too work intensive.","This is a great class that gives you important and practical knowledge. Discussions in class were great and the prof is amazing!","I would highly recommend this class for anyone who has interest in studying well-being, stress, or even how people are impacted differently in their everyday lives.","TAKE THIS!  It is a very low-key, small class that is focused on discussion more than material.  The assignments are all about what you want to get out of the course.  For one, you write 3 good things that happened to you every day for a week, and then you reflect on how you felt during the assignment.  For another, you write a \"gratitude letter\" to someone who impacted your life.  The only other assignments are four short response papers on the readings you found most interesting, and a final paper on a topic of your choice.  Great course, great instructor -- you'll get a lot out of this.","Discussions are not super exciting and we don't always go over lecture. Material is interesting, but readings dull. Professor is chill and really enthusiastic."]},"Spring '16":{"comments":["This is a really chill class. Professor Kleiman is great and nothing about the class is unreasonably difficult. Do the assignments, participate, and you're good. The readings are really easy but still useful, which is great. And the subject matter is pretty interesting if you're into that sort of thing. Overall, great class.","Course is great!","This class is super easy, you learn a lot, and the professor is passionate and caring about the course materials! Win\/win in my book.","I came away from this class with new understandings of stress, resilience, and coping.  This class was not particularly challenging, but all of the readings were interesting and made for interesting conversation.","Very good psych seminar. Prof Kleiman is really nice and a fair grader. Though the class does have the word \"stress\" in the title, I assure you won't feel stressed about it during the semester. There are short assignments almost every week, but very manageable. Most of all, I enjoyed that he tried to teach us mechanisms on how to become happier (gratitude letter, 3 good things).","This is an excellent class. Kleiman is a wonderful, friendly, empathic professor with a very engaging teaching style. The two hours pass very quickly. You don't really need to do all the readings, but if you do you'll remember them because they're excellent. I can't recommend this class highly enough. It's also very easy.","Applicable for a better life!"]}},"mostRecentQ":{"overall":"4.40","workload":"2.90","difficulty":null,"recommendation":"4.80","enrollment":"18","response rate":"77.78","QCourseOverall":{"number":"PSY 1858","course_id":"12596","cat_num":"156561","1s":"0","2s":"0","3s":"0","4s":"8","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"PSY 1858","course_id":"12596","cat_num":"156561","1s":"5","2s":"9","3s":"0","4s":"0","5s":"0"}},"success":true}