{"scores":{"Fall '15":{"course_score":{"overall":"4.20","workload":"4.30","difficulty":null,"recommendation":"4.30","enrollment":"14","response rate":"78.57","QCourseOverall":{"number":"RELIGION 111","course_id":"13920","cat_num":"160969","1s":"0","2s":"0","3s":"1","4s":"7","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RELIGION 111","course_id":"13920","cat_num":"160969","1s":"1","2s":"8","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"RELIGION 111","cat_num":"160969","course_id":"13920","year":"2015","term":"1","id":"68ce6dc08e1513eeab79968be4355336","first":" Mara Gertrude","last":"Block","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Fall '15":{"comments":["Mara is a great professor whose interest in the material really translates to her teaching. The content is very interesting and you will learn to think differently about religion and global health.","This class is definitely a gem with interesting conversation especially in a world where the intersection of religion and global health is being taken more seriously. I would definitely say that this is for people who have any interest in the intersection between global health and culture, not just religion. Definitely recommend this class!","This class really opens up a burgeoning and exciting field at the intersection of religion and global health. Prof. Mara Block is great and quite knowledgable.","The material covered in this course is great. Professor Block is really good at posing intriguing questions and facilitating discussion. Be sure you do the readings because some people didn't and they rarely had anything to contribute to the conversation. For someone who is interested in global health or even medicine in general, it is useful to think about all of the ways in which religion intersects with health and healing, even in ways that are not immediately obvious.","This course is a great crossover between medical ethics issues and work in the humanities. The readings were great, and the coursework is fairly light for a humanities class.","I took the course for my GHHP secondary. Light work (2 essays, a group presentation, final paper) but the reading takes time. Super interesting and relevant subject since typically religion\/belief is not given the necessary attention when it comes to health and healing. First part of the course is slow but it picks up. Take it because the Professor is cool and helpful even if you won't get the best grade.","Great class. It its first year, so the kinks are still being worked out but it is very good and I anticipate it getting better with each year.","Be ready to discuss topics of a wide range. Also, start work on the essays early so that when you receive the feedback in class, you've already started the essay so have something to talk about."]}},"mostRecentQ":{"overall":"4.20","workload":"4.30","difficulty":null,"recommendation":"4.30","enrollment":"14","response rate":"78.57","QCourseOverall":{"number":"RELIGION 111","course_id":"13920","cat_num":"160969","1s":"0","2s":"0","3s":"1","4s":"7","5s":"3"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RELIGION 111","course_id":"13920","cat_num":"160969","1s":"1","2s":"8","3s":"1","4s":"0","5s":"0"}},"success":true}