{"scores":{"Spring '17":{"course_score":{"overall":"4.20","workload":"7.00","difficulty":null,"recommendation":"4.20","enrollment":"7","response rate":"57.14","QCourseOverall":{"number":"RUSS BB","course_id":"13659","cat_num":"159653","1s":"0","2s":"0","3s":"3","4s":"2","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RUSS BB","course_id":"13659","cat_num":"159653","1s":"1","2s":"4","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"RUSS BB","cat_num":"159653","course_id":"13659","year":"2016","term":"2","id":"0050b6bae93e5b87c383127e35db01f7","first":" Steven","last":"Clancy","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '16":{"course_score":{"overall":"4.40","workload":"7.40","difficulty":null,"recommendation":"4.40","enrollment":"17","response rate":"76.47","QCourseOverall":{"number":"RUSS BB","course_id":"13659","cat_num":"159653","1s":"0","2s":"0","3s":"3","4s":"2","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RUSS BB","course_id":"13659","cat_num":"159653","1s":"1","2s":"4","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"RUSS BB","cat_num":"159653","course_id":"13659","year":"2015","term":"2","id":"1cfeebd45324a9126a47e704afebd8a3","first":" Veronika A.","last":"Egorova","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"4.90"}]}},"comments":{"Spring '16":{"comments":["Your Russian will improve substantially. As with every language course, this is going to involve a lot of tedium. But the course is by and large well structured (with some kind of inane and useless projects at times) and I got a lot out of it. Also, we had wonderful TFs who really made the course enjoyable for me.","the workload can get overwhelming, but teaching staff is generally understanding if you have to turn something in late","Check who is teaching the class before enrolling","Take this course! You will learn Russian astonishingly quickly and have fun doing it.","I've already recommended this course to many. It is very rich -- full of new and useful vocabulary, full of cultural insights, and you can take your own initiative to delve even further. If taken seriously, students could travel to Russia afterwards.","The Russian program at Harvard is amazing. I'm from Yale so I am able to compare. The teaching team has great coordination, the supplementary materials (the documentary film born in the USSR) and Pushkin's short story are well chosen and extremely helpful for students to learn about the Soviet-era and Russian culture\/history, and the undergrads also have an extra project to do which I think is a great idea. If I had more time I would have loved to participate, but as it is I had a lot of fun in Russian and also learned a whole lot. Thanks teachers!! : )","This course is an absolutely wonderful, absolutely challenging experience in language learning. I found that each day's homework assignment, if one wants to really solidify and retain all of the knowledge in a given night, could take anywhere from an hour to three hours to really absorb and complete. \r\nThat being said, one can get by with a focus on the essentials, and sometimes learning those essentials narrowly but extremely well will serve you better in regard to the course structure. In the long-term, you will recognize how valuable it is to go in-depth if you want to actually be able to use the language. In that sense, the approach you take could really result in two very different experiences. \r\nThe staff is absolutely wonderful, and the Slavic department is always full of welcoming, warm, and always-helpful faculty and teaching staff.","I would only take this class if you are willing to commit to doing a lot of repetitive homework","Great and caring teaching staff, but a lot of time and so may be hard to add on.","Maria and Ania (and Veronica) are so wonderful - they're all incredibly passionate and put in a lot of time and effort to make sure their students get the most out of the course."]}},"mostRecentQ":{"overall":"4.20","workload":"7.00","difficulty":null,"recommendation":"4.20","enrollment":"7","response rate":"57.14","QCourseOverall":{"number":"RUSS BB","course_id":"13659","cat_num":"159653","1s":"0","2s":"0","3s":"3","4s":"2","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"RUSS BB","course_id":"13659","cat_num":"159653","1s":"1","2s":"4","3s":"8","4s":"0","5s":"0"}},"success":true}