{"scores":{"Spring '16":{"course_score":{"overall":"4.90","workload":"5.00","difficulty":null,"recommendation":"5.00","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"SAS 131","course_id":"13452","cat_num":"160721","1s":"0","2s":"0","3s":"0","4s":"1","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SAS 131","course_id":"13452","cat_num":"160721","1s":"1","2s":"8","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SAS 131","cat_num":"160721","course_id":"13452","year":"2015","term":"2","id":"9de41e4607f1c140caf5b9c2defbbd2e","first":" Sunil","last":"Amrith","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.40"}]}},"comments":{"Spring '16":{"comments":["This is an excellent class if you're looking to understand some of the themes in South Asian history and migration. The teaching staff are incredibly helpful and open, and there is flexibility to tailor your projects and papers based on your own interests. Highly recommend!","This is a course that introduces you to South Asia beyond the traditional histories that have become all too familiar. Events like Partition are discussed not only in regional context but in a larger global context. Moreover, South Asia is shown to be a region intricately connected to other regions of the world including North America, the Gulf states, Southeast Asia, Britain through various connections (i.e. colonialism, anti colonial movements, migration, labor, and education). For those who want to think through South Asia on a scale that doesn't render it a monolithic, insular region, or who have taken other courses on South Asia that detail more traditional histories, I would highly recommend this course.","I really enjoyed this course and that's partly because the teaching staff was phenomenal and my classmates were fantastic. If you know nothing about South Asia like me (and even if you do), check this class out. Professor Amrith is extremely knowledgeable, approachable, and very enthusiastic about the topic (definitely stop by office hours). This year the course consisted of three assignments: timeline\/map, group digital project, and final essay. Each assignment allows you the opportunity to explore, and you can work on just about any topic (after talking with teaching staff of course). I really enjoyed the class, and am walking away with new insight on South Asia.","A fantastic way to gain exposure to an important and interesting region of the world. Professor Amrith's lectures are engaging and open for discussion; the global focus of the class is also refreshing.","Professor Amrith is a delight -- committed to an thought-provoking class at all times. The subject is material is broad enough for everyone's interests, but tailored enough to give a sense of understanding by the end of the course.","This course is a great introduction to the global history of South Asia. Professor Amrith is an expert in the field and also very approachable. I would definitely recommend this course for anyone interested in the topic."]}},"mostRecentQ":{"overall":"4.90","workload":"5.00","difficulty":null,"recommendation":"5.00","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"SAS 131","course_id":"13452","cat_num":"160721","1s":"0","2s":"0","3s":"0","4s":"1","5s":"12"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SAS 131","course_id":"13452","cat_num":"160721","1s":"1","2s":"8","3s":"2","4s":"0","5s":"0"}},"success":true}