{"scores":{"Fall '10":{"course_score":{"overall":"4.27","workload":"1.53","difficulty":"2.20","recommendation":"4.67","enrollment":"17","response rate":"88.24","QCourseOverall":{"number":"SCI-PHYUNV 28","course_id":"2028","cat_num":"5565","1s":"1","2s":"0","3s":"2","4s":"3","5s":"9"},"QDifficulty":{"number":"SCI-PHYUNV 28","course_id":"2028","cat_num":"5565","1s":"3","2s":"6","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"SCI-PHYUNV 28","course_id":"2028","cat_num":"5565","1s":"8","2s":"6","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SCI-PHYUNV 28","cat_num":"5565","course_id":"2028","year":"2010","term":"1","id":"2cad8e6e404ab4062b2845d6509fcfc2","first":"Mara","last":"Prentiss","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.47","AccessibleOutsideClass":"4.71","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.46","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"3.67"},{"number":"SCI-PHYUNV 28","cat_num":"5565","course_id":"2028","year":"2010","term":"1","id":"d1a57eaebcba23cb3664576b45d07c53","first":"George M.","last":"Whitesides","InstructorOverall":"3.93","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"3.46","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.14","GivesUsefulFeedback":"3.40","ReturnsAssignmentsinTimelyFashion":"3.00"}]}},"comments":{"Fall '10":{"comments":["I would highly recommend that you make an effort to get to know Professors Prentiss and Whitesides personally. They are wonderful people, and they would be more than happy to get to know you, too.","Great class.  Both professors were really cool.  The class provided just enough scientific, background so that we could have great discussions about policy and scientific\/economic questions.","Incredibly pain-free way to get your SPU requirement out of the way. I have 0 math or physics skills, and this class was a breeze in that sense. But you still learn things, particularly with Prof. Prentiss lectures. She is phenomenal at breaking large concepts down to very manageable bits for those of us with no science background.\r\n\r\nDownside are the \"lectures\" that Whitesides, the co-Prof, leads. These actually disrupted the class, and didn't teach us much. He also has a tremendous ego, and says outrages things, a sampling of this is below:\r\n\r\n\"Everybody is named the same thing in those cultures\"\r\n\"How do you get healthcare to the bushes where you have 17 year olds walking about with an AK-47\"\r\n\"China has a deep seated problem: it's called Confucianism\" \r\n\"I'm a simple capitalist\"","This was far and away the best class at Harvard I have taken. Lectures and assignments were logical and fair, and I left the course with a great deal more knowledge and understanding of the role of nanotechnology in my daily life. The access to world leaders, Professor George Whitesides and Professor Mara Prentiss, was unparalleled.","Prof. Prentiss and Prof. Whitesides are leaders in their field and provide insight into their fields. As a non-science concentrator, I am very happy and thankful to have taken this class. I learned a lot about information technology, alternative energy options, healthcare, and how computers work. The requirements are not difficult but helpful to your learning.","If you would want the easiest class of your life; take this class but beware that you may be killed by boredom.","This class is easily the best I've taken at Harvard thus far. You will learn a great amount of information while not being overwhelmed with work. The class is very focused on teaching you, not judging you and grading you. This is the type of class that makes you feel good about waking up and attending.","This class is a great way to learn more about the small things in our world. It gave me a new perspective about the way the world works.","It is a painless was to fulfill a core and extremely interesting for someone who knows little about technology.","this is probably the best gen ed course i have ever taken at Harvard. Seriously, take this course even if you have already fulfilled SPU!!","Great science class for students without science background","This class is very applicable to real life situations."]}},"mostRecentQ":{"overall":"4.27","workload":"1.53","difficulty":"2.20","recommendation":"4.67","enrollment":"17","response rate":"88.24","QCourseOverall":{"number":"SCI-PHYUNV 28","course_id":"2028","cat_num":"5565","1s":"1","2s":"0","3s":"2","4s":"3","5s":"9"},"QDifficulty":{"number":"SCI-PHYUNV 28","course_id":"2028","cat_num":"5565","1s":"3","2s":"6","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"SCI-PHYUNV 28","course_id":"2028","cat_num":"5565","1s":"8","2s":"6","3s":"1","4s":"0","5s":"0"}},"success":true}