{"scores":{"Spring '13":{"course_score":{"overall":"3.39","workload":"1.68","difficulty":"3.00","recommendation":"3.53","enrollment":"23","response rate":"82.61","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"SCRB 156","cat_num":"48086","course_id":"5330","year":"2012","term":"2","id":"2a26ee1728915af632b6e933e4d4b114","first":" John L","last":"Rinn","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.22","AccessibleOutsideClass":"3.73","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"3.94","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"4.00"},{"number":"SCRB 156","cat_num":"48086","course_id":"5330","year":"2012","term":"2","id":"fcbc00c43acc3c71cd8e6a537a72c06a","first":" Alexander","last":"Meissner","InstructorOverall":"3.83","EffectiveLecturesorPresentations":"3.89","AccessibleOutsideClass":"3.57","GeneratesEnthusiasm":"3.72","FacilitatesDiscussionEncouragesParticipation":"3.71","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '13":{"comments":["Great topic, moves a little slowly.","Although it had good intentions, SCRB 156 ended up being one of the worst classes I've taken. Granted, the material itself was interesting, but the teaching staff was incredibly hands-off. There were perhaps an equal number or maybe more grad students enrolled in the class than undergrads, and I think the attitude of the teaching staff reflected that. Even as an advanced course, I expected the staff to be more understanding when clarification was needed or questions arose. I think that with more organization, many of these shortcomings could be attenuated.","This is a good course for anyone who wants to learn about both epigenetics and RNA (which does a lot more than code for proteins!). The two parts of the class feel a bit disconnected and it was a little disorganized, but that's probably because the class is new--next year will probably be even better.","This class isn't really fun or exciting, but you do learn a lot of cool stuff.","The course lacked some structure, which is reasonable considering this is the first year that SCRB 155 and SCRB 157 are integrated.  But it was definitely interesting to learn about all the functions of noncoding RNA - RNA is much cooler than just being an intermediate between DNA and protein!","A very interesting and current topic. Stay alert and take good notes during lecture or you will be confused later. Form a group for psets!","Take it!","This class is a new class, and was quite unorganized this year. It would benefit greatly from offering a section. Much of the material taught in class will likely require supplementation from independent research on papers. There are few to no resources in terms of studying and going over lecture material other than the notes that you took during class. Rinn does not post lecture notes so all you have to study from for the entire course are the notes you took during class. Over half the class is grad students, and it often feels that the professors treat the entire class as such. \r\n\r\nOne very cool thing about this class is that the material is extremely new, and the things you learn in class refer directly to papers that have been published in only the recent years. When you go online and google the topics that you go over in class, you will be able to understand very quickly the newest discoveries. \r\n\r\nIf you want a stressfree SCRB elective, I wouldn't recommend this class. The grading is not particularly harsh, but it is very difficult to have a firm understanding of everything taught in class.","If you want an easy \"A\" for memorizing and regurgitating information then consider taking this class, otherwise don't.","If you are interested in epigenetics you should take it. No questions. Not the easiest course to take but it definitely exposes you to the real epigenetics world."]}},"mostRecentQ":{"overall":"3.39","workload":"1.68","difficulty":"3.00","recommendation":"3.53","enrollment":"23","response rate":"82.61","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}