{"scores":{"Spring '15":{"course_score":{"overall":"4.60","workload":"7.10","difficulty":null,"recommendation":"4.70","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"SOC-STD 98HP","course_id":"12622","cat_num":"156342","1s":"0","2s":"0","3s":"1","4s":"2","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SOC-STD 98HP","course_id":"12622","cat_num":"156342","1s":"3","2s":"0","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-STD 98HP","cat_num":"156342","course_id":"12622","year":"2014","term":"2","id":"0e4608ffbdcd899188fa9e104646dc3a","first":" Daniel","last":"Ziblatt","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '15":{"comments":["Professor Ziblatt is a great teacher and assigns interesting material. Being in seminar with him was a fantastic experience, as he is willing to admit when he doesn't understand and it makes for a really cool environment where students are not afraid to answer. I thoroughly enjoyed listening to what he had to say and wish I could have heard more from him in the long run.","If you are fascinated by theories of democracy and are a history buff (especially European history), this is the perfect class for you. If you don't like history as much you may want to shy away.","Take this class! Discussions were always interesting, the readings are great, the topic is broadly applicable and flexible for final papers, and, most importantly, Professor Ziblatt is a really good teacher. Do the readings and start the paper early!","Daniel is awesome! He leads the class very effectively and introduces various activities to do each week to make the tutorial meetings more dynamic instead of just a two hour conversation. I knew nothing about this subject before taking the class and it was very manageable and just overall an interesting class to take (although not related my area of interest).","An exceptional class. If you have any interest in comparative politics, you should take this class.","Very interesting topic, and well selected readings. Professor Ziblatt is great at leading class discussions and very helpful with topic selection and methods for the paper. However, it feels much more like a gov course than a social studies course - their isn't much effort to connect the material to the theory from SS 10, and it isn't that interdisciplinary (basically pure political science)."]}},"mostRecentQ":{"overall":"4.60","workload":"7.10","difficulty":null,"recommendation":"4.70","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"SOC-STD 98HP","course_id":"12622","cat_num":"156342","1s":"0","2s":"0","3s":"1","4s":"2","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SOC-STD 98HP","course_id":"12622","cat_num":"156342","1s":"3","2s":"0","3s":"2","4s":"0","5s":"0"}},"success":true}