{"scores":{"Spring '13":{"course_score":{"overall":"3.56","workload":"2.78","difficulty":"4.00","recommendation":"3.56","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"SOC-STD 98np","course_id":"4618","cat_num":"62175","1s":"0","2s":"0","3s":"6","4s":"1","5s":"2"},"QDifficulty":{"number":"SOC-STD 98np","course_id":"4618","cat_num":"62175","1s":"0","2s":"0","3s":"2","4s":"5","5s":"2"},"QWorkload":{"number":"SOC-STD 98np","course_id":"4618","cat_num":"62175","1s":"0","2s":"4","3s":"3","4s":"2","5s":"0"}},"instructor_scores":[{"number":"SOC-STD 98np","cat_num":"62175","course_id":"4618","year":"2012","term":"2","id":"805e00632814287031826fb121331c38","first":" Christopher","last":"Meckstroth","InstructorOverall":"3.89","EffectiveLecturesorPresentations":"3.78","AccessibleOutsideClass":"3.89","GeneratesEnthusiasm":"3.56","FacilitatesDiscussionEncouragesParticipation":"3.43","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.86"}]}},"comments":{"Spring '13":{"comments":["This is a brutal theory course. Be prepared to be confused, be prepared to spend a lot of time rereading paragraphs. Be prepared to not be able to immediately apply the theory to anything, but being able to apply the theory to everything.  You read some really important thinkers but unless the class did a thorough job reading and comprehending everything, tutorial will be frustrating and you won't get to main purpose of each of the writers because Chris is unfortunately not the best at getting people to see things clearly. If you are unwilling to care a lot about this class, do everyone a favor and don't take it, you ruin section.","The readings are challenging but very interesting.","This class was usually great. Chris is an awesome teacher. However, some readings were better than others, and discussions were sometimes slow.","If you're really enthusiastic about social theory, you will enjoy aspects of this course. The discussions weren't as vibrant as SS10, which really disappointed me.","This course isn't really \"about\" anything, so you don't get too much out of it beyond the authors you choose to really delve into on your own. So it really just makes sense to pick them out from the syllabus and go read them independently.","Great readings, section can be a little frustrating, but most discussion tutorials in theory will be as well.","Great material. Great feedback on your assignments and thoughts. Chris is obviously very learned and is a talented, comprehensive reader, thinker and feedback-giver. This class can tend to attract some pompous individuals though, that can lead to an awkward class dynamic - something that you should be aware of when choosing what type of atmosphere and environment you would like to be in for your junior tutorial."]}},"mostRecentQ":{"overall":"3.56","workload":"2.78","difficulty":"4.00","recommendation":"3.56","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"SOC-STD 98np","course_id":"4618","cat_num":"62175","1s":"0","2s":"0","3s":"6","4s":"1","5s":"2"},"QDifficulty":{"number":"SOC-STD 98np","course_id":"4618","cat_num":"62175","1s":"0","2s":"0","3s":"2","4s":"5","5s":"2"},"QWorkload":{"number":"SOC-STD 98np","course_id":"4618","cat_num":"62175","1s":"0","2s":"4","3s":"3","4s":"2","5s":"0"}},"success":true}