{"scores":{"Spring '17":{"course_score":{"overall":"5.00","workload":"7.50","difficulty":null,"recommendation":"4.50","enrollment":"2","response rate":"100.00","QCourseOverall":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"1"},"QDifficulty":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"2","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"0"}},"instructor_scores":[{"number":"SOC-STD 98ND","cat_num":"128057","course_id":"4614","year":"2016","term":"2","id":"0c77724d216841f9f21dbfc5bfc2b3e2","first":" Jonathan M.","last":"Hansen","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '14":{"course_score":{"overall":"4.50","workload":"9.99","difficulty":null,"recommendation":"4.50","enrollment":"3","response rate":"66.67","QCourseOverall":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"1"},"QDifficulty":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"2","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"0"}},"instructor_scores":[{"number":"SOC-STD 98nd","cat_num":"25731","course_id":"4614","year":"2014","term":"1","id":"0c77724d216841f9f21dbfc5bfc2b3e2","first":" Jonathan M.","last":"Hansen","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '13":{"course_score":{"overall":"2.80","workload":"2.70","difficulty":"3.20","recommendation":"2.80","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"1"},"QDifficulty":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"2","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"0"}},"instructor_scores":[{"number":"SOC-STD 98nd","cat_num":"25731","course_id":"4614","year":"2013","term":"1","id":"0c77724d216841f9f21dbfc5bfc2b3e2","first":" Jonathan M.","last":"Hansen","InstructorOverall":"2.60","EffectiveLecturesorPresentations":"2.80","AccessibleOutsideClass":"3.10","GeneratesEnthusiasm":"3.40","FacilitatesDiscussionEncouragesParticipation":"2.80","GivesUsefulFeedback":"2.30","ReturnsAssignmentsinTimelyFashion":"3.80"}]},"Fall '12":{"course_score":{"overall":"4.00","workload":"2.70","difficulty":"3.70","recommendation":"3.80","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"1"},"QDifficulty":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"2","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"0"}},"instructor_scores":[{"number":"SOC-STD 98nd","cat_num":"25731","course_id":"4614","year":"2012","term":"1","id":"0c77724d216841f9f21dbfc5bfc2b3e2","first":"Jonathan M.","last":"Hansen","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.89","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"3.56","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '12":{"course_score":{"overall":"4.71","workload":"2.83","difficulty":"3.50","recommendation":"4.67","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"1"},"QDifficulty":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"2","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"0"}},"instructor_scores":[{"number":"SOC-STD 98nd","cat_num":"25731","course_id":"4614","year":"2011","term":"2","id":"0c77724d216841f9f21dbfc5bfc2b3e2","first":"Jonathan M.","last":"Hansen","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.33","AccessibleOutsideClass":"4.83","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '12":{"comments":["The class is really interesting and is a great way to consider these issues from a different perspective. I would highly recommend it.","The class was interesting and the topics never failed to complicate our knowledge of the process of reconciliation. But it was difficult to know what exactly we needed to read because the professor what change the readings far too often. Also because the topic was so complicated it was hard to find solid conclusions which was frustrating.","This course is so interesting and very different compared to many other social studies tutorials. The reading amount is high but very interesting, and you learn a lot about methods. which is really helpful in writing the junior paper.","Take this!! Professor Hansen is awesome and you will come away with a much richer understanding of how mass violence grips countries and how they can become to recover. The readings are interesting and the class discussions are fun. The final paper is difficult because it requires you to really narrow in on a specific topic but this class really makes you start thinking about it and planning for it early on in the semester. By the end, it will feel very rewarding!","Interesting course overall, since Professor Hansen generates a lot of enthusiasm for the course material and it really comes through in our discussions. Given that my thesis topic won't really be related to mass violence and reconciliation, I was hoping to take this course more for learning methodology and research skills-- however, I felt this aspect of this course was lacking. There wasn't as much one-on-one time with Professor Hansen to give you guidance on figuring out how to narrow down the research question and discuss specific do's and dont's before delving in.","In this tutorial, I learned a lot that I didn't know before, especially about Rwanda. I thought some of the material was interesting, but I also encourage you to choose this tutorial only if you are interested in mass violence and issues associated with it because otherwise you will find it difficult to locate yourself within the material. I really liked the structure and flexibility of the paper-writing process. There were clear deadlines to be met, with proposals and a research prospectus leading up to the final paper, which helped to ensure that you don't wait until the last minute to work on your paper. However, Hansen was also flexible with the paper topics and allowed people to pursue any topic that interested them, even if it did not directly relate to mass violence."]},"Fall '13":{"comments":["This class is great for anyone even just moderately interested in mass violence and reconciliation. Like all junior tutorials, the class is focused on the final research paper, but Professor Hansen really makes an effort to guide students through the research paper process.","The section leader was a great resource, but sometimes he was too blunt and rude, which made the discussion less conversational. Students were also very concerned with how he was evaluating everything they said, so that made the atmosphere less comfortable.","Jonah can be incredibly rude to students and is often insensitive to their personal backgrounds to the the comments they make in class. He is particularly self-indulgent and likes to pick on people whose views differ from his own. He seems to randomly select people to hold grudges against at the beginning of the semester. He is also a very harsh grader who bases his paper grades almost solely on his preference of writing style and will give you no useful feedback about how to improve your use and analysis of historical evidence.","This class in theory is amazing and the reading and discussion is really quite wonderful. However, the professor is the most awkward facilitator I have encountered in a long time and at times slightly offensive. How nitpicky he is is highly counterproductive to the flow of ideas and discourse both in class as well as on papers. His insistence that we stick to a certain format in writing, especially on introductions, is amazingly formulaic and restrictive.","The name and content of this course are a great draw. I, personally, was very interested in mass violence and reconciliation and was excited about this course. The syllabus was very interesting and covered events that I would not have immediately thought of as within this field of study. Opportunities to consider new types of violence and events were particularly interesting and helped to expand my understanding of violence and reconciliation. However, several areas of the course left me unlikely to recommend this to my peers. The feedback was certainly sub-par, focusing more on small errors in delivery (grammatical errors or a sentence structure that was not to the professor's liking) than expanding or challenging my ideas about course material. Discussion was incredibly uncomfortable. Students did not feel as if they had space to discuss their thoughts without being challenged in a manner that was fairly aggressive and uncomfortable. If you cannot make this course your absolute priority (meaning writing EXCEPTIONAL response papers each week, doing every word of reading, attending office hours constantly, etc.) and accept that you will likely not receive helpful or appropriate feedback despite your efforts, look into another tutorial. This one will require extreme confidence in the worth of your own work as you will be your own source of encouragement and motivation."]},"Fall '14":{"comments":["This class doesn't hold all of the answers to problems of mass violence, but it asks all the right questions. I appreciated how this class never shied away from the really hard mental work that goes with talking about mass violence, memory, or reconciliation. I'm not sure that I am coming away from this class feeling \"settled,\" but I certainly feel inspired to engage with this subject matter even further.","This is a great class for discussing memory of violence. If at all interested in how countries become nations following periods of mass violence, this course is a really good choice."]},"Spring '17":{"comments":["This class provides an incredible opportunity to delve deeply into the complexities of truth, justice, and memory that arise following mass violence. If you are interested in those themes, and ready to engage with difficult material, then you should definitely take this class.","Jona is a wonderful, smart, and energetic human being. Lots of freedom to follow your own research interest. Don't worry about why he chooses some case studies but not others. Everything makes sense by the end."]}},"mostRecentQ":{"overall":"5.00","workload":"7.50","difficulty":null,"recommendation":"4.50","enrollment":"2","response rate":"100.00","QCourseOverall":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"1"},"QDifficulty":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"2","3s":"3","4s":"4","5s":"0"},"QWorkload":{"number":"SOC-STD 98nd","course_id":"4614","cat_num":"25731","1s":"0","2s":"0","3s":"0","4s":"1","5s":"0"}},"success":true}