{"scores":{"Fall '11":{"course_score":{"overall":"4.18","workload":"2.18","difficulty":"2.45","recommendation":"4.18","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"SOC-WORLD 28","course_id":"2043","cat_num":"47498","1s":"1","2s":"0","3s":"1","4s":"3","5s":"6"},"QDifficulty":{"number":"SOC-WORLD 28","course_id":"2043","cat_num":"47498","1s":"1","2s":"4","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 28","course_id":"2043","cat_num":"47498","1s":"1","2s":"7","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 28","cat_num":"47498","course_id":"2043","year":"2011","term":"1","id":"9ac7035fefcd39b20b126d7e628d39aa","first":"Kelly","last":"O'Neill","InstructorOverall":"4.64","EffectiveLecturesorPresentations":"4.64","AccessibleOutsideClass":"4.64","GeneratesEnthusiasm":"4.55","FacilitatesDiscussionEncouragesParticipation":"4.22","GivesUsefulFeedback":"4.62","ReturnsAssignmentsinTimelyFashion":"4.57"}]}},"comments":{"Fall '11":{"comments":["Fantastic course, a lot of interesting material. If you are willing to put the work in, this will be one of the most rewarding classes you will take at Harvard.","Prof. O'Neill is fantastic, but I would hesitate to recommend this class unless you're really interested in Russia.  There is a lot of \"busy-work\" type projects but some of them end up being fun and I feel I have a better understanding of some of the resources on the web because of this class.  However, they were really annoying to do sometimes and took a while to figure out.  Prof O'Neill and Greg were always ready to help though.","This is a really interesting class on russian history, but has a lot of homework and time locked up in the psets. However, the final project is pretty open ended and there isnt a midterm of final!","To be upfront: I did not like this class. However, the idea of it - that history is recorded in many ways, not solely the textual, and that a historian might be better served by making an argument in some non-traditional way - is fascinating and important, and is what originally drew me to the class. I think the class was a failure this year, because we did not spend enough time (I think about one lecture in total) discussing how to create effective non-verbal arguments. However, Professor O'Neill was clearly enthusiastic about the class and about making it succeed, and I think most of us expressed similar dissatisfaction with how it was conducted. Hopefully the problems will be addressed next time the course is offered. I would recommend shopping this class and seeing if these issues are addressed. If they are, the course could be incredible.","Great class.  Often very boring, but it's pretty straightforward, Prof is great, painless, so if you have any interest or can put up with learning about a sorta cool topic (Russia), do it","Great professor and teaching fellow, interesting time period and region being studied, learning new skills and developing analysis skills. Best gen-ed surprise ever, I would have taken it as an elective!","fun class. fun final project. kelly and greg were great.","a really different kind of history class! Loved the assignments, the lectures were interesting, and the class really left me with new ways of thinking about and visualizing historical documents."]}},"mostRecentQ":{"overall":"4.18","workload":"2.18","difficulty":"2.45","recommendation":"4.18","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"SOC-WORLD 28","course_id":"2043","cat_num":"47498","1s":"1","2s":"0","3s":"1","4s":"3","5s":"6"},"QDifficulty":{"number":"SOC-WORLD 28","course_id":"2043","cat_num":"47498","1s":"1","2s":"4","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 28","course_id":"2043","cat_num":"47498","1s":"1","2s":"7","3s":"3","4s":"0","5s":"0"}},"success":true}