{"scores":{"Fall '15":{"course_score":{"overall":"4.00","workload":"8.70","difficulty":null,"recommendation":"4.40","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"SOC-STD 98NA","course_id":"12066","cat_num":"127818","1s":"0","2s":"0","3s":"1","4s":"3","5s":"1"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SOC-STD 98NA","course_id":"12066","cat_num":"127818","1s":"0","2s":"2","3s":"0","4s":"0","5s":"1"}},"instructor_scores":[{"number":"SOC-STD 98NA","cat_num":"127818","course_id":"12066","year":"2015","term":"1","id":"604799b1c7f879e23e28875987b5c210","first":" Matthew Stephen","last":"Desmond","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"2.50","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"2.20","ReturnsAssignmentsinTimelyFashion":"2.00"}]},"Fall '14":{"course_score":{"overall":"5.00","workload":"9.00","difficulty":null,"recommendation":"5.00","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"SOC-STD 98NA","course_id":"12066","cat_num":"127818","1s":"0","2s":"0","3s":"1","4s":"3","5s":"1"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SOC-STD 98NA","course_id":"12066","cat_num":"127818","1s":"0","2s":"2","3s":"0","4s":"0","5s":"1"}},"instructor_scores":[{"number":"SOC-STD 98na","cat_num":"49539","course_id":"12066","year":"2014","term":"1","id":"604799b1c7f879e23e28875987b5c210","first":" Matthew Stephen","last":"Desmond","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '14":{"comments":["Outstanding. Readings are fascinating every week, discussions are smart and engaging, and projects are a valuable experience. Matt's enthusiasm for ethnography and passion for rigorous work around poverty is infections.","This course was thought-provoking and challenging. Readings each week were consistently fascinating, and gave us a chance to not only learn about ethnography\/methods, but also to wrestle with a lot of really weighty issues (poverty, homelessness, drug abuse, eviction). Thankfully, class discussion was engaging and thoughtful, and Matt's perspective and field experience was illuminating. Project is a big time commitment, but don't let that deter you.\nHighly recommended.","This course takes a lot of time, but it is well worth it if you're up for it. Try to come into the course with a concrete research question and field site or contacts\/connections to field site already in mind. The readings are fascinating; take the time to read thoroughly.","This is the best class I've taken at Harvard. I'd describe it as double the work but double the fun, and I'm serious. From a materials standpoint, the readings give you incredible insight into urban poverty in America. Matt will challenge but also encourage you in the development of your research. Do invest the time in your fieldwork; the more hours you log, the more you'll get out of your research. I felt constantly challenged and engaged, but I also felt empowered to do ethnography. Overall, this tutorial was extremely formative in shaping how I want to proceed with my Social Studies thesis and my eventual methodology.","This class will push you to ask the difficult social questions at the core of the social studies syllabus. But it will do so in a way that cuts past removed academic discourse to a level of intimacy that can be difficult to handle. It's a hugely rewarding experience, but an intellectual, emotional and deeply personal challenge.","Looked forward to the class every week. Read incredible books - worked on incredible projects. Loved that it kind of operated like a lab..everyone was working on different things and we would all sort of update each other on the status of our projects each week. The experience of pushing yourself to get out there and work on an ethnographic project like this is really invaluable - totally take the class."]},"Fall '15":{"comments":["This class forces you to dive into poverty in America and witness it and interact with it first hand. It has been an incredibly valuable experience for me.","This is such a great opportunity to go do your own ethnographic research. I was so nervous about finding a topic and about talking to people, but I did it and it was a great learning experience. The camaraderie is also great. Everyone was on the same boat and it was a super supportive environment. So basically you read a book a week, go to your field site for at least 5 hours a week (you can skip one week and do more on another week if you have an exam or something) but I usually went to my site at least twice a week for 5+ hours, and turn in field notes every other week. In class, you talk about your work and about the books. PUSH YOURSELF. TAKE THIS CLASS. Desmond is great because of his knowledge, experience, and empathy, even if he is super busy and doesn't really give feedback.","Not a lot of direction for the class, so go to office hours. Overall, great course & great people.","Excellent discussions, the field work component is a real pain, and there doesn't always feel like there is guidance."]}},"mostRecentQ":{"overall":"4.00","workload":"8.70","difficulty":null,"recommendation":"4.40","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"SOC-STD 98NA","course_id":"12066","cat_num":"127818","1s":"0","2s":"0","3s":"1","4s":"3","5s":"1"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SOC-STD 98NA","course_id":"12066","cat_num":"127818","1s":"0","2s":"2","3s":"0","4s":"0","5s":"1"}},"success":true}