{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"3.40","difficulty":null,"recommendation":"4.90","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"SPANSH 59H","course_id":"12912","cat_num":"159938","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SPANSH 59H","course_id":"12912","cat_num":"159938","1s":"0","2s":"2","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SPANSH 59H","cat_num":"159938","course_id":"12912","year":"2016","term":"2","id":"0897c041f2b686516565ada9416945ee","first":" Maria Luisa","last":"Parra","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '16":{"course_score":{"overall":"4.70","workload":"5.70","difficulty":null,"recommendation":"5.00","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"SPANSH 59H","course_id":"12912","cat_num":"159938","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SPANSH 59H","course_id":"12912","cat_num":"159938","1s":"0","2s":"2","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SPANSH 59H","cat_num":"159938","course_id":"12912","year":"2015","term":"2","id":"0897c041f2b686516565ada9416945ee","first":" Maria Luisa","last":"Parra","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '16":{"comments":["TAKE THIS CLASS! It's been one of the best classes I've taken at Harvard.","Take this class if you ever have the chance! If you're like me and grew up speaking Spanish but don't feel confident in academic settings using the language, this class is for you. My ability to communicate at an academic level, read technical material, and engage with the language grew tremendously during the semester with this course. Prof. Parra is great, and you'd be lucky to take this class.","Excellent course! It's pretty chill and you will learn so much! It's also just a super fun course in general, lets you explore what it really means to be latinx in a class full of people that are in fact woke."]},"Spring '17":{"comments":["This is a wonderful class and has a wonderful professor! You will improve your Spanish by learning how to use proper accent marks and gaining a richer vocabulary! If you want a fun, stress-free class where you will still learn, take this!!","She is absolutely amazing! She creates an environment where the students are comfortable speaking at their varying degree of skill. The topics she covers are very interesting and the journalism\/community service community it not a hassle. You get to explore communities outside of the Harvard Bubble while helping people with whatever project they are currently working on. She helps each student progress greatly in both speech\/written form. Overall, she becomes like a mom away from home!","Participate fully because you get out what you put in! Push yourself to better your spanish","You learn a lot about how to improve your Spanish through this course","Parra is an excellent teacher! If you want to learn Spanish in a more formal context while discussing issues related to the Latino community in a fun and engaging manner, take this course.","I loved this class!!! Profe. Parra is the absolute sweetest and she is invested in the class. The topics are interesting and the work you do outside of class is meaningful as well.","Prof. Parra is an amazing and knowledgeable instructor! She made it fun and easy to really improve your spanish. The class was filled with really great people.","This course is amazing, if you are on the fence about it, take it.","Take this class!  It was my favorite class this semester and I am considering RLL as a secondary! The readings and movie material are incredibly relevant to Latinx life. I also found the service aspect of the class to be rewarding and will continue to work with the same organization I volunteered with this semester. The journalism aspect is also a lot of fun, Professor Parra brings in experts who guide you through the process and provided feedback along the way!","If you haven't already taken a course with Professor Parra you absolutely need to."]}},"mostRecentQ":{"overall":"4.80","workload":"3.40","difficulty":null,"recommendation":"4.90","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"SPANSH 59H","course_id":"12912","cat_num":"159938","1s":"0","2s":"0","3s":"0","4s":"1","5s":"2"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SPANSH 59H","course_id":"12912","cat_num":"159938","1s":"0","2s":"2","3s":"1","4s":"0","5s":"0"}},"success":true}