{"scores":{"Fall '15":{"course_score":{"overall":"5.00","workload":"9.00","difficulty":null,"recommendation":"5.00","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"SPANSH 264","course_id":"13345","cat_num":"160621","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SPANSH 264","course_id":"13345","cat_num":"160621","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"}},"instructor_scores":[{"number":"SPANSH 264","cat_num":"160621","course_id":"13345","year":"2015","term":"1","id":"b113a1c6d7fc21bf79d923c1c611f693","first":" Mariano","last":"Siskind","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '15":{"comments":["It is an indispensable course for Latin Americanist or literature students interested in Latin American culture, especially for first year students. It maps the state of the arts of the field; it gives a mediated access to contemporary theoretical thinking in general; it helps the graduate student, particularly those in their first years of the PhD program, to get used to reading and discussing in theoretical\/methodological forms. It teaches where to look for the last trends and contributions, as well.\r\nThe course is also an excellent and abundant source of professional knowledge, from the how-to write pieces engaged critically with theory to the relationship to senior faculty in formal and informal spaces; from discussing in group, refining questions, and learning from peers, to getting to know details and experiences in postdoctorate scholar paths.","Any Latin Americanist, any student of literature needs at least one course in which \"theory,\" \"politics,\" and \"value\" are tackled head on. This is one of those courses.","This has got to be one of the most intellectualy challenging and nurturing courses I have taken in my life. If you have the chance to take it, do it.","One of the best courses I've ever had. The choice of readings was great, and allowed to learn a lot about the most recent theoretical movements--there are very few classes at the university that give that opportunity. The discussions were fruitful and lively, led by prof. Siskind in a way that made it possible to cover a lot of ground and have the more difficult questions clearly explained. Meeting a lot of the authors of the texts we read and discussing their work with them was an amazing opportunity. All in all, wonderful.","This class provides unparalleled exposure to top academics in Latin American Critical Theory worldwide. The reading is very hard, but Professor Siskind is very helpful if you misunderstand something. Everything that you produce is related to your larger project (probably thesis), so its a very relevant class to your larger academic studies.","Here, new Latin American thinking is brewing."]}},"mostRecentQ":{"overall":"5.00","workload":"9.00","difficulty":null,"recommendation":"5.00","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"SPANSH 264","course_id":"13345","cat_num":"160621","1s":"0","2s":"0","3s":"0","4s":"0","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"SPANSH 264","course_id":"13345","cat_num":"160621","1s":"0","2s":"0","3s":"2","4s":"1","5s":"0"}},"success":true}