{"scores":{"Spring '17":{"course_score":{"overall":"5.00","workload":"5.40","difficulty":null,"recommendation":"4.80","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"STAT 117","cat_num":"203104","course_id":"14763","year":"2016","term":"2","id":"0d97e1f2d75e62b83823ab2691af9f03","first":" Giovanni","last":"Parmigiani","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '17":{"comments":["The applications were very neat, and the course provided a large amount of flexibility to pursue topics of individual interest, with guidance.","I loved this class! Prof. Parmigiani is a wonderful instructor and the material is interesting and important. It was a nice survey of different methods and I liked that we covered a variety of topics, from MCMC to classification. It was especially nice to learn about all the different concepts in the context of the professor's work and research experience. Of course other classes mention applications, but this was the first class where I really got a sense of how someone uses machine learning methods in real life.\r\nThe small class size, relaxed atmosphere, and the professor's encouragement made it easy to participate in class discussions, which is rare outside of sections. I really appreciated how Prof. Parmigiani reacted to every comment as a valuable contribution to the discussion. \r\nAs to be expected with any new course, there was the occasional organizational\/logistical confusion, the instructors always handled it properly. I felt like they cared about our learning and wanted to avoid making our lives difficult, so I was never worried. \r\nOverall, this class was really great - I'm very happy I took it!","I strongly recommend this course, especially if it continues to be a smaller course as the section-like nature of lecture was helpful. It also helps that the prof makes a big effort to engage with student interest\/questions and is very responsive to emails. Sections are helpful and flexible. If this course were to get bigger, I would recommend that the course material is more organized and provides more basic definitions and outlines of lecture goals for review (10-15 minutes of review) before lectures","It is a great course for you to learn some modern data analysis methods in Biostatistics."]}},"mostRecentQ":{"overall":"5.00","workload":"5.40","difficulty":null,"recommendation":"4.80","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}