{"scores":{"Fall '15":{"course_score":{"overall":"5.00","workload":"6.00","difficulty":null,"recommendation":"5.00","enrollment":"13","response rate":"69.23","QCourseOverall":{"number":"TDM 129DA","course_id":"13281","cat_num":"160649","1s":"0","2s":"0","3s":"0","4s":"0","5s":"9"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"TDM 129DA","course_id":"13281","cat_num":"160649","1s":"0","2s":"6","3s":"1","4s":"1","5s":"0"}},"instructor_scores":[{"number":"TDM 129DA","cat_num":"160649","course_id":"13281","year":"2015","term":"1","id":"5535e4ca5df1bec073ba141b1db1c0eb","first":" William David","last":"Chambers","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.30"}]}},"comments":{"Fall '15":{"comments":["If this class is offered again with Professor Chambers, take this course! Some of the assignments are time consuming but you'll learn a lot. I'm a much better actor because of Prof Chambers.","This class is an incredible look into the Russian avant-garde - a theatrical tradition very different to what we experience here in the US and that has so much value to offer. It is a radically different way of rehearsing, acting and directing, that is virtually unknown in the West. Many of the materials we looked at, the Professor had to have personally translated from Russian, because they just aren't mass available in English. My classmate described it as 'like we're being let in on the biggest kept secret in theatre', and it was exhilarating.","If he ever comes back, take this class. It's a ridiculous amount of work but ridiculously worth it. He is a man of his time, theatrically and personally.","Professor Chambers is a truly incredible professor, and taking this course will change the way you think about theater. While assignments (especially the final project) will be time-intensive, you will gain so much from this course that you won't even mind. This class is super fun and definitely worth taking.","This is by far and away the best class I have ever taken, of any kind, anywhere. The techniques we delved into and the directors we learnt about completely revolutionised my view of theater as a whole. David Chambers was totally inspiring. If he returns, do not miss the chance to spend time with him.","This class will totally change the way you think about theater. I feel like my mind was blown and expanded and that I also got a great grasp on how to use the techniques we learned about in my own theater making.","This class will change the way you think about theatre. David is a magnanimous and galvanizing human being. No matter what your discipline within theatre, you'll be pushed to really dig deep and bring out more in your art.","A lot of hours, but definitely worth it if you are interested in theatre analysis\/literary analysis and acting! Russian theatre is a fascinating topic and David Chambers is full of fun anecdotes and insight, and it is awesome to hear first-hand accounts of what is going on in Russian theatre today, as many of the people we study are David's friends and colleagues!","Take this course. It will change the way you think about theater, and it will make your blood hot with the need to change the way theater is done."]}},"mostRecentQ":{"overall":"5.00","workload":"6.00","difficulty":null,"recommendation":"5.00","enrollment":"13","response rate":"69.23","QCourseOverall":{"number":"TDM 129DA","course_id":"13281","cat_num":"160649","1s":"0","2s":"0","3s":"0","4s":"0","5s":"9"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"TDM 129DA","course_id":"13281","cat_num":"160649","1s":"0","2s":"6","3s":"1","4s":"1","5s":"0"}},"success":true}