{"scores":{"Fall '15":{"course_score":{"overall":"4.20","workload":"2.60","difficulty":null,"recommendation":"4.30","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"TDM 129DB","course_id":"13063","cat_num":"159989","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"TDM 129DB","course_id":"13063","cat_num":"159989","1s":"5","2s":"5","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"TDM 129DB","cat_num":"159989","course_id":"13063","year":"2015","term":"1","id":"7a3533ee4ac80742e1a0f4b0ba533085","first":" Jeanne H.","last":"Slater","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '15":{"comments":["Take this course if you get the chance. I learned techniques from Professor Slater that I will use throughout life.","Don't expect it to be as focused on the body as a vocal class is on the voice; it's more general than that. That said, it will improve your physicality and overall acting. Definitely take the class if you get the opportunity.","This class was an amazing opportunity to develop one's acting skills with a Juilliard professor who commuted every Thursday from New York to work with us. The fact that I could take an acting class with a Juilliard professor at Harvard is an incredible example of the kind of unreal opportunities that are offered at this school, even in the arts. I would recommend this class to anyone who is very interested in acting, as it provided with the very important lesson of connecting our movement with the our voices \/ expression.","Jeanne is an absolute joy to work with! She is inspirational and supportive, and provides effective and specific feedback. Incorporating and adjusting scenes right away created a very open and flexible working environment where Jeanne was working on scenes with us, not judging us. If you are considering any class with Jeanne, take it! I always looked forward to her class - her positive energy, the relaxed tone of the class, and the break from papers and reading was always a welcome part of my week.","Not the most helpful class. Jeanne means well and has a lot of performance experience, but is maybe too casual with her students and the environment - pacing, feedback, learning - dragged in part because of this. Not as heavy on physical acting - just a lot of silent scenes and kitschy projects. I had a pleasant time, because it was a healthy environment, but did not learn much.","Do your work and be prepared in order to get the most out of this class.","Jeanne is an absolutely incredible theatre artist who is so knowledgable and know how to get us to step out of our comfort zones and expand our craft"]}},"mostRecentQ":{"overall":"4.20","workload":"2.60","difficulty":null,"recommendation":"4.30","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"TDM 129DB","course_id":"13063","cat_num":"159989","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"TDM 129DB","course_id":"13063","cat_num":"159989","1s":"5","2s":"5","3s":"0","4s":"0","5s":"0"}},"success":true}