{"scores":{"Spring '17":{"course_score":{"overall":"3.50","workload":"5.40","difficulty":null,"recommendation":"3.50","enrollment":"16","response rate":"81.25","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"VES 100","cat_num":"203367","course_id":"14614","year":"2016","term":"2","id":"63ca24ce66f277d1a77d91ae01806c8d","first":" Carrie","last":"Lambert-Beatty","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"3.40","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"3.60"}]}},"comments":{"Spring '17":{"comments":["The class was very scattered, and people were often confused during class. Some classes, such as the workshop with the librarian about how to use HOLLIS was something I did as a compulsory workshop in Freshman year and I felt like I was wasting my time. I feel many didn't even do the readings, and a lot of the effort I put in this class seemed wasted.","Although warned about the loose structure of the class, I didn't think that it would actually be that loose. The material never fully came together, and the class doesn't seem to know what it's goal is. If the course was about art history, then it surveyed way too many time periods. If the course was about the individual artists, then the arc never fully reached an end point. If the course was about preparing seniors for their future art careers, then it didn't spend enough time talking about the motivations of the artists. There was simply too much going on and not clear understanding of what was really important. I think Carrie is incredibly smart, but sometimes she let the class struggle to her idea without giving enough guidance.","I definitely learned a lot about what \"artists\" (in the sense of visual artists, mostly) have been historically and are now. I'm not really a big art history fan, and I knew this about myself going into the course (took it as a department requirement). So I found some of the material a little annoying personally, but it was still interesting intellectually. The workload was manageable, and I thought the assignments were well thought out. There were a few logistical kinks that probably had to do with it being the first semester the course was offered, and I feel confident that those will be worked out the next time.","Definitely look at the final paper and use your feelings about it to decide whether or not you'd like to take the course, most of the other assignments are related to it and the rest of the material is sort of supplementary, Carrie and Dan are great though!","test run was okay, but course will be better for future semesters for sure","Professor Lambert-Beatty is very smart and a great teacher; the class is worth it just to have a chance to work with her. The readings are great and the workload is reasonable. There isn't a whole lot of structure, but if you can deal with that, it will be worth your while!"]}},"mostRecentQ":{"overall":"3.50","workload":"5.40","difficulty":null,"recommendation":"3.50","enrollment":"16","response rate":"81.25","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}