{"scores":{"Spring '15":{"course_score":{"overall":"4.80","workload":"8.50","difficulty":null,"recommendation":"4.90","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"VES 31H","course_id":"11267","cat_num":"110050","1s":"0","2s":"0","3s":"1","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"VES 31H","course_id":"11267","cat_num":"110050","1s":"5","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 31H","cat_num":"110050","course_id":"11267","year":"2014","term":"2","id":"8ba3e72dbef48d556a841651ae0c6894","first":" Halsey Clark","last":"Rodman","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.30"}]}},"comments":{"Spring '15":{"comments":["I loved this class so much. It was exciting to be able to think and create in a very different way from my other non-VES classes. Halsey and Ross are phenomenal and I really enjoyed the critiques, where I learned so much about others' thinking processes and the meaning behind their individual projects.","I came out of the class with an understanding of how to conceptualize, model, and use materials to make the final sculpture. Halsey and Ross are incredibly talented, and they provide great feedback. They're flexible and understanding. And sometimes they understand what you're trying to visualize or make better than you do yourself. You also have the chance to work with a wide variety of materials and make all different kinds of sculptures. I was a total beginner; before the class, I had never done a single sculpture, but this class helped me discover my interest in sculpture and I feel a lot more confident approaching the field. And projects don't have to take that much time, but if you want to make something good, it will probably take a while. It all depends on your expectations for yourself.","Amazing class, and Halsey is great! Really well structured course. Learned a ton from it. You get to use a wide range of materials, and you have the opportunity to explore many cool ideas.","Halsey and Ross are amazing. It's a really great intro to sculpture and makes you think a lot about the way you perceive the world around you. The assignments were really interesting. The most frustrating aspect were other students not really caring about their art\/at times critique felt like a lot of bs but the course itself is a really really great chance to make interesting stuff and push yourself in new directions artistically.","Hands down the BEST class I've taken at Harvard","Take this class!! It is awesome!  Although there are a lot of projects and it requires a lot of out-of-class time it is so interesting and fun.  The teachers are super helpful and enthusiastic.  The class is as hard as you make it.  If you do take it, I encourage you to challenge yourself and explore the materials and tools available to you because you have SO MUCH FREEDOM."]}},"mostRecentQ":{"overall":"4.80","workload":"8.50","difficulty":null,"recommendation":"4.90","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"VES 31H","course_id":"11267","cat_num":"110050","1s":"0","2s":"0","3s":"1","4s":"2","5s":"5"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"VES 31H","course_id":"11267","cat_num":"110050","1s":"5","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}