{"scores":{"Spring '13":{"course_score":{"overall":"4.09","workload":"2.00","difficulty":"2.91","recommendation":"4.09","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"VES 55g","course_id":"5163","cat_num":"56638","1s":"0","2s":"1","3s":"1","4s":"5","5s":"4"},"QDifficulty":{"number":"VES 55g","course_id":"5163","cat_num":"56638","1s":"0","2s":"2","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"VES 55g","course_id":"5163","cat_num":"56638","1s":"3","2s":"5","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 55g","cat_num":"56638","course_id":"5163","year":"2012","term":"2","id":"b8f9cd2568e4961c70f0ba3cb281e536","first":" Philippe","last":"Grandrieux","InstructorOverall":"4.18","EffectiveLecturesorPresentations":"4.33","AccessibleOutsideClass":"3.27","GeneratesEnthusiasm":"4.64","FacilitatesDiscussionEncouragesParticipation":"3.56","GivesUsefulFeedback":"4.11","ReturnsAssignmentsinTimelyFashion":"4.67"}]}},"comments":{"Spring '13":{"comments":["Philippe Grandriex challenges you. It'll be worth it in the end. In general, the visiting VES professors are great for getting alternative perspectives and advice on screenwriting and film-making.","This class is unlike any other class because whatever you put in is what you'll get out of it.","This is not a class for those looking to write a Hollywood film.  This is a writer's and an artist's workshop.  I gained much from being exposed to Philippe's particular way of seeing the world, but relatively little from my classmates (by virtue of the class's structure, which I found discouraged collaboration).  The biggest practical takeaway was seeing the film as an object rather than a subject; in other words, the film must not be built around or ABOUT some thing, instead it should be built OF some thing. If this class is offered again, I would recommend it on the condition of the instructor's reputation and perspective.","The philosophy and approach towards writing for the screen the course teaches is completely unique, and something I believe will continue to be valuable as time goes on. The emphasis placed on writing something you will later produce is also a unique aspect that one may not find in any other screenwriting courses offered at the undergraduate level.","Great class for anyone who has plans on screenwriting for fun or seriously.  Philippe will teach you how to be organic about your writing so that naturally, what you write is honest and real, and by virtue, genuine and believable.  Good stuff.","This course is great for someone looking to write outside the box and find their own style, but may not be what someone is looking for to hone their screenwriting skills of a certain, pre-existing style.","Come without preconceived notions of \"good\" filmmaking.  Approaching this course with eagerness will allow you to complete it with a new sense of what writing styles produce visceral visual experiences."]}},"mostRecentQ":{"overall":"4.09","workload":"2.00","difficulty":"2.91","recommendation":"4.09","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"VES 55g","course_id":"5163","cat_num":"56638","1s":"0","2s":"1","3s":"1","4s":"5","5s":"4"},"QDifficulty":{"number":"VES 55g","course_id":"5163","cat_num":"56638","1s":"0","2s":"2","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"VES 55g","course_id":"5163","cat_num":"56638","1s":"3","2s":"5","3s":"3","4s":"0","5s":"0"}},"success":true}