{"scores":{"Fall '14":{"course_score":{"overall":"5.00","workload":"6.40","difficulty":null,"recommendation":"4.90","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"VES 142","course_id":"12734","cat_num":"10445","1s":"0","2s":"0","3s":"0","4s":"0","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"VES 142","course_id":"12734","cat_num":"10445","1s":"0","2s":"5","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 142","cat_num":"10445","course_id":"12734","year":"2014","term":"1","id":"d451aa3fe2c354b2c4dd4bec6e8e306b","first":" David","last":"Hilliard","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '14":{"comments":["Great class if you are looking to take your photography beyond just the aesthetic component. If you want to bring meaning, thought and depth into photography, then take this class. If you are more into just how cool your pictures are going to look, this class will be a hard class to complete well.","SO many great things to say about this course. It makes me sad that David Hilliard is only staying for a year - he is a GEM. Definitely the best photography professor I've ever had. He's approachable, enthusiastic, and an amazing lecturer. Ryan, too, is so knowledgable and helpful and accessible. The class environment was always fun, funny, and supportive. Everyone was helpful in giving suggestions in feedback, but the course allowed for full creative control of a semester-long project. Absolutely nothing bad to say about this course.","it obviously varies according to who teaches it; David and Ryan are wonderful and if there is an opportunity to take this course with them teaching it again it's not to be missed.","TAKE THIS CLASS TAKE THIS CLASS TAKE THIS CLASS TAKE THIS CLASS TAKE THIS CLASS.\n\nDavid and Ryan are amazing. They care and push you to be the best artist you can be. Plus they take expose you to amazing new talent by bringing you to author talks. Take the class. Its one of my top 5 best classes at Harvard.","This class was probably my favorite I've taken here. I don't know if you can take it with the same instructors, but the structure of the course and the theme of creating a photographic project is extremely helpful for understanding how you want to go forward with your work to create something meaningful and (almost) complete.","Take advantage of the film cameras offered. This might be your last chance to shoot medium format film ever! You need to be able to use a camera and be willing to spend a lot of time on this course."]}},"mostRecentQ":{"overall":"5.00","workload":"6.40","difficulty":null,"recommendation":"4.90","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"VES 142","course_id":"12734","cat_num":"10445","1s":"0","2s":"0","3s":"0","4s":"0","5s":"8"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"VES 142","course_id":"12734","cat_num":"10445","1s":"0","2s":"5","3s":"3","4s":"0","5s":"0"}},"success":true}