{"scores":{"Spring '17":{"course_score":{"overall":"4.80","workload":"4.50","difficulty":null,"recommendation":"4.80","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"WOMGEN 1239","cat_num":"203220","course_id":"14500","year":"2016","term":"2","id":"4df52a41d91ec8093b9ac3589143cd2d","first":" Michael","last":"Bronski","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '17":{"comments":["Bronski is an incredible professor and this class is a must take for anyone interested in US LGBTQ history!","This class was so fun and interesting. You won't learn a ton about AIDS as a disease or historical even, but you'll learn so much about it culturally and ontologically.","This course will introduce you to a wide variety of sources on the HIV\/AIDS epidemic and help you better understand a chapter of American history that most learn nothing about. You will have the opportunity to engage with ideas brought forth by sociologists, doctors, scientists, artists, cultural theorists, anthropologists, historians, people with HIV\/AIDS, and people from marginalized communities through the course readings. Depending on the people in your class, you are also likely to have a riveting discussion each time you walk through the door!","Bronski is a really interesting professor and this class will deeply engage you with history and nuances of HIV\/AIDS in the United States. A great way to get to know a professor well and a great way to explore this topic","This class was really interesting, and learning from Michael is an amazing opportunity. He is extremely kind and thoughtful, and also an expert on the culture around the AIDS epidemic(s). I really enjoyed it because it was low stress and I always felt supported. It's nice to have a small class where the professor\/TF clearly care about you as a person in addition to as a student. You get so much more out of this class if you actually do the readings and reach out for advice."]}},"mostRecentQ":{"overall":"4.80","workload":"4.50","difficulty":null,"recommendation":"4.80","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}